{"cards":[{"name":"Big Winner","manaCost":"{3}{R}","cmc":4.0,"colors":["R"],"colorIdentity":["R"],"type":"Creature — Ogre Warrior Guest","types":["Creature"],"subtypes":["Ogre","Warrior","Guest"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Big Winner has trample as long as you control a stickered permanent.","flavor":"The results of the test of strength were: Yes.","artist":"Paolo Parente","number":"101","power":"5","toughness":"2","layout":"normal","variations":["cf52a1b5-7515-5e58-9e19-25d2189d9cc7"],"rulings":[{"date":"2022-10-07","text":"The stickered permanent could be Big Winner itself or another permanent you control."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"c538171e-c8f0-513c-ae97-33d734fb603b"},{"name":"Carnival Barker","manaCost":"{2}{R}","cmc":3.0,"colors":["R"],"colorIdentity":["R"],"type":"Creature — Dog Employee","types":["Creature"],"subtypes":["Dog","Employee"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"{T}: You have thirty seconds to laud a creature you control to any people outside the game. Until end of turn, that creature gains trample and haste and gets +X/+0, where X is the number of those people who applauded. Activate only as a sorcery and only once.","artist":"Dave Greco","number":"102","power":"3","toughness":"3","layout":"normal","variations":["9b4efed2-9d20-5731-bc92-5f72e1acc324"],"rulings":[{"date":"2022-10-07","text":"The thirty seconds starts as the ability starts resolving and you start lauding. Someone should be ready to time you before you activate the ability."},{"date":"2022-10-07","text":"Lauding means singing the praises of the creature in question. Complimenting it. Telling everyone of its awesomeness, that kind of thing. Don’t stray off-topic. And resist the urge to say “Please clap”—86% of audiences don’t respond well to desperation."},{"date":"2022-10-07","text":"“Only once” means once for that particular creature. If a different copy of Carnival Barker enters the battlefield, or if Carnival Barker leaves the battlefield and returns, it’s a new object and its ability can be activated. Please be considerate of others around you before designing a deck around blinking and activating Carnival Barker three times each turn."},{"date":"2022-10-07","text":"If another player gains control of a Carnival Barker whose ability has been activated, they won’t be able to activate it. That Barker’s all barked out."}],"printings":["UNF"],"id":"17b9bdc9-ff74-5109-aeed-a0b728227d63"},{"name":"Circuits Act","manaCost":"{2}{R}","cmc":3.0,"colors":["R"],"colorIdentity":["R"],"type":"Sorcery","types":["Sorcery"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Roll three six-sided dice. For each different result, create a 1/1 white Clown Robot artifact creature token.","flavor":"Another day, another item Pietra has to add to the \"do not juggle\" database.","artist":"Jakub Kasper","number":"103","layout":"normal","multiverseid":"580668","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580668&type=card","variations":["59991f44-c682-5b25-bd32-933a306e7a8f"],"rulings":[{"date":"2022-10-07","text":"For example, if you rolled 1, 4, and 4, you’d create two Clown Robots. If you rolled triples, you’d create one Clown Robot."}],"printings":["UNF"],"originalText":"Roll three six-sided dice. For each different result, create a 1/1 white Clown Robot artifact creature token.","originalType":"Sorcery","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"4c9cd78b-257e-56cb-a9cd-8e95ba47c2a6"},{"name":"Devil K. Nevil","manaCost":"{2}{R}","cmc":3.0,"colors":["R"],"colorIdentity":["R"],"type":"Legendary Creature — Devil Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Devil","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"Haste\nWhen Devil K. Nevil enters the battlefield, jump it over any number of creatures. If it clears those creatures, put that many +1/+1 counters on it. (You can see a jumping demonstration at DevilKNevil.com.)","flavor":"\"Danger is my middle name. Also, I don't know how to spell.\"","artist":"Paolo Parente","number":"104","power":"2","toughness":"1","layout":"normal","variations":["d28f6ced-770d-5114-bf3b-bbb4568fa9ef","3574c497-dc4d-5fd8-9aab-cfa75b1efb94","e9694fbc-86c7-5ff6-8e70-717c69a53f41"],"rulings":[{"date":"2022-10-07","text":"In case the video doesn’t clarify what jumping Devil K. Nevil over any number of creatures means, perhaps a lengthy text explanation will help. First, place Devil K. Nevil at the edge of the table such that about half the card vertically is sticking over the edge of the table. Then take any number of creatures on the battlefield and place them side-by-side on the table in front of Devil K. Nevil. Those creature cards should be horizontal to Devil K. Nevil’s vertical from your perspective (unless they’re not cards—see below). Ideally, the first creature card should be as close to Devil K. Nevil as it can be without touching it, but if you’d like to make the jump more difficult, we’re not going to stop you. To execute the jump, flick Devil K. Nevil from underneath to cause it to fly up into the air and forward, majestically flying over the line of creatures. You can’t just flick him horizontally. Devil craves hang time. If Devil comes to rest completely past the creatures without touching any of them, it has cleared those creatures and will earn those +1/+1 counters. If it touches any of the creatures during the jump, that’s okay, as long as Devil comes to rest past the creatures, not touching any of them. All of Devil K. Nevil must be past the farthest creature for the jump to be successful. If Devil veers off to the side and doesn’t get farther than the last creature, the jump is unsuccessful, even if it comes to rest not touching any of the creatures. An unsuccessful jump has no consequences other than shame. Shame and no +1/+1 counters."},{"date":"2022-10-07","text":"You may use any creatures on the battlefield except Devil K. Nevil itself for the jump, including your opponent’s creatures. You are limited to the number of other creatures on the battlefield for the jump attempt."},{"date":"2022-10-07","text":"For anything involved in the jump that’s a token, including Devil K. Nevil itself, use a Magic card-sized card as a substitute. Magic cards are the most Magic card-sized thing we can think of."},{"date":"2022-10-07","text":"For any card involved in the jump, the card sleeve it’s in is considered part of the card."},{"date":"2022-10-07","text":"You may choose to jump over no creatures—and thus not attempt a jump—if you want. If there are no other creatures on the battlefield as the enters-the-battlefield ability resolves, Devil K. Nevil is a stunt devil without a stunt and there won’t be a jump."},{"date":"2022-10-07","text":"The jump is considered attempted if your hand makes contact with Devil K. Nevil and it moves. You can’t use anything other than your hand to flick Devil K. Nevil. If you’re wearing gloves (which are basically card sleeves for hands), those count as part of your hand."},{"date":"2022-10-07","text":"If Devil K. Nevil is in a card sleeve, you may take it out of the sleeve if you’d like (assuming you own the card; ask permission if you don’t). However, no other modifications are allowed to the card. You can’t put anything into the sleeve to make it heavier, for example. You also can’t bend, fold, or do anything else to the card that would make it unplayable in your deck."}],"printings":["UNF"],"id":"d1d1df68-eae4-5701-a2c2-9fdff7e21860"},{"name":"Don't Try This at Home","manaCost":"{1}{R}","cmc":2.0,"colors":["R"],"colorIdentity":["R"],"type":"Enchantment","types":["Enchantment"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"If a hot source you control would deal damage to a player or permanent, it deals that much damage plus 1 instead. (Something is hot if it has hot things in its art, like fire or explosions.)\n{1}{R}, Sacrifice Don't Try This at Home: It deals damage equal to twice the number of hot cards in your graveyard to target creature or planeswalker.","artist":"Tyler Walpole","number":"105","layout":"normal","variations":["2eaee88a-aaee-5770-9662-dca33d604f59"],"rulings":[{"date":"2022-10-07","text":"Don’t Try This at Home has received a minor update to its rules text. The first ability is a replacement effect, not a triggered ability. The updated wording appears above."},{"date":"2022-10-07","text":"Hot refers to temperature, not physical attractiveness, internet trendiness, or any other non-temperature-related meanings. Hot items may include objects that are traditionally hot, such as flames or the sun, or they may also include objects that are shown to be hot, such as a magic sword melting the item it’s touching."},{"date":"2022-10-07","text":"The hot thing doesn’t need to be the focus of the illustration, nor does it need to be the actual card being depicted. It just needs to be somewhere in the art. It could even be a sticker."},{"date":"2022-10-07","text":"The additional 1 damage is dealt by the same source as the original source of damage. The damage isn’t dealt by Don’t Try This at Home unless it is the original source of damage. Note that while it is the source of damage for its activated ability, it won’t be on the battlefield as that ability resolves and its first ability won’t increase the damage it deals. (However, if it’s still in the graveyard at that time, it will count itself, as it is very much a hot card.)"},{"date":"2022-10-07","text":"If another effect modifies how much damage your hot source would deal, including preventing some of it, the player being dealt damage or the controller of the permanent being dealt damage chooses an order in which to apply those effects. If all of the damage is prevented, Don’t Try This at Home’s effect no longer applies."},{"date":"2022-10-07","text":"If damage dealt by a hot source you control is being divided or assigned among multiple permanents an opponent controls or among an opponent and one or more permanents they control, divide the original amount before adding 1. For example, if you attack with a 5/5 hot creature with trample and your opponent blocks with a 2/2 creature, you can assign 2 damage to the blocker and 3 damage to the defending player. These amounts are then modified to 3 and 4, respectively."}],"printings":["UNF"],"id":"cc8b4ad6-a9df-5150-92d2-1f883afebeb5"},{"name":"Eelectrocute","manaCost":"{1}{R}","cmc":2.0,"colors":["R"],"colorIdentity":["R"],"type":"Instant","types":["Instant"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Eelectrocute deals 2 damage to any target.\nYou may cast Eelectrocute from your graveyard as long as you've rolled a 6 this turn. If you cast Eelectrocute this way and it would be put into your graveyard, exile it instead.","flavor":"The midway's games aren't so much rigged as they are insulated and grounded.","artist":"Dave Greco","number":"106","layout":"normal","multiverseid":"580669","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580669&type=card","variations":["cb399ebd-c1df-586b-8ec1-5311a7af526a"],"rulings":[{"date":"2022-10-07","text":"If you cast Eelectrocute from your graveyard, you still pay its costs."},{"date":"2022-10-07","text":"If you cast Eelectrocute from your graveyard using another permission, you won’t exile it instead (unless that permission also states that you exile it)."},{"date":"2022-10-07","text":"For the last ability, it doesn’t matter how many pips the die you rolled a 6 on had, whether that was a six-sided die or a d20. As long as you rolled a 6 on any die that turn, you may cast Eelectrocute from your graveyard."}],"printings":["UNF"],"originalText":"Eelectrocute deals 2 damage to any target.\nYou may cast Eelectrocute from your graveyard as long as you've rolled a 6 this turn. If you cast Eelectrocute this way and it would be put into your graveyard, exile it instead.","originalType":"Instant","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"7958b797-2eb7-5872-9c77-3053f068225a"},{"name":"_____ Goblin","manaCost":"{2}{R}","cmc":3.0,"colors":["R"],"colorIdentity":["R"],"type":"Creature — Goblin Guest","types":["Creature"],"subtypes":["Goblin","Guest"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"When this creature enters the battlefield, you may put a name sticker on it. Add {R} for each unique vowel on that sticker. (The vowels are A, E, I, O, U, and Y.)","flavor":"The Astrotorium has never been a place for self-restraint.","artist":"Chuck Lukacs","number":"107","power":"2","toughness":"2","layout":"normal","variations":["b349cc63-1757-59eb-a1b8-e0e2cfdf4900"],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"2149c489-5ddc-5aeb-bda6-b53c24e4562c"},{"name":"Goblin Airbrusher","manaCost":"{1}{R}","cmc":2.0,"colors":["R"],"colorIdentity":["R"],"type":"Creature — Goblin Employee","types":["Creature"],"subtypes":["Goblin","Employee"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Whenever you place a sticker, create a Treasure token. If it's an art sticker, instead create two Treasure tokens. (They're artifacts with \"{T}, Sacrifice this artifact: Add one mana of any color.\")","flavor":"Once he'd worked out which end of the thing the paint came from, he was promoted to shirt duty.","artist":"Caroline Gariba","number":"108","power":"2","toughness":"1","layout":"normal","multiverseid":"580671","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580671&type=card","variations":["d53f434e-eadd-54c2-b43f-b1e02bc780ab"],"printings":["UNF"],"originalText":"Whenever you place a sticker, create a Treasure token. If it's an art sticker, instead create two Treasure tokens. (They're artifacts with \"{T}, Sacrifice this artifact: Add one mana of any color.\")","originalType":"Creature — Goblin Employee","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"22718764-ec13-50f4-b019-aaf94df0ee0f"},{"name":"Goblin Blastronauts","manaCost":"{3}{R}{R}","cmc":5.0,"colors":["R"],"colorIdentity":["R"],"type":"Creature — Goblin Employee","types":["Creature"],"subtypes":["Goblin","Employee"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"When Goblin Blastronauts enters the battlefield, open an Attraction.\nWhenever you roll a 6, you may copy the spell, ability, or Attraction visit that caused you to roll that die. You may choose new targets for the copy.","flavor":"The goblins really put themselves into the fireworks show, despite Myra's pleas to stop.","artist":"Dave Allsop","number":"109","power":"5","toughness":"4","layout":"normal","variations":["0c1ba9f3-a6f6-5d6c-bab5-a1894fdcd70f"],"rulings":[{"date":"2022-10-07","text":"If you copy a spell or ability, the spell or ability will include instructions to roll more dice. You don’t automatically carry the 6 from the original roll over to the copy. On the plus side, this gives you the chance to roll more 6s!"},{"date":"2022-10-07","text":"If you copy an Attraction visit, roll another six-sided die and visit Attractions based on the result as you normally would. If you roll another 6, that will trigger Goblin Blastronauts’s last ability again, which can let you roll another 6. You can keep visiting Attractions this way until your luck runs out or you get sick of the rides."},{"date":"2022-10-07","text":"If you roll multiple 6s, Goblin Blastronauts’s ability will trigger for each 6 you rolled, allowing you to copy the spell or ability that caused the die roll that many times. (Attraction visits always include only a single die roll.)"},{"date":"2022-10-07","text":"Activated and triggered abilities can be copied. Other abilities can’t. If the roll happened because of a replacement effect as part of a static ability (for example, the ability that sets Vedalken Squirrel-Whacker’s base power and toughness), that ability isn’t copied. Mana abilities also can’t be copied."}],"printings":["UNF"],"id":"a5c0136c-1f93-50b4-99d0-0170938ece07"},{"name":"Goblin Cruciverbalist","manaCost":"{2}{R}","cmc":3.0,"colors":["R"],"colorIdentity":["R"],"type":"Creature — Goblin Wizard Guest","types":["Creature"],"subtypes":["Goblin","Wizard","Guest"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"Haste\nWhen Goblin Cruciverbalist enters the battlefield, create a colorless artifact token named your choice of A, E, I, O, or U.\nWhenever Goblin Cruciverbalist attacks, using the first letters of names of permanents you control, spell a word you haven't spelled this game. It gets +1/+0 until end of turn for each letter in that word.","artist":"Mike Burns","number":"110","power":"1","toughness":"4","layout":"normal","variations":["0ca70b42-e9a1-51ae-905a-e4bb71d96c25"],"rulings":[{"date":"2022-10-07","text":"The token will have one of five names: A, E, I, O, or U. It won’t be named “your choice of A, E, I, O, or U.”"},{"date":"2022-10-07","text":"The token doesn’t have any abilities and doesn’t usually do much except give you a vowel to work with when spelling words."},{"date":"2022-10-07","text":"When determining the first letter of a name, ignore all spaces and punctuation, including blank lines."},{"date":"2022-10-07","text":"Each time you spell a word, you can use the first letter of each permanent you control only once in that word. For example, if you control three permanents starting with A, B, and N, you can spell out the words “Ban” or “Nab,” but you can’t spell out “Banana” unless you gain control of two more A’s and another N."},{"date":"2022-10-07","text":"“Haven’t spelled this game” means for any game reason, including previous Goblin Cruciverbalists you controlled but not including words you just spelled for fun, like . . . um, people do. Keep track of the words you spell if you expect remembering them to be challenging."},{"date":"2022-10-07","text":"You may consult a dictionary if not all players agree that you have chosen a cromulent word."}],"printings":["UNF"],"id":"b8369e15-cd47-56f6-a6af-508b22dcab61"},{"name":"Goblin Girder Gang","manaCost":"{3}{R}","cmc":4.0,"colors":["R"],"colorIdentity":["R"],"type":"Creature — Goblin Employee","types":["Creature"],"subtypes":["Goblin","Employee"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Reach\nWhenever you roll a die, if the result isn't stored on Goblin Girder Gang, you may store that result on it. When you do, Goblin Girder Gang deals 1 damage to any target without a hat.\nGoblin Girder Gang gets +1/+0 for each result stored on it.","artist":"Tyler Walpole","number":"111","power":"0","toughness":"4","layout":"normal","variations":["353598c3-b41f-54db-8ccf-0d3def527283"],"rulings":[{"date":"2022-10-07","text":"Goblin Girder Gang has received a minor update to its triggered ability. Specifically, the ability will check both as it triggers and as it tries to resolve to see if the result is stored on Goblin Girder Gang. For example, if 3 is not stored on Goblin Girder Gang and you roll two 3s, the ability will trigger twice. If you store the first 3 on it, the second ability won’t resolve as it will see that 3 is now stored on Goblin Girder Gang."},{"date":"2022-10-07","text":"To store a result means to lock the result and save it on Goblin Girder Gang. Once a certain result is stored on Goblin Girder Gang, it remains stored until Goblin Girder Gang leaves the battlefield."},{"date":"2022-10-07","text":"You can store any result of a die roll on Triple G, including numbers lower than 1, numbers higher than 6, and even numbers higher than 20. You can even store non-numbers such as blank faces or CHAOS by rolling the planar die."},{"date":"2022-10-07","text":"A target is “without a hat” if they don’t meet the criteria for “having a hat.” (You probably don’t need to look that up. It means what you think it means.)"}],"printings":["UNF"],"id":"1c566088-6d40-5e0a-93cb-30200ec633a5"},{"name":"Ignacio of Myra's Marvels","manaCost":"{2}{R}{R}","cmc":4.0,"colors":["R"],"colorIdentity":["R"],"type":"Legendary Creature — Lizard Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Lizard","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"As Ignacio of Myra's Marvels enters the battlefield, choose armor, blood, book, bottle, fang, fire, scroll, spear, sword, or water.\nWhenever you cast a spell with the chosen object in its art, create two Treasure tokens.\nPartner (You can have two commanders if both have partner.)","artist":"Gaboleps","number":"112","power":"4","toughness":"3","layout":"normal","variations":["b27e6eec-3628-5353-9e75-853485c957b7","e5f34607-41de-5e76-bd43-bcaef4a9915f","e6f64c87-a612-54d3-b063-a96d45cd6ec5"],"rulings":[{"date":"2022-10-07","text":"Armor is a covering worn on the body to protect against damage. It is typically metal or leather, although it can be made from anything. It can’t be a natural part of the creature."},{"date":"2022-10-07","text":"Blood is a liquid, usually red, that comes from within a creature’s circulatory system. If the blood isn’t with its previous owner—say it’s in a pool on the floor—the previous owner doesn’t need to be in the art. The blood does need to contextually be blood. Red liquid in a goblet might not be blood. Red liquid in a goblet held by a vampire? Blood. Red anything at a wedding for a pair of ancient vampires? Take a wild guess."},{"date":"2022-10-07","text":"A book is any bound pages of writing, usually with a spine of some sort. Scrolls are not books. They are scrolls. See: Scroll."},{"date":"2022-10-07","text":"A bottle is a device intended to hold liquid or small objects. It is usually made of glass. Bottles typically have necks and are designed to pour their contents. The bottle may be empty, but it should clearly be designed to hold something."},{"date":"2022-10-07","text":"A fang is a tooth, typically longer than a creature’s other teeth, and typically used to puncture enemies, often to drink their blood. The presence of non-fang teeth is important to establish that what you see are fangs and the creature just doesn’t have very long teeth."},{"date":"2022-10-07","text":"Fire is combustion or burning, whereby substances combine chemically with oxygen from the air and typically give out bright light, heat, and smoke. Fire is usually red, orange, or yellow, but it can be other colors. Note that being a hot thing doesn’t necessarily make something fire. Magma and lava, for example, are not inherently fire, although they may cause fire."},{"date":"2022-10-07","text":"A scroll is one or more pages or parchments, usually designed to be rolled up. Scrolls can be open or closed. Books are not scrolls. They are books. See: Book."},{"date":"2022-10-07","text":"A spear is the recommended serving size of pickle. It is also a pole with a pointed blade on one end. It is traditionally a weapon. For our purposes, the spear can be thrown (javelins are okay), as long the weapon’s general shape clearly implies spear. It can be sticking out of a body."},{"date":"2022-10-07","text":"A sword is a bladed weapon with a handle. If a creature is wearing a scabbard with a sword in it, and all you can see is the handle, that counts."},{"date":"2022-10-07","text":"Water is a liquid found in lakes, oceans, pools, wells, rivers, and glasses both half-empty and half-full. The liquid must contextually be water. Rain counts. Note that you must see the water. A well wouldn’t count if you couldn’t see the water inside, for example, even if the water is implied."},{"date":"2022-10-07","text":"If all players can’t agree on what’s in the art, you may consult an outside person for a final determination."}],"printings":["UNF"],"id":"1fe57a4e-0f93-5dea-83d0-c3c33558bf6b"},{"name":"Juggletron","manaCost":"{2}{R}","cmc":3.0,"colors":["R"],"colorIdentity":["R"],"type":"Artifact Creature — Clown Robot","types":["Artifact","Creature"],"subtypes":["Clown","Robot"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Trample\nWhenever Juggletron attacks, you may put an art sticker on it.\nJuggletron gets +3/+0 for each item in its art that's not touching Juggletron, another item, or the card frame.","flavor":"It's all fun and games until it drops a guest. Then it's a misdemeanor.","artist":"Matt Dixon","number":"113","power":"0","toughness":"4","layout":"normal","variations":["6c3f02d7-edbe-52dd-87f8-a0f172437dc3"],"rulings":[{"date":"2022-10-07","text":"In order to count toward Juggletron’s power bonus, a sticker must be completely within Juggletron’s art, such that no part of the sticker is touching the frame, another sticker, or Juggletron itself. This includes the entire sticker, including the white border."},{"date":"2022-10-07","text":"Additionally, the stickers must depict tangible items, so sound effects, thought bubbles, and the like won’t count."},{"date":"2022-10-07","text":"If you put name, ability, or power and toughness stickers in Juggletron’s art, they’ll do what they’re supposed to do as stickers, but they aren’t items Juggletron can juggle."},{"date":"2022-10-07","text":"Counters are also items that Juggletron can’t juggle. They’re not part of the art, and Juggletron just can’t get a grasp on them."}],"printings":["UNF"],"id":"73ad2c9d-d56b-569a-a206-f670ca6d2846"},{"name":"Minotaur de Force","manaCost":"{1}{R}","cmc":2.0,"colors":["R"],"colorIdentity":["R"],"type":"Creature — Minotaur Performer","types":["Creature"],"subtypes":["Minotaur","Performer"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Haste\nWhen Minotaur de Force enters the battlefield, you get {TK}, then you may put a sticker on a nonland permanent you own.","flavor":"\"If I ever need a haircut, I just fall a little to the left.\"","artist":"Gaboleps","number":"114","power":"2","toughness":"1","layout":"normal","multiverseid":"580672","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580672&type=card","variations":["6dc7e35e-6f49-5901-b5ab-ff3dfd00fe08"],"printings":["UNF"],"originalText":"Haste\nWhen Minotaur de Force enters the battlefield, you get {Ticket}, then you may put a sticker on a nonland permanent you own.","originalType":"Creature — Minotaur Performer","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"b1f2b6e5-6a24-5bd3-a88f-dba1e1bdbcdc"},{"name":"Non-Human Cannonball","manaCost":"{2}{R}","cmc":3.0,"colors":["R"],"colorIdentity":["R"],"type":"Artifact Creature — Clown Robot","types":["Artifact","Creature"],"subtypes":["Clown","Robot"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"When Non-Human Cannonball dies, roll a six-sided die. If the result is 4 or less, Non-Human Cannonball deals that much damage to you.","flavor":"Designed for maximum impact, comedic and otherwise.","artist":"Ralph Horsley","number":"115","power":"4","toughness":"3","layout":"normal","multiverseid":"580673","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580673&type=card","variations":["1cdbe66a-4458-5cd1-8e7c-c00f352f1de8"],"rulings":[{"date":"2022-10-07","text":"If the result is somehow negative because of effects that modify the die roll, Non-Human Cannonball deals 0 damage to you."}],"printings":["UNF"],"originalText":"When Non-Human Cannonball dies, roll a six-sided die. If the result is 4 or less, Non-Human Cannonball deals that much damage to you.","originalType":"Artifact Creature — Clown Robot","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"2ddd44cc-66f6-5ff2-a400-9711f69a9709"},{"name":"Omniclown Colossus // Pie-roclasm","manaCost":"{8}{R}{R}","cmc":10.0,"colors":["R"],"colorIdentity":["R"],"type":"Artifact Creature — Clown Robot","types":["Artifact","Creature"],"subtypes":["Clown","Robot"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"Affinity for Clowns (This spell costs {1} less to cast for each Clown you control.)\nTrample","artist":"Ralph Horsley","number":"116","power":"7","toughness":"7","layout":"adventure","variations":["85a8e127-fae1-547c-82fb-0185a64aad2a"],"rulings":[{"date":"2022-10-07","text":"Only the Omniclown Colossus has affinity for Clowns. Pie-roclasm is indifferent toward Clowns and will not cost {1} less for each Clown you control."},{"date":"2022-10-07","text":"A single Pie-roclasm will destroy all non-Clown creatures with toughness 3 or less. Two will destroy all non-Clown creatures with toughness 6 or less. Three, with toughness 9 or less. Four, with toughness 12 ½ or less. That’s a lot of pie."},{"date":"2022-10-07","text":"If damage from Pie-roclasm gets redirected to a player, just use 3.14."},{"date":"2022-10-07","text":"All the rulings from this point on are about how to play with Adventures. If you are an experienced adventurer, you can venture forth."},{"date":"2022-10-07","text":"An adventurer card is a permanent card in every zone except the stack, as well as while on the stack if not cast as an Adventure. Ignore its alternative characteristics in those cases. For example, while it’s in your graveyard, Omniclown Colossus is a red artifact creature card whose mana value is 10."},{"date":"2022-10-07","text":"When casting a spell as an Adventure, use the alternative characteristics and ignore all of the card’s normal characteristics. The spell’s color, mana cost, mana value, and so on are determined by only those alternative characteristics. If the spell leaves the stack, it immediately resumes using its normal characteristics."},{"date":"2022-10-07","text":"If a spell is cast as an Adventure, its controller exiles it instead of putting it into its owner’s graveyard as it resolves. For as long as it remains exiled, that player may cast it as a permanent spell. If an Adventure spell leaves the stack in any way other than resolving (Pie-roclasm doesn’t require targets, so most likely by being countered), that card won’t be exiled and the spell’s controller won’t be able to cast it as a creature later."},{"date":"2022-10-07","text":"If an adventurer card ends up in exile for any other reason than by exiling itself while resolving, it won’t give you permission to cast it as a creature spell."},{"date":"2022-10-07","text":"You must still follow any timing restrictions and permissions for the creature spell you cast from exile. Normally, you’ll be able to cast it only during your main phase while the stack is empty."},{"date":"2022-10-07","text":"If an effect copies an Adventure spell, that copy is exiled as it resolves. It ceases to exist as a state-based action; it’s not possible to cast the copy as a creature."},{"date":"2022-10-07","text":"If an object becomes a copy of an object that has an Adventure, the copy also has an Adventure. If it changes zones, it will either cease to exist (if it’s a token) or cease to be a copy (if it’s a nontoken permanent), and so you won’t be able to cast it as an Adventure."}],"printings":["UNF"],"id":"fc67e003-fae4-5b85-9ffc-69190efb5c81"},{"name":"Omniclown Colossus // Pie-roclasm","manaCost":"{3}{R}{R}","cmc":10.0,"colors":["R"],"colorIdentity":["R"],"type":"Sorcery — Adventure","types":["Sorcery"],"subtypes":["Adventure"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"Pie-roclasm deals π damage to each non-Clown creature. (How to calculate π isn't important. It's a smidgen more than 3.)","artist":"Ralph Horsley","number":"116","layout":"adventure","variations":["b70593a5-4091-5d28-87f6-293a019efbe9"],"rulings":[{"date":"2022-10-07","text":"Only the Omniclown Colossus has affinity for Clowns. Pie-roclasm is indifferent toward Clowns and will not cost {1} less for each Clown you control."},{"date":"2022-10-07","text":"A single Pie-roclasm will destroy all non-Clown creatures with toughness 3 or less. Two will destroy all non-Clown creatures with toughness 6 or less. Three, with toughness 9 or less. Four, with toughness 12 ½ or less. That’s a lot of pie."},{"date":"2022-10-07","text":"If damage from Pie-roclasm gets redirected to a player, just use 3.14."},{"date":"2022-10-07","text":"All the rulings from this point on are about how to play with Adventures. If you are an experienced adventurer, you can venture forth."},{"date":"2022-10-07","text":"An adventurer card is a permanent card in every zone except the stack, as well as while on the stack if not cast as an Adventure. Ignore its alternative characteristics in those cases. For example, while it’s in your graveyard, Omniclown Colossus is a red artifact creature card whose mana value is 10."},{"date":"2022-10-07","text":"When casting a spell as an Adventure, use the alternative characteristics and ignore all of the card’s normal characteristics. The spell’s color, mana cost, mana value, and so on are determined by only those alternative characteristics. If the spell leaves the stack, it immediately resumes using its normal characteristics."},{"date":"2022-10-07","text":"If a spell is cast as an Adventure, its controller exiles it instead of putting it into its owner’s graveyard as it resolves. For as long as it remains exiled, that player may cast it as a permanent spell. If an Adventure spell leaves the stack in any way other than resolving (Pie-roclasm doesn’t require targets, so most likely by being countered), that card won’t be exiled and the spell’s controller won’t be able to cast it as a creature later."},{"date":"2022-10-07","text":"If an adventurer card ends up in exile for any other reason than by exiling itself while resolving, it won’t give you permission to cast it as a creature spell."},{"date":"2022-10-07","text":"You must still follow any timing restrictions and permissions for the creature spell you cast from exile. Normally, you’ll be able to cast it only during your main phase while the stack is empty."},{"date":"2022-10-07","text":"If an effect copies an Adventure spell, that copy is exiled as it resolves. It ceases to exist as a state-based action; it’s not possible to cast the copy as a creature."},{"date":"2022-10-07","text":"If an object becomes a copy of an object that has an Adventure, the copy also has an Adventure. If it changes zones, it will either cease to exist (if it’s a token) or cease to be a copy (if it’s a nontoken permanent), and so you won’t be able to cast it as an Adventure."}],"printings":["UNF"],"id":"1b032576-c900-5132-b9a2-c8a6c09b5e43"},{"name":"One-Clown Band","manaCost":"{1}{R}","cmc":2.0,"colors":["R"],"colorIdentity":["R"],"type":"Artifact Creature — Clown Robot Bard","types":["Artifact","Creature"],"subtypes":["Clown","Robot","Bard"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"{2}{R}: Target Robot gets +2/+0 until end of turn.","flavor":"Programmed to play more than seventy instruments and only one song.","artist":"Ralph Horsley","number":"117","power":"1","toughness":"3","layout":"normal","multiverseid":"580674","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580674&type=card","variations":["2517ac9e-13e1-5dc7-8453-dac60ee86ad7"],"printings":["UNF"],"originalText":"{2}{R}: Target Robot gets +2/+0 until end of turn.","originalType":"Artifact Creature — Clown Robot Bard","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"33bab751-55e2-527e-8fe3-465771a0641d"},{"name":"Opening Ceremony","manaCost":"{4}{R}{R}","cmc":6.0,"colors":["R"],"colorIdentity":["B","G","R","U","W"],"type":"Sorcery","types":["Sorcery"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"Add {W}{U}{B}{R}{G}{C}. You may open a sealed Magic booster pack. Until end of turn, you may cast spells from among the cards in that booster pack.","flavor":"\"Oooooh!\"\n—The crowd\n\"Aaaaaaaaah!\"\n—Also the crowd","artist":"Greg Bobrowski","number":"118","layout":"normal","variations":["b7502f9b-f561-5ecb-9326-0351abe2f610"],"rulings":[{"date":"2022-10-07","text":"You can use any unopened, official Magic booster pack, including promotional booster packs."},{"date":"2022-10-07","text":"You must still pay all costs and follow all normal timing rules when casting spells from among the cards in the booster pack."},{"date":"2022-10-07","text":"The spells you cast this way are cast from outside the game. Casting a card brings it into the game. After the spell leaves the stack, it will go to the battlefield, the graveyard, exile, or wherever it’s supposed to go depending on what type of spell it is. Remove the card from your deck after the game ends."},{"date":"2022-10-07","text":"Opening Ceremony has four lines of flavor text."}],"printings":["UNF"],"id":"d72b09c5-7683-5ed7-b4bf-c730c500fc91"},{"name":"Priority Boarding","manaCost":"{2}{R}","cmc":3.0,"colors":["R"],"colorIdentity":["R"],"type":"Enchantment","types":["Enchantment"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Whenever you roll a die, you may reveal the top card of your library. Do this only once each turn. Whenever you reveal a card with mana value less than the result this way, you may exile it. If you do, you may play it this turn.","flavor":"The Astrotorium's express lane is practically its own ride.","artist":"Greg Bobrowski","number":"119","layout":"normal","variations":["f17f1c0b-f622-58d2-bde0-c787263e0cc8"],"rulings":[{"date":"2022-10-07","text":"If you roll several dice at the same time, that will trigger the ability once for each roll. You can choose which result you want to reveal a card for."},{"date":"2022-10-07","text":"Once you choose to reveal the top card of your library during the resolution of Priority Boarding’s ability, that ability won’t trigger again that turn, no matter how many more dice you roll. This is true even if the card you reveal has a mana value too great to be exiled or you reveal a card you could exile but choose not to."},{"date":"2022-10-07","text":"Priority Boarding doesn’t change when you can play the exiled card. For example, if you exile a sorcery card, you can cast it only during your main phase when the stack is empty. If you exile a land card, you can play it only during your main phase and only if you have an available land play remaining."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"aed8fe33-181e-5d35-9869-5a4e114bb133"},{"name":"Proficient Pyrodancer","manaCost":"{2}{R}","cmc":3.0,"colors":["R"],"colorIdentity":["R"],"type":"Creature — Human Performer","types":["Creature"],"subtypes":["Human","Performer"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"When Proficient Pyrodancer enters the battlefield, you may put an art sticker on a nonland permanent you own.\n{2}{R}: Another target creature with an art sticker on it gets +2/+0 and gains menace until end of turn.","flavor":"When she performed, she was on fire, but in a good way.","artist":"John Thacker","number":"120","power":"2","toughness":"3","layout":"normal","multiverseid":"580676","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580676&type=card","variations":["66a94768-6f96-5692-bf50-02173cfacabf"],"printings":["UNF"],"originalText":"When Proficient Pyrodancer enters the battlefield, you may put an art sticker on a nonland permanent you own.\n{2}{R}: Another target creature with an art sticker on it gets +2/+0 and gains menace until end of turn.","originalType":"Creature — Human Performer","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"ee781801-d76d-5aad-a32c-30a4ec308e95"},{"name":"Rad Rascal","manaCost":"{3}{R}","cmc":4.0,"colors":["R"],"colorIdentity":["R"],"type":"Creature — Devil Employee","types":["Creature"],"subtypes":["Devil","Employee"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"When Rad Rascal enters the battlefield, open an Attraction. (Put the top card of your Attraction deck onto the battlefield.)","flavor":"\"Rent a scooter and be just like Devil K. Nevil! Just don't go faster than the speed limit. Or jump over anything. Or catch on fire. Or break every bone in your body multiple times. Other than that, just like him!\"","artist":"Dmitry Burmak","number":"121","power":"3","toughness":"3","layout":"normal","multiverseid":"580677","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580677&type=card","variations":["dda685a2-6459-54c5-86f8-8e6be29ea9b1"],"printings":["UNF"],"originalText":"When Rad Rascal enters the battlefield, open an Attraction. (Put the top card of your Attraction deck onto the battlefield.)","originalType":"Creature — Devil Employee","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"f19f246b-2c59-5504-b3ca-f1961b3ac89b"},{"name":"Rock Star","manaCost":"{4}{R}","cmc":5.0,"colors":["R"],"colorIdentity":["R"],"type":"Creature — Elemental Performer","types":["Creature"],"subtypes":["Elemental","Performer"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Reach\nWhen Rock Star enters the battlefield, you may discard a card. If you do, reveal the top five cards of your library. Ask a person outside the game to choose which of them is most like a rock band. Put that card into your hand and the rest on the bottom of your library in a random order.","flavor":"Born to, and of, rock.","artist":"Dave Allsop","number":"122","power":"4","toughness":"5","layout":"normal","variations":["fea77332-1f60-5679-8b33-caaf18668129"],"rulings":[{"date":"2022-10-07","text":"You can’t influence their decision. You must simply present the options, ask the question, and let them decide."},{"date":"2022-10-07","text":"The outside person’s pick is final. It’s a subjective call, and it doesn’t matter if they’re clearly wrong."}],"printings":["UNF"],"id":"1fa705f7-0cc2-5df2-b038-fa86f46a7770"},{"name":"Slight Malfunction","manaCost":"{1}{R}","cmc":2.0,"colors":["R"],"colorIdentity":["R"],"type":"Sorcery","types":["Sorcery"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Choose one —\n• Destroy target artifact.\n• Roll a six-sided die. When you do, Slight Malfunction deals 1 damage to each of up to X target creatures, where X is the result.","flavor":"\"Attention, valued patrons. The Tilt-o-Squirrel is now closed.\"\n—Astrotorium public address system","artist":"Greg Bobrowski","number":"123","layout":"normal","variations":["ae8d543f-8349-550c-a0b6-12aed87e5aed"],"rulings":[{"date":"2022-10-07","text":"If you choose the second mode, Slight Malfunction goes on the stack without any targets. As it resolves, you roll a six-sided die. This causes the reflexive triggered ability trigger. You choose the targets for that ability as it goes on the stack."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"c247681c-7cc1-51aa-a8e4-bdcc166b4a44"},{"name":"Ticking Mime Bomb","manaCost":"{3}{R}","cmc":4.0,"colors":["R"],"colorIdentity":["R"],"type":"Artifact Creature — Clown Robot Mime","types":["Artifact","Creature"],"subtypes":["Clown","Robot","Mime"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"When Ticking Mime Bomb enters the battlefield, without speaking or indicating any specific creature, pantomime to a person outside the game, then they choose a creature you don't control. Ticking Mime Bomb deals damage equal to twice the number of Robots you control to the chosen creature.","flavor":"Silent, but deadly.","artist":"Greg Bobrowski","number":"124","power":"2","toughness":"2","layout":"normal","variations":["e94cfea2-7e3f-5e6f-b425-ddb55ea6ab3a"],"rulings":[{"date":"2022-10-07","text":"To pantomime means to act out or express something in an exaggerated fashion without speaking. You’re trying to get the outside person to guess the creature based on your expressions and movements. You can’t just point to the creature you want them to pick."},{"date":"2022-10-07","text":"You aren’t allowed to speak while pantomiming, but you can explain to the outside person what’s going to happen before you begin as long as you don’t try to give them hints about which creature to pick."},{"date":"2022-10-07","text":"If the outside person chooses one of your creatures, consider briefly why you didn’t fully explain to the outside person what’s going to happen, and ask them to choose a creature you don’t control."},{"date":"2022-10-07","text":"Count the number of Robots you control as the ability resolves to determine how much damage to deal. If Ticking Mime Bomb is still under your control and still a Robot, it will count itself. Quietly."}],"printings":["UNF"],"id":"ec76f3dc-e73d-53b7-843d-8eeb8605b26c"},{"name":"Trigger Happy","manaCost":"{1}{R}","cmc":2.0,"colors":["R"],"colorIdentity":["R"],"type":"Instant","types":["Instant"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Choose a triggered ability of target permanent. It triggers. You control that ability.","flavor":"Whenever you copy a triggered ability, you may do a little dance.","artist":"Jamroz Gary","number":"125","layout":"normal","variations":["58bb8ea0-b322-53b7-bc3e-df379c7f3fa9"],"rulings":[{"date":"2022-10-07","text":"Triggered abilities are abilities that start with “When”, “Whenever”, or “At”, generally at the start of a paragraph on the permanent. You can’t choose reflexive or delayed triggered abilities; these are triggered abilities that occur in the middle of a paragraph, usually after some kind of action or choice."},{"date":"2022-10-07","text":"You can choose triggered abilities which are represented by keywords, such as exalted. Most of those keywords will have “When”, “Whenever”, or “At” in their reminder texts. The visit ability of an Attraction is a triggered ability, so you can choose it. However, the “Prize” section on an Attraction is not a triggered ability, so that can’t be chosen separately. Nevertheless, you’ll get the prize if you choose the visit ability on that Attraction and successfully claim the prize."},{"date":"2022-10-07","text":"If a triggered ability is triggered with this spell, you ignore its trigger event—typically all the text between “When”, “Whenever”, or “At” until the first comma—and only consider the remaining text in that ability. For example, Complains Clerk has “Whenever you roll a 1, create a 1/1 white Clown Robot artifactcreature token.” If you choose that ability, you ignore everything up to the first comma, ending up with “Create a 1/1 white Clown Robot artifact creature token.”"},{"date":"2022-10-07","text":"Some triggered abilities have an “intervening if” clause—that is, they are written in the form of “When/Whenever/At [trigger event], if [condition], [effect].” If you choose such an ability with Trigger Happy, you ignore the trigger event, and the ability will go on the stack even if the intervening if condition is not fulfilled, but the ability will still check the intervening if condition as the ability tries to resolve. If the condition is not fulfilled at that time, then the ability won’t resolve. For example, Tatyova, Steward of Tides has the ability “Whenever a land enters the battlefield under your control, if you control seven or more lands, [effect].” If you choose that ability, it will go on the stack regardless of how many lands you control. However, as the ability tries to resolve, if you don’t control seven or more lands, the ability fails to resolve and the effect doesn’t happen."},{"date":"2022-10-07","text":"Because you control the ability, you choose any targets it requires."},{"date":"2022-10-07","text":"You can use Trigger Happy to cause abilities to trigger at unusual times. Sometimes that will make sense and be great. Sometimes it won’t."},{"date":"2022-10-07","text":"The ability that triggered will think that it triggered at the normal time and for the normal reason. It may refer to attacking creatures you control, except it’s your opponent’s end step. It may be looking for a card in the graveyard after a dies trigger, but the creature is still sitting on the battlefield. It may be looking for the spell that caused it to trigger, but there was no spell. If the triggered ability can’t determine the information it needs, or if it can’t find the objects it expects to find in certain zones, those parts of the effect just do nothing."}],"printings":["UNF"],"id":"7dd133c6-9dfb-5676-8f75-dbe63cdea545"},{"name":"Vorthos, Steward of Myth","manaCost":"{1}{R}","cmc":2.0,"colors":["R"],"colorIdentity":["B","G","R","U","W"],"type":"Legendary Creature — Human Gamer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Gamer"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"As Vorthos, Steward of Myth enters the battlefield, choose a named Magic character.\nEach spell you cast with the chosen character in its name, flavor text, or art costs {W}{U}{B}{R}{G} less to cast. This effect reduces only the amount of colored mana you pay.","flavor":"\"Just wait, my Madara deck isn't all Emperor Bolas. There's an Umezawa subtheme!\"","artist":"Caroline Gariba","number":"126","power":"1","toughness":"3","layout":"normal","variations":["96aaebd2-451d-59c6-b4a0-334f89a511eb","d512fc07-9942-5b58-aa10-081421c95b37","d953c865-24db-5735-8552-95906bcf613a"],"rulings":[{"date":"2022-10-07","text":"You can choose any Magic character that has ever appeared in any official product or story, including characters that have appeared only in art. You can even choose characters who don’t have official names, as long as they’re clearly defined characters, like the Wanderer."},{"date":"2022-10-07","text":"Vorthos’s ability applies to any spell in which the chosen character’s name appears in any form, whether that’s possessive (e.g. Teferi and Teferi’s Protection), or a related word (e.g. Avacyn and Avacynian Priest), or a word that’s derived from their name (e.g. Niv-Mizzet and Izzet Charm)."},{"date":"2022-10-07","text":"If a character has gone by different names, you may count all versions of that character. For example, choosing Lim-Dûl will offer you a discount on (SPOILERS) The Raven Man. Choosing Urza will offer you a discount on (SPOILERS BUT VERY OLD ONES) Blind Seer."},{"date":"2022-10-07","text":"As with other acorn cards, Vorthos cares only about the actual printed card you’re casting to determine whether the chosen character appears. But would Vorthos want it any other way?"},{"date":"2022-10-07","text":"Vorthos’s ability cares whether the chosen character appears in the name, flavor text, or art of the card. It doesn’t care about rules text, watermark, set symbol, artist, and so on. No, choosing Maro as your character doesn’t let you get a discount on Look at Me, I’m the DCI."},{"date":"2022-10-07","text":"Unlike most abilities that reduce the costs of spells, Vorthos’s ability cannot be applied to generic mana costs. For example, a spell that costs {2}{B}{G} to cast would instead cost {2} to cast. One that costs {4}{U}{U} would instead cost {4}{U}."}],"printings":["UNF"],"id":"8070623c-6079-5985-a951-000c9a7cb241"},{"name":"Wee Champion","manaCost":"{R}","cmc":1.0,"colors":["R"],"colorIdentity":["R"],"type":"Creature — Minotaur Child Guest","types":["Creature"],"subtypes":["Minotaur","Child","Guest"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Whenever you place a sticker, Wee Champion gets +1/+1 until end of turn. If it's an art sticker, instead put a +1/+1 counter on Wee Champion.","flavor":"Nobody had ever won the bear, but then again, nobody had ever wanted it quite as much.","artist":"Raluca Marinescu","number":"127","power":"0","toughness":"1","layout":"normal","multiverseid":"580679","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580679&type=card","variations":["ac619c9d-1e15-54df-86ca-2717c247e949"],"printings":["UNF"],"originalText":"Whenever you place a sticker, Wee Champion gets +1/+1 until end of turn. If it's an art sticker, instead put a +1/+1 counter on Wee Champion.","originalType":"Creature — Minotaur Child Guest","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"174fef55-6406-52df-88e9-4ad48a90a563"},{"name":"Well Done","manaCost":"{2}{R}{R}","cmc":4.0,"colors":["R"],"colorIdentity":["R"],"type":"Sorcery","types":["Sorcery"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Well Done deals 5 damage to target creature. If that creature is rare or mythic rare, Well Done deals 3 damage to that creature's controller.","flavor":"\"What's the big deal? I've been on fire eighty-one times. Twice just while sleeping.\"\n—Devil K. Nevil, daredevil extraordinaire","artist":"Gaboleps","number":"128","layout":"normal","variations":["eff31d4e-2b5f-5ceb-85d0-726d84ba9e41"],"rulings":[{"date":"2022-10-07","text":"Rare cards have gold expansion symbols. Mythic rare cards have orange expansion symbols. Cards from before Exodus don’t have expansion symbols; their rarities can be found on their Gatherer entries."},{"date":"2022-10-07","text":"Many creatures have been printed at multiple rarities, but like all acorn cards, Well Done cares only about the rarity of the actual printed card it’s roasting."}],"printings":["UNF"],"id":"71cd8dc7-011a-5a99-96d8-6afa20498d9e"},{"name":"Alpha Guard","manaCost":"{1}{G}","cmc":2.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Elf Employee","types":["Creature"],"subtypes":["Elf","Employee"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"When Alpha Guard enters the battlefield, choose a letter.\n{T}: Untap another target permanent whose name starts with the chosen letter.","flavor":"\"Whimsy overflow in sector G! The gremlins are rampaging and the beebles are on fire!\"","artist":"Caroline Gariba","number":"129","power":"1","toughness":"2","layout":"normal","variations":["92c90bf4-b890-5610-83d4-976ae38df7f4"],"rulings":[{"date":"2022-10-07","text":"When determining what a name starts with, ignore all spaces and punctuation, including blank lines."},{"date":"2022-10-07","text":"Because Alpha Guard appears only in Un- games, you may run into situations where cards that would normally have the same name—for example, an English-language Forest and a German-language Forest—now have different names. In Un- games, the name printed on the card is that card’s name (unless modified by stickers or other effects). Thus, if you were to choose F for Alpha Guard, you would be able to untap a Forest, but you would not be able to untap a Wald, Forest’s German equivalent."}],"printings":["UNF"],"id":"501fdd3b-98c5-56bf-8ded-666a2928802c"},{"name":"Atomwheel Acrobats","manaCost":"{3}{G}","cmc":4.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Elf Performer","types":["Creature"],"subtypes":["Elf","Performer"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Whenever you roll a 1 or 2, put that many +1/+1 counters on Atomwheel Acrobats.\n{2}{G}: Roll a six-sided die.","flavor":"\"If the acrobatic show doesn't wow the audience, we have no one to blame but our elves.\"\n—Myra the Magnificent","artist":"Tomek Larek","number":"130","power":"3","toughness":"2","layout":"normal","multiverseid":"580680","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580680&type=card","variations":["ff0b6274-640e-5237-9230-7460b5109b01"],"rulings":[{"date":"2022-10-07","text":"The die roll caused by the activated ability has no inherent effect: you just roll a six-sided die, but any ability that triggers whenever you roll a die will trigger. Abilities that trigger whenever you roll a specific result, such as Atomwheel Acrobats’ first ability, may also trigger."}],"printings":["UNF"],"originalText":"Whenever you roll a 1 or 2, put that many +1/+1 counters on Atomwheel Acrobats.\n{2}{G}: Roll a six-sided die.","originalType":"Creature — Elf Performer","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"017c5c8d-7481-5819-8fbc-6b049008c448"},{"name":"Blorbian Buddy","manaCost":"{G}","cmc":1.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Alien Guest","types":["Creature"],"subtypes":["Alien","Guest"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Trample\n{G}, {T}: You get {TK} (a ticket counter).","flavor":"When Captain Nebula tragically destroyed the planet Blorb-12 in a parking accident, Myra compensated the survivors with lifetime passes.","artist":"Ernanda Souza","number":"131","power":"1","toughness":"1","layout":"normal","multiverseid":"580681","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580681&type=card","variations":["45c0128b-fa43-59f7-a2f7-4d30e8c90c64"],"rulings":[{"date":"2022-10-07","text":"The last ability gives you a ticket counter, but it doesn’t enable you to put a sticker on anything. That ticket can be spent if another effect later allows you to put a sticker on something."}],"printings":["UNF"],"originalText":"Trample\n{G}, {T}: You get {Ticket} (a ticket counter).","originalType":"Creature — Alien Guest","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"b6027e03-b09e-54be-a70d-6b9b9db21e08"},{"name":"Centaur of Attention","manaCost":"{3}{G}{G}","cmc":5.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Centaur Performer","types":["Creature"],"subtypes":["Centaur","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"When Centaur of Attention enters the battlefield, roll five six-sided dice and store those results on it.\nAt the beginning of combat on your turn, you may reroll any number of Centaur of Attention's stored results.\nCentaur of Attention gets +X/+X, where X is the greatest number of stored results on it of the same value.","artist":"Leonardo Santanna","number":"132","power":"3","toughness":"3","layout":"normal","multiverseid":"580682","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580682&type=card","variations":["8669679d-ccf3-5523-8b06-4971e610606f"],"rulings":[{"date":"2022-10-07","text":"To store a result means to note the result, ya see. You can do it by keeping a die with that result on Centaur of Attention, or just by writing down the result. To reroll a noted result, roll a die with the same number of sides and replace the noted result with the new result."},{"date":"2022-10-07","text":"To get the largest bonus from the last ability, you want all five dice to have the same result. It doesn’t matter what result that is. The value of X is the largest number of dice that match, not what number they’re showing. For example, if your five results are 1, 1, 3, 3, and 4, Centaur of Attention would get +2/+2."},{"date":"2022-10-07","text":"You may reroll any results stored on Centaur of Attention, even those you chose not to reroll on previous turns."},{"date":"2022-10-07","text":"If Centaur of Attention’s enters-the-battlefield ability is copied or triggers multiple times somehow, it’s possible to store more than five results on it. This is awesome. The last ability will consider all stored results and look for any that match each other."}],"printings":["UNF"],"originalText":"When Centaur of Attention enters the battlefield, roll five six-sided dice and store those results on it.\nAt the beginning of combat on your turn, you may reroll any number of Centaur of Attention's stored results.\nCentaur of Attention gets +X/+X, where X is the greatest number of stored results on it of the same value.","originalType":"Creature — Centaur Performer","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"8c869c02-eb1c-5af1-bfa2-74ca8066ead4"},{"name":"Chicken Troupe","manaCost":"{1}{G}","cmc":2.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Bird Performer","types":["Creature"],"subtypes":["Bird","Performer"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Ward {2} (Whenever this creature becomes the target of a spell or ability an opponent controls, counter it unless that player pays {2}.)\nWhen Chicken Troupe enters the battlefield, you get {TK}, then you may put a sticker on a nonland permanent you own.","flavor":"Why did the chicken cross the park? To get to the other ride.","artist":"Leonardo Santanna","number":"133","power":"2","toughness":"2","layout":"normal","multiverseid":"580683","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580683&type=card","variations":["ec11022d-09f2-5c4b-92e3-88f906575e17"],"printings":["UNF"],"originalText":"Ward {2} (Whenever this creature becomes the target of a spell or ability an opponent controls, counter it unless that player pays {2}.)\nWhen Chicken Troupe enters the battlefield, you get {Ticket}, then you may put a sticker on a nonland permanent you own.","originalType":"Creature — Bird Performer","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"1d29926e-d8a0-55d1-8628-96648271daeb"},{"name":"Clandestine Chameleon","manaCost":"{3}{G}","cmc":4.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Lizard Guest","types":["Creature"],"subtypes":["Lizard","Guest"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"When Clandestine Chameleon enters the battlefield, you get {TK}{TK}, then you may put a sticker on a nonland permanent you own.\nClandestine Chameleon has all abilities of ability stickers on other permanents you own and cards in your graveyard.","artist":"Dave Greco","number":"134","power":"4","toughness":"3","layout":"normal","multiverseid":"580684","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580684&type=card","variations":["20f9abd2-7732-589e-8b1f-5ec12c5d4f4f"],"rulings":[{"date":"2022-10-07","text":"Although Clandestine Chameleon has the abilities of ability stickers on other permanents you own and cards in your graveyard, it is not stickered unless there’s actually a sticker on it."},{"date":"2022-10-07","text":"As ability stickers are added to other permanents you own or cards in your graveyard, Clandestine Chameleon will gain the corresponding abilities. Similarly, Clandestine Chameleon will lose abilities as those stickers are removed or those permanents and/or cards go to zones other than the battlefield or graveyard."},{"date":"2022-10-07","text":"It doesn’t matter if the permanent or card with the ability sticker has lost the ability due to another effect. As long as it still has the sticker on it, Clandestine Chameleon will have the ability of that sticker anyway."}],"printings":["UNF"],"originalText":"When Clandestine Chameleon enters the battlefield, you get {Ticket}{Ticket}, then you may put a sticker on a nonland permanent you own.\nClandestine Chameleon has all abilities of ability stickers on other permanents you own and cards in your graveyard.","originalType":"Creature — Lizard Guest","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"e3b2d231-0f49-5353-8f40-85388e54ebbc"},{"name":"Coming Attraction","manaCost":"{2}{G}","cmc":3.0,"colors":["G"],"colorIdentity":["G"],"type":"Sorcery","types":["Sorcery"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Search your library for a basic land card, put it onto the battlefield tapped, then shuffle. Open an Attraction. (Put the top card of your Attraction deck onto the battlefield.)","flavor":"The Astrotorium adds new attractions almost as fast as Captain Nebula can crash them into asteroids.","artist":"Dmitry Burmak","number":"135","layout":"normal","multiverseid":"580685","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580685&type=card","variations":["5c64ecfa-ddd2-5cc2-9f47-a3569cef700b"],"printings":["UNF"],"originalText":"Search your library for a basic land card, put it onto the battlefield tapped, then shuffle. Open an Attraction. (Put the top card of your Attraction deck onto the battlefield.)","originalType":"Sorcery","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"1ae02284-ebbd-59e1-9d02-b82c967f3bc6"},{"name":"Done for the Day","manaCost":"{2}{G}","cmc":3.0,"colors":["G"],"colorIdentity":["G"],"type":"Enchantment","types":["Enchantment"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"At the beginning of your end step, if you control an Employee, a Performer, or a Robot, you may get {TK} or create a Treasure token. If you control all three, you may put a sticker on a nonland permanent you own.","flavor":"Punchy was programmed to do two things: punch tickets and love punching tickets.","artist":"Caroline Gariba","number":"136","layout":"normal","multiverseid":"580686","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580686&type=card","variations":["2fb85c08-6d25-5f80-9328-7503551bfaa8"],"rulings":[{"date":"2022-10-07","text":"Done for the Day’s ability will trigger only if you control at least one of the three as your end step begins. If you don’t, the ability won’t trigger at all. If you do, the ability will check again as it tries to resolve. If you control none of the three at that time, the ability won’t resolve and you’ll get nothing. If you still control at least one, you’ll get the ticket or the Treasure (if you want). Then if you control all three, you’ll also have the chance to place a sticker."}],"printings":["UNF"],"originalText":"At the beginning of your end step, if you control an Employee, a Performer, or a Robot, you may get {Ticket} or create a Treasure token. If you control all three, you may put a sticker on a nonland permanent you own.","originalType":"Enchantment","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"20e39b5e-4d46-5c45-8032-3b4f6edaa5ba"},{"name":"Embiggen","manaCost":"{G}","cmc":1.0,"colors":["G"],"colorIdentity":["G"],"type":"Instant","types":["Instant"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Until end of turn, target non-Brushwagg creature gets +1/+1 for each supertype, card type, and subtype it has.","flavor":"\"Flea circus? No, flee circus!\"","artist":"Tyler Walpole","number":"137","layout":"normal","multiverseid":"580687","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580687&type=card","variations":["affce140-4236-5d55-bc55-d7bb1a3fb52c"],"rulings":[{"date":"2022-10-07","text":"The bonus is calculated as Embiggen resolves. After that point, the bonus doesn’t change no matter what happens to the creature’s types."},{"date":"2022-10-07","text":"All subtypes count, including those that aren’t creature types. Good news for the Artifact Creature — Treasure Dogs out there."},{"date":"2022-10-07","text":"Token is not a type, supertype, or subtype, so it won’t ever count toward Embiggen’s effect."},{"date":"2022-10-07","text":"Brushwaggs know what they did."}],"printings":["UNF"],"originalText":"Until end of turn, target non-Brushwagg creature gets +1/+1 for each supertype, card type, and subtype it has.","originalType":"Instant","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"131d2bb8-f0fe-5d53-9927-28419f767ab6"},{"name":"Fight the _____ Fight","manaCost":"{1}{G}","cmc":2.0,"colors":["G"],"colorIdentity":["G"],"type":"Enchantment — Aura","types":["Enchantment"],"subtypes":["Aura"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Enchant creature you control\nWhen this Aura enters the battlefield, you may put a name sticker on it. When you do, enchanted creature fights up to one target creature you don't control.\nEnchanted creature gets +0/+2 for each name sticker on this Aura with eight or more letters.","artist":"Greg Staples","number":"138","layout":"normal","variations":["b51e4d00-6083-5ba0-8c3a-ab576085b162"],"rulings":[{"date":"2022-10-07","text":"If you choose not to put a name sticker on this Aura as its enters-the-battlefield ability resolves, the reflexive trigger that causes the fight won’t trigger. Putting a name sticker on this Aura after that point won’t cause it to trigger."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"fe7f1ac6-7ad2-50fe-ae82-02535983d2c6"},{"name":"Finishing Move","manaCost":"{2}{G}","cmc":3.0,"colors":["G"],"colorIdentity":["G"],"type":"Sorcery","types":["Sorcery"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"You get {TK}{TK}, then you may put a sticker on a nonland permanent you own. Target creature you control deals damage equal to its power to target creature you don't control.","flavor":"What the show lacks in historical accuracy, it makes up for in awesome submission holds.","artist":"Dmitry Burmak","number":"139","layout":"normal","multiverseid":"580689","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580689&type=card","variations":["fc8aead9-f101-51f4-bb79-a79567a82ec9"],"rulings":[{"date":"2022-10-07","text":"You must choose a creature you control and a creature you don’t control as targets to cast Finishing Move."},{"date":"2022-10-07","text":"The nonland permanent you put a sticker on, if any, isn’t a target of the spell and is chosen as the spell resolves. It can be the creature that’s about to deal damage, but it doesn’t have to be."}],"printings":["UNF"],"originalText":"You get {Ticket}{Ticket}, then you may put a sticker on a nonland permanent you own. Target creature you control deals damage equal to its power to target creature you don't control.","originalType":"Sorcery","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"c4451d8c-f954-5f2a-b6e3-0f684f991a49"},{"name":"Grabby Tabby","manaCost":"{3}{G}","cmc":4.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Cat Guest","types":["Creature"],"subtypes":["Cat","Guest"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Grabby Tabby has vigilance as long as you control a stickered permanent.","flavor":"The milk bottle toss is closed until the rules can be amended.","artist":"Filipe Pagliuso","number":"140","power":"4","toughness":"3","layout":"normal","multiverseid":"580690","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580690&type=card","variations":["3c3f4a9d-55d9-55e8-868c-8be520115bf0"],"rulings":[{"date":"2022-10-07","text":"The stickered permanent could be Grabby Tabby itself or another permanent you control."}],"printings":["UNF"],"originalText":"Grabby Tabby has vigilance as long as you control a stickered permanent.","originalType":"Creature — Cat Guest","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"36251069-e2e2-521d-b180-f2d45f842b0d"},{"name":"Hardy of Myra's Marvels","manaCost":"{2}{G}{G}","cmc":4.0,"colors":["G"],"colorIdentity":["G"],"type":"Legendary Creature — Elf Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Elf","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"As Hardy of Myra's Marvels enters the battlefield, choose a number.\nWhenever you cast a spell with the chosen number of lines of flavor text, put that many +1/+1 counters on target creature.\nPartner (You can have two commanders if both have partner.)","artist":"Gaboleps","number":"141","power":"4","toughness":"4","layout":"normal","variations":["03c64bd2-e1f9-5451-bc06-aee5f1db8612","c439ca4c-2be3-5874-a9df-442026c2692b","4f448fc0-e57d-5634-9b36-28b4040b9319"],"rulings":[{"date":"2022-10-07","text":"Even in an Un- game, you must choose 0 or a positive integer. This is a change from previous Un- rules."},{"date":"2022-10-07","text":"If you choose 0 and cast a spell with no flavor text, Hardy’s triggered ability will trigger and you’ll put zero +1/+1 counters on target creature. Congrats. You did it."}],"printings":["UNF"],"id":"ffc6c69e-cb16-5bda-b806-8399b5c19ffe"},{"name":"Icing Manipulator","manaCost":"{1}{G}","cmc":2.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Human Employee","types":["Creature"],"subtypes":["Human","Employee"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Each +1/+1 counter on a creature you control is also a Food token. (It's an artifact with \"{2}, {T}, Sacrifice this artifact: You gain 3 life.\")\n{3}{G}, {T}: Roll two six-sided dice. For each odd result, put a +1/+1 counter on a creature of your choice. Activate only as a sorcery.","flavor":"Her most popular flavors are vanilla, maple pecan crunch, and Glurgian galactopod.","artist":"Raluca Marinescu","number":"142","power":"1","toughness":"3","layout":"normal","variations":["59863087-7126-58c1-8588-38ad92782790"],"rulings":[{"date":"2022-10-07","text":"The +1/+1 counters that are also Food tokens are still +1/+1 counters. They should stay on whatever permanent they were on, even though they become permanents themselves. That acorn symbol at the bottom of the card isn’t messing around here."},{"date":"2022-10-07","text":"The +1/+1 counters/Food tokens are artifacts, so anything that counts artifacts will count them. They can be tapped, untapped, sacrificed, and so on. They can even attack and block if you find a way to make them creatures."},{"date":"2022-10-07","text":"+1/+1 counters aren’t “attached” to the creatures they’re on like an Aura or Equipment is, so a +1/+1 counter/Food token that becomes a creature stays on the creature its on. It still gives that creature a +1/+1bonus. It doesn’t give itself a +1/+1 bonus. Note that +1/+1 counters/Food tokens don’t have a mana cost, so their mana value is 0. Many ways of turning them into creatures will turn them into 0/0 creatures, so unless something else is raising their toughness, they’ll immediately spoil . . . er, die."},{"date":"2022-10-07","text":"The activated ability doesn’t target any creature. You choose which creatures get counters after you roll the dice. If you roll two odd numbers, you may put both +1/+1 counters on the same creature."}],"printings":["UNF"],"id":"8ae6c9ec-5e9f-5339-8728-dd3dec25af68"},{"name":"An Incident Has Occurred","manaCost":"{1}{G}","cmc":2.0,"colors":["G"],"colorIdentity":["G"],"type":"Sorcery","types":["Sorcery"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Choose one or both —\n• Destroy target creature with flying.\n• Destroy target Attraction. (It's put into its owner's junkyard.)\nYou may apologize. If you do, you gain 3 life.","flavor":"\"So sorry, but, per our waiver, we're not responsible for 'things happening.'\"","artist":"Greg Bobrowski","number":"143","layout":"normal","variations":["b3fc7a07-96ef-5f54-bd9f-6a0d1ba7d281"],"rulings":[{"date":"2022-10-07","text":"You may apologize no matter which modes you chose."},{"date":"2022-10-07","text":"Only you know what’s in your heart, but you need to at least sound sincere while apologizing."},{"date":"2022-10-07","text":"Your opponent doesn’t need to accept your apology. You gain 3 life either way."}],"printings":["UNF"],"id":"33a6fb25-6783-580f-a590-225e91d0bac0"},{"name":"Jermane, Pride of the Circus","manaCost":"{G}{G}","cmc":2.0,"colors":["G"],"colorIdentity":["G"],"type":"Legendary Creature — Cat Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Cat","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"{G}, {T}: Put two +1/+1 counters on target creature with four or more legs.\n{1}{G}{G}, {T}: Until end of turn, all creatures able to block target creature with four or more legs do so.","flavor":"\"Don't worry about me, folks! This beauty was well-fed by my predecessor.\"","artist":"Alexander Mokhov","number":"144","power":"2","toughness":"3","layout":"normal","variations":["f162de1d-b0e1-5368-bb67-6ada96f67c0f","7b398373-b253-50d0-8ddc-dfeb08b7acb4","7e36537b-9309-5666-b547-5027d657ed2e"],"rulings":[{"date":"2022-10-07","text":"Generally, you look at the art of a creature card to determine whether it has four legs or not."},{"date":"2022-10-07","text":"If the creature is known to have more than four legs—say, it’s a spider—but not all its legs are visible, it still has four or more legs. It’s a legal target for either activated ability."},{"date":"2022-10-07","text":"Creature type alone isn’t always enough to tell you whether a creature has four legs or not. For example, leonin have only two legs, while tigers have four legs, but both are Cats."},{"date":"2022-10-07","text":"If there are multiple creatures in the art, only compare the one that represents the actual creature on the card. For example, Tarmogoyf (MMA) has the tarmogoyf itself and an elk in the art, and you need only consider the tarmogoyf."},{"date":"2022-10-07","text":"If there are multiple creatures in the art that each match what the card is representing, then that creature has four or more legs as long as any one of the matching creatures in the art has four or more legs. For example, Llanowar Elves (M19) has three figures in its art, all of whom are Llanowar elves. However, none of those figures has four or more legs, so Llanowar Elves is not a valid target for Jermane’s abilities. If even one of the figures had four or more legs, then the creature would be a valid target."},{"date":"2022-10-07","text":"If a creature the defending player controls can’t block the creature targeted by the last ability for any reason (such as being tapped), then it doesn’t block that creature. If there’s a cost associated with having a creature block the attacking creature, the defending player isn’t forced to pay that cost, so it doesn’t have to block in that case either."}],"printings":["UNF"],"id":"4c8d5dc8-0638-5d1a-8534-fe51bbc0d750"},{"name":"Killer Cosplay","manaCost":"{G}","cmc":1.0,"colors":["G"],"colorIdentity":["G"],"type":"Artifact — Equipment","types":["Artifact"],"subtypes":["Equipment"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"Whenever Killer Cosplay becomes attached to a creature, choose a creature card name with an identical mana cost. That creature becomes a copy of the card with the chosen name until Killer Cosplay becomes unattached from it.\nEquip {3}","flavor":"\"Ach! Hans, run! Get the camera. He's adorable!\"\n—Steffi Bobsdotter, next words","artist":"Leonardo Santanna","number":"145","layout":"normal","variations":["d54994d1-dc7e-5438-87ff-55960da663a7"],"rulings":[{"date":"2022-10-07","text":"An identical mana cost includes color. For example, if Killer Cosplay becomes attached to a creature with mana cost {3}{G}{G}, you couldn’t name a creature card with mana cost {4}{G} or {3}{g/u}{g/u}."},{"date":"2022-10-07","text":"You can choose the name of any creature card that matches the condition. It does not have to be a legal card in the format you’re playing or a part of your Draft or Sealed pool."},{"date":"2022-10-07","text":"You can choose a creature card name you’ve already chosen. Not getting all the style points you could, but it’s allowed."},{"date":"2022-10-07","text":"In most cases, the equipped creature will gain all the usual copiable values of the creature card with the chosen name—that is, it will have its name, types, abilities, power, and toughness. However, if you can produce the actual card you’ve named, the equipped creature will also have that card’s art, watermarks, and flavor text."},{"date":"2022-10-07","text":"An Equipment can’t become attached to a creature if it’s already attached to it. That is, you can activate the equip ability targeting the creature Killer Cosplay’s already attached to, but that ability resolving won’t do anything. Killer Cosplay’s triggered ability won’t trigger."}],"printings":["UNF"],"id":"1679a94b-fae5-5d55-b95b-27381304ba0d"},{"name":"Lineprancers","manaCost":"{1}{G}","cmc":2.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Centaur Performer","types":["Creature"],"subtypes":["Centaur","Performer"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"When Lineprancers enters the battlefield, you get {TK}{TK}, then you may put a power and toughness sticker on a creature you own.\n{3}{G}: Target creature you don't control blocks target creature you control with a power and toughness sticker on it other than Lineprancers this turn if able.","flavor":"Can you do the can-can-can-can?","artist":"Ben Maier","number":"146","power":"2","toughness":"2","layout":"normal","multiverseid":"580691","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580691&type=card","variations":["e0368369-8879-538c-94b4-25829c0e3900"],"rulings":[{"date":"2022-10-07","text":"Activating the last ability doesn’t mean you have to attack with the target creature you control."},{"date":"2022-10-07","text":"If the creature you control does attack, and the creature you don’t control can’t block it for any reason (such as being tapped), then it doesn’t block. If there’s a cost associated with having it block the creature, its controller isn’t forced to pay that cost, so it doesn’t have to block in that case either. That creature is then free to block another creature or to not block at all."},{"date":"2022-10-07","text":"If a creature is required to block a creature with menace, another creature must also block that creature if able. If none can, the creature that’s required to block can block another creature or not block at all."},{"date":"2022-10-07","text":"Creatures other than the first target creature may also block the second target creature."},{"date":"2022-10-07","text":"Once the activated ability resolves, the blocking requirement is set, even if the second target creature loses its power and toughness sticker before blockers are declared."},{"date":"2022-10-07","text":"If either target of the activated ability is illegal as the ability tries to resolve, it will have no effect. If both targets become illegal, the ability won’t resolve at all."}],"printings":["UNF"],"originalText":"When Lineprancers enters the battlefield, you get {Ticket}{Ticket}, then you may put a power and toughness sticker on a creature you own.\n{3}{G}: Target creature you don't control blocks target creature you control with a power and toughness sticker on it other than Lineprancers this turn if able.","originalType":"Creature — Centaur Performer","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"6c625c6d-6a31-51db-8467-b3b80f01ee40"},{"name":"Mistakes Were Made","manaCost":"{1}{G}","cmc":2.0,"colors":["G"],"colorIdentity":["G"],"type":"Instant","types":["Instant"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Destroy target artifact or enchantment. Create a 1/1 green Squirrel creature token for each fire extinguisher you can see from your seat.","flavor":"In hindsight, Chandra's Incendiary Experience should never have been built next to Auntie Grub's House of Pitch.","artist":"Ralph Horsley","number":"147","layout":"normal","variations":["1b6791f0-850f-56f5-99d3-fc0b69ca4557"],"rulings":[{"date":"2022-10-07","text":"You must remain in your seat while looking around the room. No, you can’t pick up your seat and walk around to get more Squirrels."},{"date":"2022-10-07","text":"To count, it must be a real fire extinguisher, a portable device that discharges water, foam, gas, or other material to extinguish a fire. It can’t be, say, a glass of water."},{"date":"2022-10-07","text":"You can’t bring your own fire extinguishers. They must be natural to the room you’re in."}],"printings":["UNF"],"id":"457f2652-0563-58cc-9fd3-fcd857b5fbf1"},{"name":"_____-o-saurus","manaCost":"{4}{G}{G}","cmc":6.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Alien Dinosaur","types":["Creature"],"subtypes":["Alien","Dinosaur"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Trample\nWhen this creature enters the battlefield, you may put a name sticker on it. Put a +1/+1 counter on it for each unique vowel on that sticker. (The vowels are A, E, I, O, U, and Y.)","flavor":"\"Petting in the petting zoo is not advised.\"\n—Astrotorium waiver","artist":"Leonardo Santanna","number":"148","power":"3","toughness":"3","layout":"normal","variations":["b90e95e8-d202-54f4-8bf7-f4095b318efa"],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"5c13469e-09fc-5220-bbf4-c5e97969c5ab"},{"name":"Pair o' Dice Lost","manaCost":"{3}{G}{G}","cmc":5.0,"colors":["G"],"colorIdentity":["G"],"type":"Instant","types":["Instant"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Roll two six-sided dice. Return any number of cards with total mana value X or less from your graveyard to your hand, where X is the total of those results. Exile Pair o' Dice Lost.","flavor":"The Astrotorium is a zero-waste facility, meaning it deals with zero of its waste.","artist":"Bruce Brenneise","number":"149","layout":"normal","multiverseid":"580693","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580693&type=card","variations":["d82e916f-37f3-5e2f-96c4-d76cb652e564"],"rulings":[{"date":"2022-10-07","text":"Pair o’ Dice Lost doesn’t target any of the cards in the graveyard. You choose which cards you’re returning to your hand, if any, after rolling the dice."},{"date":"2022-10-07","text":"You can return any number of cards with mana value 0 (such as land cards) from your graveyard to your hand regardless of the results."},{"date":"2022-10-07","text":"If Pair o’ Dice Lost resolves, it will be exiled, even if you don’t return any cards to your hand."}],"printings":["UNF"],"originalText":"Roll two six-sided dice. Return any number of cards with total mana value X or less from your graveyard to your hand, where X is the total of those results. Exile Pair o' Dice Lost.","originalType":"Instant","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"909602a5-f336-5afe-a85d-a46b88698687"},{"name":"Petting Zookeeper","manaCost":"{2}{G}","cmc":3.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Elf Employee","types":["Creature"],"subtypes":["Elf","Employee"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Reach\nWhen Petting Zookeeper enters the battlefield, open an Attraction. (Put the top card of your Attraction deck onto the battlefield.)","flavor":"Calling it a \"petting zoo\" really saved on the cages.","artist":"Sebastian Giacobino","number":"150","power":"0","toughness":"4","layout":"normal","multiverseid":"580694","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580694&type=card","variations":["da2df91d-b4dd-5639-9342-166e4d960909"],"printings":["UNF"],"originalText":"Reach\nWhen Petting Zookeeper enters the battlefield, open an Attraction. (Put the top card of your Attraction deck onto the battlefield.)","originalType":"Creature — Elf Employee","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"c140c331-0cb7-5517-98ba-6ab71e367bd1"},{"name":"Pie-Eating Contest","manaCost":"{4}{G}","cmc":5.0,"colors":["G"],"colorIdentity":["G"],"type":"Sorcery","types":["Sorcery"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"As an additional cost to cast this spell, gobble X. (Each time you gobble, take a bite of food or sacrifice a Food token.)\nX target creatures you control each get +2/+2 and gain trample until end of turn.","flavor":"The pie was outstanding. The cobbler tasted like shoes.","artist":"Simon Dominic","number":"151","layout":"normal","variations":["467b9f20-aa7e-54ad-90ac-fd084257ec9b"],"rulings":[{"date":"2022-10-07","text":"You choose the value of X as you’re casting Pie-Eating Contest."},{"date":"2022-10-07","text":"All Food tokens are sacrificed at the same time. All bites of food are taken one at a time. (Can you even take two bites of food at the same time? Isn’t that just a larger bite?) You are allowed to swallow between bites. In fact, we encourage it!"},{"date":"2022-10-07","text":"Gum isn’t food. Trust us on this one."},{"date":"2022-10-07","text":"If you cast Pie-Eating Contest without paying its mana cost, you can still choose any value for X and choose targets accordingly because the X isn’t in the mana cost."}],"printings":["UNF"],"id":"c0acfd21-0ec0-51f0-8930-4165601a548d"},{"name":"Plot Armor","manaCost":"{2}{G}","cmc":3.0,"colors":["G"],"colorIdentity":["G"],"type":"Enchantment — Aura","types":["Enchantment"],"subtypes":["Aura"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Enchant creature\nEnchanted creature gets +2/+2 and can't be blocked except by creatures with flavor text.","flavor":"\"If you've got words, we're going to have words.\"","artist":"Gaboleps","number":"152","layout":"normal","variations":["e736f0f4-25a2-50bd-877e-4d8353791df7"],"rulings":[{"date":"2022-10-07","text":"Stickers can’t add flavor text, even if they include words. Maybe in the sequel 2Unfinity&Beyond."},{"date":"2022-10-07","text":"Stickers can’t remove flavor text, even if they are physically covering the flavor text."}],"printings":["UNF"],"id":"08aab601-961f-5ba3-a382-5eca12296cfb"},{"name":"Resolute Veggiesaur","manaCost":"{2}{G}","cmc":3.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Dinosaur Employee","types":["Creature"],"subtypes":["Dinosaur","Employee"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Trample\nWhenever you roll your third die each turn, put a +1/+1 counter on Resolute Veggiesaur.","flavor":"This dinosaur doesn't know what will kill him, but he's determined it won't be heart disease.","artist":"Leonardo Santanna","number":"153","power":"3","toughness":"3","layout":"normal","multiverseid":"580695","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580695&type=card","variations":["7fbe9beb-9857-5be1-a7b5-16b0ec50932f"],"rulings":[{"date":"2022-10-07","text":"If you roll multiple dice at the same time, and one of them is your third die roll that turn, Resolute Veggiesaur’s ability will trigger. It’s not necessary (or, in some cases, possible) to identify which roll was the third."},{"date":"2022-10-07","text":"Remember that if a die is rerolled, that counts only as a single roll. The original roll doesn’t count. Similarly, any die roll that’s ignored doesn’t count."}],"printings":["UNF"],"originalText":"Trample\nWhenever you roll your third die each turn, put a +1/+1 counter on Resolute Veggiesaur.","originalType":"Creature — Dinosaur Employee","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"e6b11987-382d-5984-9c1c-4d1d984eb777"},{"name":"Sole Performer","manaCost":"{2}{G}{G}","cmc":4.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Elf Performer","types":["Creature"],"subtypes":["Elf","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"{T}: Add {T}{T}. Activate only once each turn. (While activating an ability, use {T} rather than tapping the permanent to pay for {T}.)","flavor":"Elven tap is the official language of three very obnoxious planets.","artist":"Anna Christenson","number":"154","power":"2","toughness":"2","layout":"normal","variations":["d0fbb6f9-7a15-5825-9a73-45ab1bbca948"],"rulings":[{"date":"2022-10-07","text":"Sole Performer turns {T} into a resource you can add, much like mana. You spend {T} to pay for that symbol appearing in the costs of activated abilities. If you spend a {T} you have, you don’t have to tap the permanent that has the ability."},{"date":"2022-10-07","text":"For example, say you control Prize Wall, which has “{U}, {T}: You get {TK}.” You activate Sole Performer to get {T}{T}. You then activate Prize Wall, spending {U} and one of the {T}s you got from"}],"printings":["UNF"],"id":"fec1abfa-93ee-55cb-8483-0d5939876411"},{"name":"Spelling Bee","manaCost":"{2}{G}","cmc":3.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Alien Insect","types":["Creature"],"subtypes":["Alien","Insect"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"Flying, deathtouch\nWhenever Spelling Bee deals combat damage to a player, that player looks at the top card of your library and chooses a word on that card. You spell that word. If you spell it correctly, draw a card. Otherwise, scry 1.","flavor":"Just be thankful it wasn't grammar scorpions.","artist":"Caroline Gariba","number":"155","power":"1","toughness":"1","layout":"normal","variations":["f7f7f6e5-6533-5d18-a227-47d50010924a"],"rulings":[{"date":"2022-10-07","text":"The player looking at the top card of your library can choose any word from the card’s name, type line, or text box. Notably, they can’t choose a word that’s only in the artwork or artist credit. It doesn’t have to be a real word from a dictionary; Astroquarium is a perfectly cromulent word, for example."},{"date":"2022-10-07","text":"If you spell the word correctly, the card you draw will be the card that includes the word. If you don’t, the card you look at to scry 1 will be that card."},{"date":"2022-10-07","text":"If a redirection effect causes a Spelling Bee you control to deal combat damage to you, you’ll look at the top card of your own library and will choose a word to spell. No one else will be able to verify you did it correctly, but we’ll give you the benefit of the doubt."}],"printings":["UNF"],"id":"2ed1684d-9bcc-5974-90c1-4857f40e311f"},{"name":"Squirrel Squatters","manaCost":"{3}{G}{G}","cmc":5.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Squirrel","types":["Creature"],"subtypes":["Squirrel"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"When Squirrel Squatters enters the battlefield, open an Attraction. (Put the top card of your Attraction deck onto the battlefield.)\nWhenever Squirrel Squatters attacks, create a 1/1 green Squirrel creature token that's tapped and attacking for each Attraction you've visited this turn.","flavor":"Such plush accommodations.","artist":"Andrea Radeck","number":"156","power":"4","toughness":"4","layout":"normal","multiverseid":"580696","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580696&type=card","variations":["f13d6134-b435-57a7-8ea8-5f9b568fc8de"],"printings":["UNF"],"originalText":"When Squirrel Squatters enters the battlefield, open an Attraction. (Put the top card of your Attraction deck onto the battlefield.)\nWhenever Squirrel Squatters attacks, create a 1/1 green Squirrel creature token that's tapped and attacking for each Attraction you've visited this turn.","originalType":"Creature — Squirrel","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"0c5c324d-f5c9-553a-8710-e547af4b6f79"},{"name":"Stiltstrider","manaCost":"{3}{G}{G}","cmc":5.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Rhino Performer","types":["Creature"],"subtypes":["Rhino","Performer"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Reach\nWhen Stiltstrider enters the battlefield, you get {TK}{TK}, then you may put a sticker on a nonland permanent you own.","flavor":"Impossibly tall, improbably elegant.","artist":"Leonardo Santanna","number":"157","power":"5","toughness":"4","layout":"normal","multiverseid":"580697","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580697&type=card","variations":["1f5d759d-e562-5010-a0de-70a5dc71a8dc"],"printings":["UNF"],"originalText":"Reach\nWhen Stiltstrider enters the battlefield, you get {Ticket}{Ticket}, then you may put a sticker on a nonland permanent you own.","originalType":"Creature — Rhino Performer","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"d204880a-c468-5656-a808-4e71eaa4bb79"},{"name":"Tchotchke Elemental","manaCost":"{G}","cmc":1.0,"colors":["G"],"colorIdentity":["G"],"type":"Creature — Elemental","types":["Creature"],"subtypes":["Elemental"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"Whenever you create a token or put a counter or a sticker on another permanent, put a knickknack counter on Tchotchke Elemental. Use a unique item that completely fits on Tchotchke Elemental for each knickknack counter.\nTchotchke Elemental gets +1/+1 for each knickknack counter on it.","artist":"Sean Murray","number":"158","power":"1","toughness":"1","layout":"normal","variations":["d65d371b-76c6-5cf8-b093-dd902dff09c4"],"rulings":[{"date":"2022-10-07","text":"A “unique item” can be anything as long as it fits completely on the card and you don’t use the same thing twice. Two items are considered the same for this ability (which is to say, one of them is not unique) if they have the same or nearly the same shape, size, and colors. For example, a 2020 U.S. quarter is the same as a 2021 U.S. quarter, but it’s not the same as a Canadian quarter or a U.S. nickel. If all players can’t agree, you may ask an outside person for a final determination."},{"date":"2022-10-07","text":"The knickknack counters can touch each other."},{"date":"2022-10-07","text":"Each knickknack counter must be represented by a different object. You can’t use a die to represent multiples, for example. But you could use a six-sided die to represent one and a twenty-sided die to represent another."},{"date":"2022-10-07","text":"Other counters on Tchotchke Elemental can be represented normally."}],"printings":["UNF"],"id":"656d7f3f-3583-51ef-b8a3-043a676ec5f5"},{"name":"Tug of War","manaCost":"{4}{G}","cmc":5.0,"colors":["G"],"colorIdentity":["G"],"type":"Sorcery","types":["Sorcery"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"Players play a subgame starting at 5 life and with up to three permanent cards with different names from their main-game library on the battlefield. As the subgame ends, the winner chooses one of the cards they put onto the battlefield as the subgame began and puts it onto the battlefield rather than shuffling it into their library.","artist":"Gaboleps","number":"159","layout":"normal","variations":["e5830ea3-1013-59a8-a798-cf03d099a1d0"],"rulings":[{"date":"2022-10-07","text":"To play a subgame, all players start a new game using their libraries as their decks. Any supplementary decks a player has (for example, an Attraction deck) also get shuffled and brought into the subgame. No other cards, tokens, emblems, or anything else from the main game are included in the subgame unless otherwise specified here or in the effect that created that subgame."},{"date":"2022-10-07","text":"In a Constructed format, each player selects a new set of sticker sheets at the start of the subgame from among all sticker sheets they have (including the ones in the main game) the same way they do at the start of a normal game of Magic. This doesn’t impact the sticker sheets they are allowed to use in the main game."},{"date":"2022-10-07","text":"In a Limited format, each player selects three sticker sheets at the start of the subgame from among all sticker sheets they opened (including the ones in the main game) the same way they would at the start of a normal game of Magic. This doesn’t have any effect on which sticker sheets they are allowed to use in the main game."},{"date":"2022-10-07","text":"In a Commander game, if a commander is in the command zone, its owner puts it into the command zone of the subgame and removes all stickers from it. After the subgame, each player may put any commanders they own in the subgame into the command zone of the main game. If a commander was in the command zone of the subgame, it automatically moves to the command zone of the main game."},{"date":"2022-10-07","text":"As players are shuffling their main-game libraries to form their subgame libraries, they should set aside the cards they wish to have on the subgame battlefield as the subgame begins."},{"date":"2022-10-07","text":"If a player has fewer than seven cards in their main-game library, they’ll lose the subgame as it begins, regardless of how many mulligans that player takes."},{"date":"2022-10-07","text":"After subgame mulligans are complete, the starting player puts the cards they set aside onto the battlefield. Each other player in turn order does the same."},{"date":"2022-10-07","text":"If any abilities trigger during this process, they’ll be put on the stack the next time a player gets priority, usually during the subgame’s first upkeep."},{"date":"2022-10-07","text":"If the subgame is a draw, no player won the subgame, so nobody gets to put a permanent onto the battlefield in the main game."},{"date":"2022-10-07","text":"After the subgame ends, each player shuffles their cards from the subgame to re-form their main-game library (and Attraction deck, if applicable), and they return to the main game from the point they left off, with Tug of War finishing resolving and the winner of the subgame getting their reward. No counters, stickers, or other effects from the subgame move back into the main game."},{"date":"2022-10-07","text":"The card that the subgame winner puts onto the main-game battlefield doesn’t have to come from the subgame battlefield. It could have died, been shuffled into a library, or anything else during the subgame."}],"printings":["UNF"],"id":"c53df4b5-2efb-5d2c-9960-71cb696e419f"},{"name":"Vegetation Abomination","manaCost":"{2}{G}","cmc":3.0,"colors":["G"],"colorIdentity":["G"],"type":"Artifact Creature — Plant Mutant Food","types":["Artifact","Creature"],"subtypes":["Plant","Mutant","Food"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Deathtouch\n{T}, Sacrifice Vegetation Abomination: Roll a six-sided die. You gain life equal to the result.","flavor":"The animal and vegetable categories kind of merged over time.","artist":"Mike Burns","number":"160","power":"2","toughness":"2","layout":"normal","multiverseid":"580698","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580698&type=card","variations":["073edb94-4c9d-5c93-b4fd-9a66ce79dae9"],"printings":["UNF"],"originalText":"Deathtouch\n{T}, Sacrifice Vegetation Abomination: Roll a six-sided die. You gain life equal to the result.","originalType":"Artifact Creature — Plant Mutant Food","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"ed41c6a5-32c5-5aa8-80b6-de1d6fbbe895"},{"name":"Ambassador Blorpityblorpboop","manaCost":"{3}{G}{U}","cmc":5.0,"colors":["G","U"],"colorIdentity":["G","U"],"type":"Legendary Creature — Alien Advisor Guest","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Alien","Advisor","Guest"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"When Ambassador Blorpityblorpboop enters the battlefield, you get {TK}{TK}{TK}, then you may put a sticker on a nonland permanent you own.\nAt the beginning of each combat, you may have Ambassador Blorpityblorpboop's base power become equal to the total power of all stickers on permanents you control and its base toughness become equal to those stickers' total toughness.","artist":"Dave Greco","number":"161","power":"3","toughness":"3","layout":"normal","multiverseid":"580699","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580699&type=card","variations":["e24f64c4-24ab-52d2-b540-76b29c6d954a","ed86e8ba-35b6-5b66-beb1-58d0775301d7","fd898be6-92fb-5537-b36b-fc68de26959c"],"rulings":[{"date":"2022-10-07","text":"Ambassador Blorpityblorpboop has received a minor update to clarify its function. Specifically, its ability causes its base power to match the total power of stickers you control, and its base toughness to match the total toughness of stickers you control. The updated wording appears above."},{"date":"2022-10-07","text":"It doesn’t matter if the stickers are on creatures. Any power and toughness stickers on noncreature permanents you control will also count."},{"date":"2022-10-07","text":"Count only the powers and toughnesses of the stickers on permanents you control, not the actual powers and toughnesses of those permanents. For example, if a creature you control has a 4/4 sticker on it, but it also has three +1/+1 counters on it, it’s a 7/7 creature, but Ambassador Blorpityblorpboop’s base power and toughness would become 4/4."},{"date":"2022-10-07","text":"Ambassador Blorpityblorpboop counts all power and toughness stickers on all permanents you control, even if those power and toughness stickers don’t currently have any effect (possibly because you placed another power and toughness sticker on the same creature)."},{"date":"2022-10-07","text":"If Ambassador Blorpityblorpboop has a power and toughness sticker on it, that sticker is included when calculating for the last ability."},{"date":"2022-10-07","text":"Although Ambassador Blorpityblorpboop’s last ability considers the power and toughness stickers of permanents you control, the card itself is not considered to be stickered unless there’s actually a sticker on it."},{"date":"2022-10-07","text":"The base power and toughness change doesn’t end at end of turn; it lasts indefinitely, until Ambassador Blorpityblorpboop either leaves the battlefield or its base power and toughness changes again from another effect (for example, a power and toughness sticker being placed on it or its ability triggering again)."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"3b5709b6-f83e-5108-a32c-5fce6cbfe591"},{"name":"Angelic Harold","manaCost":"{1}{W}{U}","cmc":3.0,"colors":["U","W"],"colorIdentity":["U","W"],"type":"Legendary Creature — Angel Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Angel","Performer"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Flying\nWhen Angelic Harold enters the battlefield, you may put a name sticker on a nonland permanent you own.\nEach creature you control with three or more words in its name gets +1/+1.","flavor":"The voice of an angel. And the face of an angel. And the legs of... you get the idea.","artist":"Aaron J. Riley","number":"162","power":"2","toughness":"2","layout":"normal","variations":["dc4642b8-a8e8-58aa-9e98-fb5c8173d93a","17984c5d-bc4c-5a44-baed-bb6b0103d76d","5197f4de-fd5f-5686-bed4-d768512b4c93"],"rulings":[{"date":"2022-10-07","text":"A creature token that was created with two or more creature types will (usually) qualify for the bonus bestowed by Harold’s last ability because its name is those types plus the word “Token.” It doesn’t matter what you’re using to represent the token."}],"printings":["UNF"],"id":"94e50d17-6109-50b6-9db2-9904891dd6f1"},{"name":"\"Brims\" Barone, Midway Mobster","manaCost":"{3}{W}{B}","cmc":5.0,"colors":["B","W"],"colorIdentity":["B","W"],"type":"Legendary Creature — Human Rogue","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Rogue"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"When \"Brims\" Barone, Midway Mobster enters the battlefield, put a +1/+1 counter on each other creature you control that has a hat.\n\"Brims\" Barone, Midway Mobster has menace as long as you're wearing a hat.","flavor":"The capo of caps, the hitman of hats, the don of donning fashionable headwear.","artist":"Sebastian Giacobino","number":"163","power":"5","toughness":"4","layout":"normal","variations":["8466f5d3-b178-5ce7-98ec-4aad1ef1f689","a6321f1b-3988-58dd-b148-f02b05b4fc3a","f064ff0b-40b8-5680-b9c7-c5ee43398d59"],"rulings":[{"date":"2022-10-07","text":"Whether or not Brims has menace matters only as blockers are declared. After that point, a gust of wind removing your hat or blowing a new hat onto your head won’t change which blockers have already legally been declared."}],"printings":["UNF"],"id":"9551b2bb-e58f-5b0e-b052-63a64f4263aa"},{"name":"Captain Rex Nebula","manaCost":"{1}{R}{W}","cmc":3.0,"colors":["R","W"],"colorIdentity":["R","W"],"type":"Legendary Creature — Human Pilot Employee","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Pilot","Employee"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"At the beginning of combat on your turn, choose target nonland permanent you control. Until end of turn, it becomes a Vehicle artifact with base power and toughness each equal to its mana value, and it gains crew 2 and \"Crash Land — Whenever this Vehicle deals damage, roll a six-sided die. If the result is equal to this Vehicle's mana value, sacrifice this Vehicle, then it deals that much damage to any target.\"","artist":"Alexander Mokhov","number":"164","power":"2","toughness":"2","layout":"normal","multiverseid":"580700","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580700&type=card","variations":["71e8d356-a9ac-5dd3-8053-fb67dfb1c5a9","37f3af28-3c8a-5609-8f51-697ad401b9f4","267e0705-f5d9-5133-a25a-8c5eefe7f63b"],"rulings":[{"date":"2022-10-07","text":"Captain Rex Nebula has received an update to its wording to clarify that the abilities it grants to the target nonland permanent last until end of turn. In addition, the Crash Land ability now causes the Vehicle to be sacrificed before it deals damage. The updated text appears above."},{"date":"2022-10-07","text":"The target of Rex Nebula’s ability will become a Vehicle artifact until end of turn. It will lose all of its previous card types and subtypes, but it will keep any supertypes (such as legendary) it previously had. If the target of Rex Nebula’s ability is a creature, it will lose all creature types (such as Zombie) it had until end of turn, and becoming crewed will not cause it to regain those subtypes."},{"date":"2022-10-07","text":"The Vehicle will retain any abilities it previously had, as well as gaining crew 2 and the ability to crash into stuff."},{"date":"2022-10-07","text":"The Crash Land ability will trigger whenever the Vehicle deals any damage, not only combat damage."},{"date":"2022-10-07","text":"The Crash Land ability will trigger once for each instance of damage, no matter how many players or permanents the Vehicle deals damage to. For example, if the Vehicle is blocked by two creatures and it deals damage to each of them at the same time, the Crash Land ability will trigger only once."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"b524f7d4-6db3-5547-997d-1e3ac8bf413e"},{"name":"Claire D'Loon, Joy Sculptor","manaCost":"{W}{U}","cmc":2.0,"colors":["U","W"],"colorIdentity":["U","W"],"type":"Legendary Creature — Human Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"When Claire D'Loon, Joy Sculptor enters the battlefield, for the rest of the game, tokens you own become cards that are still tokens. (They continue to exist after they leave the battlefield.)\n{1}{W}{U}, {T}: You may put a token from your graveyard or hand onto the battlefield.","flavor":"She'll sculpt goblins, saprolings, Marit Lage . . . though that one takes a *lot* of balloons.","artist":"Igor Grechanyi","number":"165","power":"2","toughness":"3","layout":"normal","variations":["3daaaf34-a86c-515f-a987-f58f23e26c3c","8871f80f-547b-50fc-873b-da676b39c38f","62ce5141-7f33-558f-9b29-a8b2ebf40cb7"],"rulings":[{"date":"2022-10-07","text":"After Claire D’Loon’s enters-the-battlefield ability resolves, any token you own that leaves the battlefield will remain in existence in whatever zone it goes to. This means you must continue to represent that token with a physical object wherever it is. This applies to all tokens on the battlefield when the ability resolved, as well as all tokens you create for the rest of the game."},{"date":"2022-10-07","text":"Thanks to Claire, tokens can end up in your hand. Thanks, Claire. Most tokens don’t have a mana cost (though see below), so a token that ends up in your hand can’t be cast unless you find a way to cast it without paying its mana cost."},{"date":"2022-10-07","text":"A token that’s created as a copy of another object will remain a copy of that object after it leaves the battlefield. Assuming it copied something with a mana cost, the token will still have that mana cost, so it can be cast as normal from wherever it is if you have permission to do so. Note that this is different than a token that becomes a copy of another object and then leaves the battlefield. In that case, the copy effect wears off as the token leaves the battlefield."},{"date":"2022-10-07","text":"If a token under Claire’s influence ends up in your hand or library, the token needs to be indistinguishable from the other cards in that zone. If you’re using printed tokens, great! Make sure you’re matching the sleeves of the other cards in that zone, if any. If the token is represented by another object, such as a body part, a phone, a cat, some food, or a toy, use a Magic card (preferably a token) as a stand-in."}],"printings":["UNF"],"id":"14e2b540-0a24-509f-8abc-8d3468de5920"},{"name":"Comet, Stellar Pup","manaCost":"{2}{R}{W}","cmc":4.0,"colors":["R","W"],"colorIdentity":["R","W"],"type":"Legendary Planeswalker — Comet","supertypes":["Legendary"],"types":["Planeswalker"],"subtypes":["Comet"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"[0]: Roll a six-sided die.\n1 or 2 — [+2], then create two 1/1 green Squirrel creature tokens. They gain haste until end of turn.\n3 — [−1], then return a card with mana value 2 or less from your graveyard to your hand.\n4 or 5 — Comet, Stellar Pup deals damage equal to the number of loyalty counters on him to a creature or player, then [−2].\n6 — [+1], and you may activate Comet, Stellar Pup's loyalty ability two more times this turn.","artist":"Jeff Miracola","number":"166","layout":"normal","multiverseid":"580701","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580701&type=card","loyalty":"5","variations":["157260cb-ba4d-5c5f-940a-7c495e4ec834","866a6a1c-dd1f-5c75-99bd-c66ce302a8de","8721bab6-6dab-5d37-a6aa-4fdcfc642f62"],"rulings":[{"date":"2022-10-07","text":"Each + loyalty symbol in Comet’s abilities means to put the indicated number of loyalty counters on him. Each – loyalty symbol in Comet’s abilities means to remove the indicated number of loyalty counters from him. The only difference is Comet uses these symbols in the effects of his abilities rather than the costs. Good boy, Comet."},{"date":"2022-10-07","text":"None of Comet’s abilities require a target. All choices for cards, creatures, or players are made as the abilities resolve."},{"date":"2022-10-07","text":"If you roll a 3 but there aren’t any cards with mana value 2 or less in your graveyard, you’ll just remove one loyalty counter from Comet. Sorry, boy."},{"date":"2022-10-07","text":"If you roll a 4 or 5 while Comet has one loyalty counter on him, Comet will deal 1 damage to a creature or player and then that loyalty counter will be removed. Comet will then go live on a farm, where he’ll be very happy but will miss you terribly."},{"date":"2022-10-07","text":"In some unusual cases, Comet may gain loyalty abilities other than the one he normally has. In those cases, the effect of rolling a 6 applies only to his normal ability."}],"printings":["UNF"],"originalText":"0: Roll a six-sided die.\n1 or 2 — +2, then create two 1/1 green Squirrel creature tokens. They gain haste until end of turn.\n3 — −1, then return a card with mana value 2 or less from your graveyard to your hand.\n4 or 5 — Comet, Stellar Pup deals damage equal to the number of loyalty counters on him to a creature or player, then −2.\n6 — +1, and you may activate Comet, Stellar Pup's loyalty ability two more times this turn.","originalType":"Legendary Planeswalker — Comet","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Banned"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"61ec1a4c-6b0f-51fc-b01d-557eac0d69b4"},{"name":"Dee Kay, Finder of the Lost","manaCost":"{1}{U}{B}","cmc":3.0,"colors":["B","U"],"colorIdentity":["B","U"],"type":"Legendary Creature — Zombie Employee","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Zombie","Employee"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"When Dee Kay, Finder of the Lost enters the battlefield, open an Attraction.\nWhenever you roll a 2, each opponent loses 1 life and you gain 1 life.\nWhenever you roll a 4, you may tap or untap target artifact or creature.\nWhenever you roll a 6, return target creature card from your graveyard to your hand.","artist":"Vladimir Krisetskiy","number":"167","power":"1","toughness":"4","layout":"normal","multiverseid":"580702","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580702&type=card","variations":["4037d420-5653-523f-a6fb-94cb188cac02","1429a0bf-8f48-5c98-a434-2ee76868a7cc","6277d1f3-b8ea-57d7-9e0f-64cc1b36f57a"],"rulings":[{"date":"2022-10-07","text":"It doesn’t matter why you rolled a die or how many sides that die has: if you roll a 2, a 4, or a 6, the corresponding ability will trigger."},{"date":"2022-10-07","text":"If you roll more than one die at a time, Dee Kay’s abilities will trigger for each corresponding result. For example, if I roll 2, 2, and 4 on three six-sided dice, her second ability will trigger twice and her third ability will trigger once."},{"date":"2022-10-07","text":"If you roll a 2, a 4, or a 6 while rolling to visit your attractions, and one or more visit abilities also trigger from that roll, you choose the order in which those abilities and Dee Kay’s ability go on the stack. You can have Dee Kay’s ability resolve before those visit abilities, after them, or in between any of them."},{"date":"2022-10-07","text":"If the spell or ability that caused you to roll a die includes any effects due to the result, resolve those effects before putting Dee Kay’s triggered abilities on the stack."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"89dade5c-73c7-57ef-a54a-e9b027674256"},{"name":"Grand Marshal Macie","manaCost":"{1}{W}{B}","cmc":3.0,"colors":["B","W"],"colorIdentity":["B","W"],"type":"Legendary Creature — Human Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Performer"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"You may choose not to untap Grand Marshal Macie during your untap step. If you do, put a pause counter on it, then you lose 1 life for each pause counter on it.\nWhenever Macie becomes untapped, remove all pause counters from it.\n{2}, {T}: Choose an \"until end of turn\" or \"this turn\" effect. As long as Macie remains tapped, that effect doesn't end.","artist":"Marco Bucci","number":"168","power":"2","toughness":"2","layout":"normal","variations":["5a7329b2-2c3c-5d4b-a952-2e4a4971cf2a","e115851a-0a98-52bc-86c4-d25859ec5121","ed8b5a6e-9908-5b9a-93a6-6b479be79804"],"rulings":[{"date":"2022-10-07","text":"The chosen effect can be from any source, including one controlled by an opponent."},{"date":"2022-10-07","text":"You may choose to untap Macie during your untap step. If you do, the chosen effect will immediately end if its scheduled duration has already elapsed. This also happens if Macie becomes untapped some other way at some other time or if Macie leaves the battlefield."},{"date":"2022-10-07","text":"If Macie becomes untapped or leaves the battlefield and the chosen effect’s scheduled duration hasn’t already elapsed, the effect will continue until that time. You can use Macie’s last ability again to make sure it doesn’t end during the cleanup step."},{"date":"2022-10-07","text":"If Macie becomes untapped before her last ability resolves, you won’t choose any effect to not end."},{"date":"2022-10-07","text":"Removing pause counters from Macie won’t cause her to untap and won’t cause the chosen effect to end."}],"printings":["UNF"],"id":"ed04d25b-43be-512d-920b-b807adba68fc"},{"name":"It Came from Planet Glurg","manaCost":"{X}{X}{G}{U}","cmc":2.0,"colors":["G","U"],"colorIdentity":["G","U"],"type":"Legendary Creature — Alien Ooze","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Alien","Ooze"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"You may have It Came from Planet Glurg enter the battlefield as a copy of X different creatures on the battlefield. (It has their total power, total toughness, combined mana costs, all text boxes, names, art, and so on.)","flavor":"A sludge with a grudge.","artist":"Marco Bucci","number":"169","power":"0","toughness":"0","layout":"normal","variations":["e3245608-7f9f-5912-a0ab-dfb7af759206","e0049a60-f8a1-5c4a-b869-12c58702953b","3d7c32fe-3c8f-5bbc-856c-25a8d3ce9af4"],"rulings":[{"date":"2022-10-07","text":"It Came from Planet Glurg copies exactly what was printed on the original creatures and nothing more (unless any of those creatures are copying something else or is a token; see below). It doesn't copy whether that creature is tapped or untapped, whether it has any counters or stickers on it, and Auras or Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, and so on."},{"date":"2022-10-07","text":"If an effect needs information about the creature's name, it looks at all its names to determine that information. For example, if It Came from Planet Glurg becomes a copy of both Blorbian Buddy and Rat in the Hat, it has six words in its name. The first letters of its name are B and R. A creature with alpha strike whose name came before Rat in the Hat alphabetically would have first strike while in combat with it."}],"printings":["UNF"],"id":"88689b73-0063-541a-8ef9-f18662796523"},{"name":"Lila, Hospitality Hostess","manaCost":"{2}{G}{W}","cmc":4.0,"colors":["G","W"],"colorIdentity":["G","W"],"type":"Legendary Creature — Elf Employee","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Elf","Employee"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"You may look at the top card of your library any time.\nYou may cast common spells from the top of your library.\nGuests you control get +1/+1.","flavor":"As far as Lila was concerned, all courtesy should be common.","artist":"Yangtian Li","number":"170","power":"3","toughness":"3","layout":"normal","variations":["539c7e15-0af6-5028-b96d-828487eeffb1","47caf335-9de6-5e03-ba13-5e79b9685ffb","71a199b1-adf7-5955-8ea8-d225c4463fc5"],"rulings":[{"date":"2022-10-07","text":"Lila’s middle ability doesn’t change when you may cast those spells. You still pay all costs for those spells as well."},{"date":"2022-10-07","text":"Common cards have black expansion symbols. Cards from before Exodus™ don’t have expansion symbols; their rarities can be found on their Gatherer entries. (Cards with the land rarity, including basic lands, also have black expansion symbols, but Lila doesn’t let you play lands, so this hardly seems worth mentioning. Oh, sorry.)"}],"printings":["UNF"],"id":"a043db54-4f32-5bfe-bfbd-8698d24c4ccd"},{"name":"Magar of the Magic Strings","manaCost":"{1}{B}{R}","cmc":3.0,"colors":["B","R"],"colorIdentity":["B","R"],"type":"Legendary Creature — Minotaur Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Minotaur","Performer"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"{1}{B}{R}: Note the name of target instant or sorcery card in your graveyard and put it onto the battlefield face down. It's a 3/3 creature with \"Whenever this creature deals combat damage to a player, you may create a copy of the card with the noted name. You may cast the copy without paying its mana cost\" and \"If this creature would leave the battlefield, exile it instead of putting it anywhere else.\"","artist":"Tomek Larek","number":"171","power":"3","toughness":"3","layout":"normal","multiverseid":"580703","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580703&type=card","variations":["074edce7-8033-5c25-b4cb-774a3492721a","8fc1e197-2527-5579-8bb3-fd73ad6ee5db","6a07f6f5-972c-5b02-8129-267cf3345db3"],"rulings":[{"date":"2022-10-07","text":"The face-down creature has no characteristics other than the ones given to it by Magar’s ability. It has no name, no mana cost, no creature types, and no abilities other than the two Magar gives it. The creature is colorless and has a mana value of 0."},{"date":"2022-10-07","text":"You may look at face-down permanents you control at any time."},{"date":"2022-10-07","text":"If a face-down permanent you control leaves the battlefield, or if the game ends or you leave the game while you control it, you must reveal it to all players (even though in this case, everyone saw it before it entered)."},{"date":"2022-10-07","text":"If a creature enters the battlefield as a copy of a face-down creature (or if a token is created that’s a copy of one), that copy has the same characteristics as the face-down creature (in this case, it’s a 3/3 creature with the two abilities and no other characteristics), even though the copy is face up. Importantly, the noted name is not part of the face-down creature’s copiable values, so copies of the face-down creature won’t know the noted name. If one deals combat damage to a player, its controller won’t create a copy of any card."},{"date":"2022-10-07","text":"You must ensure that your face-down spells and permanents can easily be differentiated from each other. You’re not allowed to mix up the cards that represent them on the battlefield to confuse other players. The order they entered the battlefield should remain clear. Common methods for indicating this include using markers or dice, or simply placing them in order on the battlefield. You must also track how each became face down (Magar’s ability, cast face down using the morph ability, and so on)."},{"date":"2022-10-07","text":"There are no cards in this set that would turn a face-down instant or sorcery card on the battlefield face up, but some older cards can try to do this. If something tries to turn a face-down instant or sorcery card on the battlefield face up, reveal that card to show all players it’s an instant or sorcery card. The permanent remains on the battlefield face down. Abilities that trigger when a permanent turns face up won’t trigger, because even though you revealed the card, it never turned face up."},{"date":"2022-10-07","text":"If an effect tries to “blink” a face-down instant or sorcery card—that is, exile it and then return it to the battlefield—the card is exiled and remains in exile."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"8e9241da-e406-569c-9244-bc2554b8eb82"},{"name":"Meet and Greet \"Sisay\"","manaCost":"{R}{G}","cmc":2.0,"colors":["G","R"],"colorIdentity":["G","R"],"type":"Legendary Creature — Elf Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Elf","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"Whenever you cast a spell, choose one —\n• Flavor — Meet and Greet \"Sisay\" gets +1/+1 until end of turn for each line of flavor text that spell has.\n• History — Create a Treasure token if that spell doesn't share an expansion symbol with a permanent you control or a card in your graveyard.","artist":"Setor Fiadzigbey","number":"172","power":"1","toughness":"1","layout":"normal","variations":["7edd2b9e-9a8b-552f-b7bf-415469878166","6121f9c0-a100-5814-bd96-8d68c84a6a70","d0815555-07a2-511f-9349-5dae327a51de"],"rulings":[{"date":"2022-10-07","text":"Expansion symbols of different rarities (colors) are considered the same symbol. Essentially, the spell must be from a different expansion than every permanent you control and card in your graveyard to get the Treasure token."}],"printings":["UNF"],"id":"bc04dea7-8cd0-53d5-ab2e-cfb577d00ffe"},{"name":"Monoxa, Midway Manager","manaCost":"{2}{B}{R}","cmc":4.0,"colors":["B","R"],"colorIdentity":["B","R"],"type":"Legendary Creature — Vampire Employee","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Vampire","Employee"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Whenever you roll a 3 or higher, Monoxa, Midway Manager gains first strike until end of turn. If the roll was 4 or higher, it gains menace until end of turn. If the roll was 5 or higher, it gains lifelink until end of turn.\n{6}: Roll a six-sided die.","flavor":"\"Can we get this ghost 11% spookier?\"","artist":"Igor Grechanyi","number":"173","power":"3","toughness":"3","layout":"normal","multiverseid":"580704","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580704&type=card","variations":["1fb81dd4-14b2-5616-82fa-59e7fb14cc77","a6744f05-1770-57a5-ac5f-014230d4f866","f44e7474-d776-5c6b-bcda-4f8e4f889bbb"],"rulings":[{"date":"2022-10-07","text":"The die roll caused by the activated ability has no inherent effect: you just roll a six-sided die, but any ability that triggers whenever you roll a die will trigger. Abilities that trigger whenever you roll a specific result, such as Monoxa’s first ability, may also trigger."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"35c8df48-7d48-5d77-8f59-ebcfb92aa9b1"},{"name":"The Most Dangerous Gamer","manaCost":"{2}{B}{G}","cmc":4.0,"colors":["B","G"],"colorIdentity":["B","G"],"type":"Legendary Creature — Human Gamer Guest","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Gamer","Guest"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"Deathtouch\nWhenever The Most Dangerous Gamer enters the battlefield or attacks, open an Attraction.\nWhenever you open an Attraction, put a +1/+1 counter on The Most Dangerous Gamer.\nWhenever you claim the prize of an Attraction, destroy target permanent.","artist":"Aaron J. Riley","number":"174","power":"2","toughness":"2","layout":"normal","multiverseid":"580705","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580705&type=card","variations":["1c06c501-6c2d-5f07-bfba-5b8db5620111","f4f99e08-9069-5786-9a4b-fab50fa0e3a0","3c686e35-bb9e-5bc8-80aa-a812fd911f6f"],"rulings":[{"date":"2022-10-07","text":"Only certain Attractions allow you to claim a prize. These will have the text “Prize —” on them."},{"date":"2022-10-07","text":"Though this card is eternal, there is currently only one eternal Attraction which allows you to claim the prize: Pick-a-Beeble. If you want to take advantage of the last ability, it’s best if you’re playing an Un- game, unless you want an appropriate level of challenge for someone calling themselves The Most Dangerous Gamer."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"83501f61-e0e6-5c6c-a0ce-8332dbb2810a"},{"name":"Myra the Magnificent","manaCost":"{2}{U}{R}","cmc":4.0,"colors":["R","U"],"colorIdentity":["R","U"],"type":"Legendary Creature — Human Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Performer"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"Whenever you cast an instant or sorcery spell from your hand, open an Attraction.\n{X}, {T}: Exile target instant or sorcery card with mana value X from your graveyard and choose an Attraction you control that doesn't have a midway counter on it. Put a midway counter on it. Whenever you visit that attraction, copy the exiled card. You may cast the copy without paying its mana cost.","artist":"Eric Wilkerson","number":"175","power":"2","toughness":"4","layout":"normal","multiverseid":"580706","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580706&type=card","variations":["50bb65d4-f9f8-545d-a9f6-e0d6742ac709","6d68a633-e7bf-5bd6-925a-75cd68f8667d","a4806bed-7118-548f-9939-a24474295710"],"rulings":[{"date":"2022-10-07","text":"Myra’s activated ability targets only the instant or sorcery card in your graveyard. It doesn’t target the Attraction. You choose the Attraction as the ability is resolving."},{"date":"2022-10-07","text":"Myra’s activated ability creates a delayed triggered ability that will trigger whenever you visit the chosen Attraction. This ability will continue to trigger as long as the Attraction is on the battlefield and the exiled card remains exiled, even if Myra leaves the battlefield, loses her abilities, or changes controllers. It will also continue to trigger if the Attraction somehow loses the midway counter."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"3fbe2dee-27dd-5c53-8ec9-8903da5d9fe2"},{"name":"Pietra, Crafter of Clowns","manaCost":"{1}{R}{W}","cmc":3.0,"colors":["R","W"],"colorIdentity":["R","W"],"type":"Legendary Creature — Human Clown Artificer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Clown","Artificer"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Haste\nRobots you control get +1/+1.\n{R}{W}, {T}, Tell a joke you haven't told this game to someone outside the game: Create a 1/1 white Clown Robot artifact creature token. If that person laughed, the token gains haste until end of turn.","artist":"Armand Baltazar","number":"176","power":"3","toughness":"2","layout":"normal","variations":["977c0613-340b-5e96-ad96-d73d5a10c36c","e819aa75-7344-5683-a920-8ec5d2eafbbf","8e11627c-1803-533a-8ef5-4c41f1787790"],"rulings":[{"date":"2022-10-07","text":"Robot is a creature type. There may be creatures that appear to be robotic in nature that don’t have the Robot creature type. They won’t get +1/+1 from Pietra’s second ability. That ability affects all Robots you control, not only the tokens created by the last ability."},{"date":"2022-10-07","text":"Each joke you tell should be appropriate for the audience, keeping in mind that not everyone in attendance may be aware of your personal comedic stylings."},{"date":"2022-10-07","text":"While you must use a new joke each time you activate Pietra’s ability, you may choose the same person as the audience, especially if they think you’re funny."},{"date":"2022-10-07","text":"You may read the joke from an outside source if you need to."},{"date":"2022-10-07","text":"Each Pietra you control knows what jokes you’ve told that game, even if that Pietra wasn’t under your control when you told that joke."},{"date":"2022-10-07","text":"Pietra keeps a list of jokes for every player. If another player gains control of Pietra, they can tell a joke you’ve already told, as long as they haven’t told that joke yet."},{"date":"2022-10-07","text":"Even the mildest laugh counts. A giggle, a guffaw, a chortle . . . they all give the Clown Robot haste."},{"date":"2022-10-07","text":"You may find yourself drawing quite the crowd as your joke-telling skills become legend. Make sure you identify one specific person outside the game before your joke. Only their laughter (or lack thereof) matters, even if others are rolling on the proverbial or literal floor."}],"printings":["UNF"],"id":"59a3f406-c3f3-5000-8865-265dc583a922"},{"name":"Roxi, Publicist to the Stars","manaCost":"{2}{U}{R}","cmc":4.0,"colors":["R","U"],"colorIdentity":["R","U"],"type":"Legendary Creature — Human Employee","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Employee"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Flying\nRoxi, Publicist to the Stars's power is equal to the number of permanents you control with an art sticker plus the number of cards in your graveyard with an art sticker.\nWhen Roxi enters the battlefield, distribute up to two art stickers among one or two nonland permanents you own.","artist":"Dmitry Burmak","number":"177","power":"*","toughness":"4","layout":"normal","multiverseid":"580707","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580707&type=card","variations":["19666dfe-03fd-5438-b623-2ca1a41d0bac","972377f6-7647-5d50-b9a9-4984dfd71055","71c436b3-8f11-50eb-9acb-1ffaa869e165"],"rulings":[{"date":"2022-10-07","text":"The ability that defines Roxi’s power functions in all zones, not just the battlefield. If Roxi is on the battlefield or in your graveyard and it has an art sticker, it counts toward the total."},{"date":"2022-10-07","text":"Roxi’s enters-the-battlefield ability allows you to put two art stickers on a single permanent you own or one art sticker on each of two permanents you own."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"bcbbd0c1-dc44-520c-a977-51e40319a577"},{"name":"Space Beleren","manaCost":"{2}{W}{U}","cmc":4.0,"colors":["U","W"],"colorIdentity":["U","W"],"type":"Legendary Planeswalker — Jace","supertypes":["Legendary"],"types":["Planeswalker"],"subtypes":["Jace"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"Space sculptor (Space Beleren divides the battlefield into alpha, beta, and gamma sectors. If a creature isn't assigned to a sector, its controller assigns it to one. Opponents assign first.)\n[+1]: Creatures in each sector can be blocked this turn only by creatures in the same sector.\n[−1]: Put a +1/+1 counter on each creature in the sector of your choice.\n[−5]: Destroy all creatures in the sector of your choice.","artist":"Tyler Jacobson","number":"178","layout":"normal","multiverseid":"580708","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580708&type=card","loyalty":"3","variations":["e652bab7-775e-5ec0-9707-2641e9d4217d","533e84f0-05f5-50c9-856d-f9db6dfd787c","c44d9054-ebce-5661-8fbb-372ff5965315"],"rulings":[{"date":"2022-10-07","text":"Any time Space Beleren is on the battlefield, the battlefield is divided into three sectors: alpha, beta, and gamma. All creatures will be assigned to one of the three sectors."},{"date":"2022-10-07","text":"The sectors are essentially designations that change how Space Beleren’s other abilities will affect creatures on the battlefield. The sectors have no other effect on gameplay. Specifically, unless Space Beleren’s first loyalty ability has been activated, sector assignments have no effect on combat. A creature in one sector can block an attacking creature in another sector."},{"date":"2022-10-07","text":"A creature can never be in more than one sector. If Space Beleren is on the battlefield, another Space Beleren coming under a player’s control won’t affect any creature’s sector assignment."},{"date":"2022-10-07","text":"While Space Beleren is on the battlefield, any time there are creatures on the battlefield that aren’t assigned to a sector, those creatures are assigned to a sector by their controllers as a state-based action. First, all players who don’t control a Space Beleren (or another permanent with space sculptor, but come on) in turn order assign their creatures. Then all players who do control a Space Beleren in turn order assign their creatures."},{"date":"2022-10-07","text":"As soon as there are no permanents with space sculptor on the battlefield, all sector assignments are lost. Notably, this means that if Space Beleren’s +1 ability has been activated earlier in the turn, creatures are no longer restricted from blocking, so watch out! If another (or the same) Space Beleren returns to the battlefield, creatures on the battlefield at that time will once again be assigned to sectors, but their new sector assignments are not influenced by any previous sector assignments they may have had."},{"date":"2022-10-07","text":"A creature that changes controllers maintains its sector assignment: its new controller can’t give it a new one."},{"date":"2022-10-07","text":"Sector assignment isn’t copiable. If a creature enters the battlefield as a copy of a creature in alpha sector, for example, its controller may assign it to any sector."},{"date":"2022-10-07","text":"For the last two abilities, you choose the sector as the ability resolves."}],"printings":["UNF"],"originalText":"Space sculptor (Space Beleren divides the battlefield into alpha, beta, and gamma sectors. If a creature isn't assigned to a sector, its controller assigns it to one. Opponents assign first.)\n+1: Creatures in each sector can be blocked this turn only by creatures in the same sector.\n−1: Put a +1/+1 counter on each creature in the sector of your choice.\n−5: Destroy all creatures in the sector of your choice.","originalType":"Legendary Planeswalker — Jace","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"c739441d-479d-554f-a215-ae5c52f91285"},{"name":"The Space Family Goblinson","manaCost":"{2}{R}{G}","cmc":4.0,"colors":["G","R"],"colorIdentity":["G","R"],"type":"Legendary Creature — Goblin Guest","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Goblin","Guest"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"The Space Family Goblinson has trample as long as you've rolled three or more dice this turn.\nWhenever you roll a die, put a +1/+1 counter on The Space Family Goblinson.","flavor":"The goblin word for \"vacation\" translates roughly to \"a battered landscape of noise and violence.\"","artist":"Armand Baltazar","number":"179","power":"1","toughness":"1","layout":"normal","multiverseid":"580709","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580709&type=card","variations":["217c0d00-0fcf-52df-8aa3-e4b9f91bf9ed","f08c42fe-e742-5173-8180-5acbe4d6c892","8d528e2a-fbe7-54f5-a74b-6d022a8ab663"],"rulings":[{"date":"2022-10-07","text":"Remember that if a die is rerolled, that counts only as a single roll. The original roll doesn’t count. Similarly, any die roll that’s ignored doesn’t count."},{"date":"2022-10-07","text":"If you roll more than one die at a time, however, that does count as multiple die rolls."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"923b092f-13a0-557b-a253-626921cde862"},{"name":"Spinnerette, Arachnobat","manaCost":"{3}{B}{G}","cmc":5.0,"colors":["B","G"],"colorIdentity":["B","G"],"type":"Legendary Creature — Spider Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Spider","Performer"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Reach\nWhen Spinnerette, Arachnobat enters the battlefield, open an Attraction.\nAs long as you control three or more Attractions, Spinnerette gets +2/+0 and has menace.","flavor":"High-wire injuries are down 95%. Spider-related injuries are up 3000%.","artist":"Alexander Mokhov","number":"180","power":"2","toughness":"4","layout":"normal","multiverseid":"580710","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580710&type=card","variations":["a87d5fce-fb68-52b5-ab31-2ecbb9f81f47","7bb97baa-a027-5990-9e2e-ffed24ef8857","52e3c730-5df8-522b-89fe-a824bb6b164c"],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"a0002a16-a233-532a-a15d-5567b7db6fdb"},{"name":"Truss, Chief Engineer","manaCost":"{U}{B}","cmc":2.0,"colors":["B","U"],"colorIdentity":["B","U"],"type":"Legendary Creature — Vedalken Rogue Employee","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Vedalken","Rogue","Employee"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"Whenever Truss, Chief Engineer enters the battlefield or another creature dies, put a hack counter on Truss.\n{2}, {T}, Remove X hack counters from Truss: Add or subtract X from a number or number word on target spell or permanent until end of turn. This effect can't reduce a number below 1 or a number word below one.","artist":"Aaron J. Riley","number":"181","power":"1","toughness":"3","layout":"normal","variations":["569ddd6d-a96d-5225-b1ed-4aa1550c799a","05f06df8-52d5-5f4a-8317-e0e3540c11ec","8e04ca20-5f25-5dab-81e3-0ec2eb9b2ff3"],"rulings":[{"date":"2022-10-07","text":"Truss’s last ability affects a single number or number word on the spell or permanent. It can be anything—power, toughness, something in rules text, the name of a card (Four Wishes, anyone?), collector number, and so on. Mark says you can even change the copyright date, but don’t tell the lawyers."},{"date":"2022-10-07","text":"Note that you’re changing numbers, not digits. For example, if you remove two hack counters from Truss, you could change 10 to 12 or 8. You couldn’t change it to 30."},{"date":"2022-10-07","text":"Indefinite articles such as “a” in “draw a card” aren’t number words and can’t be modified."},{"date":"2022-10-07","text":"You can’t change any instance of X."},{"date":"2022-10-07","text":"You can change the numeral inside of a mana symbol, but you can’t modify the cost of a spell in time to pay less for it. It must already be on the stack to be a valid target for Truss’s ability."},{"date":"2022-10-07","text":"You can change the number of dice rolled for an effect only if the original instruction included a number word to describe how many dice to roll. You can’t change the “a” in “roll a six-sided die,” but you could change the “two” in “roll two six-sided dice.”"},{"date":"2022-10-07","text":"You can change the number of sides on a die. If you don’t have any thirteen-sided dice handy, you can use other dice to simulate the rolls."},{"date":"2022-10-07","text":"You can’t use Truss’s last ability to change the 1 in Truss’s last ability to a 0. Nice try though."}],"printings":["UNF"],"id":"46e0434c-0f6e-5857-bf4f-e51f8ccf4a8b"},{"name":"Tusk and Whiskers","manaCost":"{3}{G}{W}","cmc":5.0,"colors":["G","W"],"colorIdentity":["G","W"],"type":"Legendary Creature — Elephant Mouse Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Elephant","Mouse","Performer"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Whenever you put an ability sticker on a creature, put a +1/+1 counter on that creature.\n{2}{G}{W}, {T}: You get {TK}. You may put a sticker on a nonland permanent you own.","flavor":"Weighing in at a combined thirteen thousand pounds and two ounces.","artist":"Chris Seaman","number":"182","power":"4","toughness":"4","layout":"normal","multiverseid":"580711","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580711&type=card","variations":["2ab3682e-d325-56ee-b64f-7ea5c3b4b3a2","b8e767e2-70bb-5ab6-97f6-ffc709878076","23342a95-59cb-5dcb-9f0d-609c541936b5"],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"4d3a781a-4dbf-5ac1-a6df-a0fde2317923"},{"name":"Autograph Book","manaCost":"{2}","cmc":2.0,"type":"Artifact","types":["Artifact"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Autograph Book enters the battlefield with a page counter on it for each person who has signed it.\n{3}, {T}, Remove a page counter from Autograph Book: Draw a card.","flavor":"\"It was a pleasure to meet me.\"\n—Captain Rex Nebula","artist":"Ben Maier","number":"183","layout":"normal","variations":["044684bb-d5fd-5d0e-8228-d18837f34480"],"rulings":[{"date":"2022-10-07","text":"People can sign anywhere on the card, but each autograph must be distinct so they can be counted."},{"date":"2022-10-07","text":"People can sign Autograph Book more than once, but it’s one page counter per person, not per autograph, so they’re just taking up space where other people could be signing."},{"date":"2022-10-07","text":"You can (and should) sign your own Autograph Book to get things rolling."},{"date":"2022-10-07","text":"People can sign Autograph Book during the game, but signing it once it’s on the battlefield won’t add more page counters."}],"printings":["UNF"],"id":"56aad74f-2df6-5a89-8c2c-c732db25f790"},{"name":"Blue Ribbon","manaCost":"{1}","cmc":1.0,"type":"Artifact — Equipment","types":["Artifact"],"subtypes":["Equipment"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"When Blue Ribbon enters the battlefield, ask a person outside the game which creature you control is most deserving of a blue ribbon. Attach Blue Ribbon to that creature.\nEquipped creature has best in show. (Whenever another creature becomes the target of a spell or ability you control, you may copy that spell or ability. If you do, the copy targets this creature.)\nEquip {3}","artist":"Chuck Lukacs","number":"184","layout":"normal","variations":["a7c90807-b6a2-59a4-bbf7-125b5eb96745"],"rulings":[{"date":"2022-10-07","text":"If you control no creatures when Blue Ribbon’s enters-the-battlefield ability resolves, the outside person won’t be able to choose the most deserving one. Blue Ribbon will just stay unattached."},{"date":"2022-10-07","text":"If you control more than one creature with best in show, one of them becoming a target of a spell or ability you control (or a creature you control without best in show becoming such a target) will start a chain reaction. Say you control two creatures with best in show. The first becomes the target of a spell you control. That causes the best in show ability of the second creature to trigger. If you copy the spell, the second creature becomes the target of the copy, causing the best in show ability of the first creature to trigger. If you copy the spell, the first creature becomes the target of the copy causing the best in show ability of the second creature to trigger. And so on. Copying the spell or ability is optional, so the player may stop the award ceremony at their discretion."}],"printings":["UNF"],"id":"3bf6015d-785a-5465-b7f9-b9678e1a3b42"},{"name":"Celebr-8000","manaCost":"{5}","cmc":5.0,"type":"Artifact Creature — Clown Robot","types":["Artifact","Creature"],"subtypes":["Clown","Robot"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"At the beginning of combat on your turn, roll two six-sided dice. For each result of 1, Celebr-8000 gets +1/+1 until end of turn. For each other result, it gains the indicated ability until end of turn. If you rolled doubles, it also gains double strike until end of turn.\n• 2 — menace\n• 3 — vigilance\n• 4 — lifelink\n• 5 — flying\n• 6 — indestructible","artist":"Ralph Horsley","number":"185","power":"3","toughness":"3","layout":"normal","multiverseid":"580712","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580712&type=card","variations":["d5302c51-4e56-5d5e-859d-bb6fc4160509"],"rulings":[{"date":"2022-10-07","text":"If you roll a result higher than 6 because of modifications to the results, Celebr-8000 won’t gain any ability from that roll. If you roll doubles of such a number, it will still gain double strike until end of turn."}],"printings":["UNF"],"originalText":"At the beginning of combat on your turn, roll two six-sided dice. For each result of 1, Celebr-8000 gets +1/+1 until end of turn. For each other result, it gains the indicated ability until end of turn. If you rolled doubles, it also gains double strike until end of turn.\n• 2 — menace • 5 — flying\n• 3 — vigilance • 6 — indestructible\n• 4 — lifelink","originalType":"Artifact Creature — Clown Robot","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"a4bdf296-541a-5c9c-88bf-f748c3a161d6"},{"name":"Clown Car","manaCost":"{X}","cmc":0.0,"type":"Artifact — Vehicle","types":["Artifact"],"subtypes":["Vehicle"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"When Clown Car enters the battlefield, roll X six-sided dice. For each odd result, create a 1/1 white Clown Robot artifact creature token. For each even result, put a +1/+1 counter on Clown Car.\nCrew 2","flavor":"It runs on laughing gas.","artist":"Ralph Horsley","number":"186","power":"1","toughness":"1","layout":"normal","multiverseid":"580713","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580713&type=card","variations":["41d0be0f-8d87-544d-b878-485e01a8a4d1"],"rulings":[{"date":"2022-10-07","text":"If X is a very large number, you may be required to roll more dice than you physically can in a reasonable time frame. In such cases, we encourage you to use digital resources for simulating die rolls or generating random numbers."},{"date":"2022-10-07","text":"In an Un- game, if X is actually infinite (Urza’s Fun House is a pathway to many game states some consider to be unnatural), you can assume that every natural result on a six-sided die is rolled infinite times,leading to infinite Clown Robot tokens and infinite +1/+1 counters on Clown Car. If abilities trigger from you rolling those results, they will each trigger infinite times. Have fun!"}],"printings":["UNF"],"originalText":"When Clown Car enters the battlefield, roll X six-sided dice. For each odd result, create a 1/1 white Clown Robot artifact creature token. For each even result, put a +1/+1 counter on Clown Car.\nCrew 2","originalType":"Artifact — Vehicle","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"8d4c3e95-957b-543e-a7f9-5c8822539be8"},{"name":"D00-DL, Caricaturist","manaCost":"{6}","cmc":6.0,"type":"Legendary Artifact Creature — Robot","supertypes":["Legendary"],"types":["Artifact","Creature"],"subtypes":["Robot"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"When D00-DL, Caricaturist enters the battlefield, create a 4/4 colorless Sketch creature token, which you have fifteen seconds to draw. The token has flying if it has wings in its art. The same is true for first strike and a sword, vigilance and a shield, menace and mean eyes, trample and horns, deathtouch and claws, lifelink and fangs, and haste and footwear.","artist":"Ralph Horsley","number":"187","power":"1","toughness":"1","layout":"normal","variations":["b2133b14-fb18-53d7-8a50-d4852e4b9119","a3f969df-dabf-54cf-b484-3e5c84bbb6b0","a00211bf-2903-580d-b5d1-b27393056899"],"rulings":[{"date":"2022-10-07","text":"The fifteen seconds starts as the ability starts resolving and you start drawing. Someone should be ready to time you before you create the token."},{"date":"2022-10-07","text":"Whatever you use to represent the token doesn’t necessarily have to be blank, but only what you draw within the fifteen seconds will count toward determining what its abilities are."},{"date":"2022-10-07","text":"I can’t explain to you what mean eyes are exactly, but you’ll know them when you see them. Oh, you’ll know."},{"date":"2022-10-07","text":"If you go a little Picasso and all players can’t agree on what some parts of your drawing are, you may consult an outside person for a final determination."}],"printings":["UNF"],"id":"865b60bf-be0a-5547-967b-a756bb2345b4"},{"name":"Draconian Gate-Bot","manaCost":"{5}","cmc":5.0,"type":"Artifact Creature — Robot","types":["Artifact","Creature"],"subtypes":["Robot"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"When Draconian Gate-Bot enters the battlefield, choose one —\n• Open an Attraction. (Put the top card of your Attraction deck onto the battlefield.)\n• Destroy target Attraction. (It's put into its owner's junkyard.)","flavor":"\"YOU MUST BE THIS TALL TO RIDE. YOU HAVE TEN SECONDS TO COMPLY.\"","artist":"Ralph Horsley","number":"188","power":"4","toughness":"2","layout":"normal","multiverseid":"580714","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580714&type=card","variations":["ab20d313-8d98-568e-ae8f-0ac77311fdd4"],"rulings":[{"date":"2022-10-07","text":"If an Attraction that is not normally an Attraction (probably because it’s a copy of an Attraction) is destroyed, it will go to its owner’s graveyard as normal, not their junkyard."}],"printings":["UNF"],"originalText":"When Draconian Gate-Bot enters the battlefield, choose one —\n• Open an Attraction. (Put the top card of your Attraction deck onto the battlefield.)\n• Destroy target Attraction. (It's put into its owner's junkyard.)","originalType":"Artifact Creature — Robot","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"f184b4a3-1b46-51c1-b95e-f89f52062c3b"},{"name":"Greatest Show in the Multiverse","manaCost":"{7}","cmc":7.0,"type":"Artifact Enchantment — Saga","types":["Artifact","Enchantment"],"subtypes":["Saga"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nAs an additional cost to cast this spell, exile five instant and/or sorcery cards you own with the same artist and different names from outside the game.\nI, II, III — Choose one of the exiled cards at random. You may cast it without paying its mana cost.","artist":"Alix Branwyn","number":"189","layout":"saga","variations":["3401a84f-333f-5f39-b7b2-ac7368c6879c"],"rulings":[{"date":"2022-10-07","text":"Cards have the same artist if there’s an artist in common among them. For example, you could exile four cards illustrated by Zoltan Boros and one card illustrated by Zoltan Boros & Gabor Szikszai. However, you could not exile two cards illustrated by Zoltan Boros, two by Gabor Szikszai, and one by both of them, as those five cards don’t have a single artist in common across all of them."},{"date":"2022-10-07","text":"You choose whether to cast the chosen card as part of the chapter ability’s resolution. If you choose not to cast it at that time, or if you can’t cast it (perhaps because it requires a target and there are no legal targets available), you won’t be able to cast it later. But maybe a later chapter will randomly choose the card again! Hope springs eternal under the big top."},{"date":"2022-10-07","text":"In Un- games, you can choose any applicable cards from outside the game, even if they’re not part of your Draft or Sealed pool or part of your Constructed sideboard."}],"printings":["UNF"],"id":"9b129c7f-82eb-5e9e-9265-e4a9cf8d1989"},{"name":"Park Map","manaCost":"{1}","cmc":1.0,"type":"Artifact","types":["Artifact"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"{1}, Sacrifice Park Map: Search your library for a land card that doesn't have the same art as a permanent you control, reveal it, put it into your hand, then shuffle.","flavor":"It's always up-to-date, so visitors know what rides are open, how long the lines are, and which areas are closed due to gremlins.","artist":"Kirsten Zirngibl","number":"190","layout":"normal","variations":["fb4f919d-3a66-5efb-bca4-ed6c48440ab5"],"rulings":[{"date":"2022-10-07","text":"A card has the same art as another card if it has the same illustration by the same artist. If a card is modified with an art sticker, its art is no longer the same art as its original card. But other stickers that happen to be placed over the art do not modify the art. Modifications to the art that have been made outside of game effects (for example, signatures, your doodles, the occasional haiku) do not modify art."},{"date":"2022-10-07","text":"Ignores things like frame differences and printing variations when determining whether a land card has the same art as other cards. For example, a land card and the extended-art version of that same land card have the same art, even though the latter shows more of the art."}],"printings":["UNF"],"id":"51e2eb66-504a-5f13-96ac-1a659f81bb13"},{"name":"_____ _____ Rocketship","manaCost":"{4}","cmc":4.0,"type":"Artifact — Vehicle","types":["Artifact"],"subtypes":["Vehicle"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Flying\nWhen this Vehicle enters the battlefield, you may put up to two name stickers on it.\nWhenever this Vehicle attacks, choose a letter. This Vehicle gets +1/+1 until end of turn for each name sticker on it that begins with the chosen letter.\nCrew 2","artist":"Ralph Horsley","number":"191","power":"2","toughness":"3","layout":"normal","variations":["2bfd08ab-5d03-5ddf-83b0-ab3c95094569"],"rulings":[{"date":"2022-10-07","text":"When determining what a name begins with, ignore all spaces and punctuation, including blank lines."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"e19a5f35-6104-53f6-8d11-ddabbaf47cae"},{"name":"Souvenir T-Shirt","manaCost":"{3}","cmc":3.0,"type":"Artifact — Equipment","types":["Artifact"],"subtypes":["Equipment"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"Gear Up, sponsored by Wizards of the Coast — As Souvenir T-Shirt enters the battlefield, roll two six-sided dice. For each Magic-branded item you're wearing, roll an additional six-sided die. Choose two of those results.\nEquipped creature gets +X/+Y, where X is the first chosen result and Y is the second.\nEquip {4}","artist":"Michael Phillippi","number":"192","layout":"normal","variations":["f9aa7c14-999f-5437-9435-b7ee2a776bf6"],"rulings":[{"date":"2022-10-07","text":"A “Magic-branded item” is an article of clothing or wearable accessory (jewelry, etc.) that includes a Magic logo, symbols, artwork, or other brand-identifying markings. Anything that’s usually paired (socks, earrings, and so on) count as one item."},{"date":"2022-10-07","text":"You choose which result applies to power and which applies to toughness."}],"printings":["UNF"],"id":"2373c2da-2ac0-56fe-abeb-03f7a0bb4a0f"},{"name":"Strength-Testing Hammer","manaCost":"{1}","cmc":1.0,"type":"Artifact — Equipment","types":["Artifact"],"subtypes":["Equipment"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Whenever equipped creature attacks, roll a six-sided die. That creature gets +X/+0 until end of turn, where X is the result. Then if it has the greatest power or is tied for greatest power among creatures on the battlefield, draw a card.\nEquip {3}","flavor":"\"I don't know you, but that hammer rings a bell.\"","artist":"Gaboleps","number":"193","layout":"normal","multiverseid":"580716","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580716&type=card","variations":["49475d00-a70b-51e9-94b5-ad1cc2ba3fa5"],"printings":["UNF"],"originalText":"Whenever equipped creature attacks, roll a six-sided die. That creature gets +X/+0 until end of turn, where X is the result. Then if it has the greatest power or is tied for greatest power among creatures on the battlefield, draw a card.\nEquip {3}","originalType":"Artifact — Equipment","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"162b2bcb-0d62-5250-a02e-4cb1fea81dc9"},{"name":"Ticket Turbotubes","manaCost":"{3}","cmc":3.0,"type":"Artifact","types":["Artifact"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"{T}: Add one mana of any color.\n{3}, {T}: You get {TK} (a ticket counter).","flavor":"\"WE ARE FILLED WITH TICKETS. WE ARE FILLED WITH PURPOSE.\"","artist":"Matt Gaser","number":"194","layout":"normal","multiverseid":"580717","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580717&type=card","variations":["e32bbd82-eee6-5d8b-97ee-4cb6b846fd94"],"rulings":[{"date":"2022-10-07","text":"The last ability gives you a ticket counter, but it doesn’t enable you to put a sticker on anything. That ticket can be spent if another effect later allows you to put a sticker on something."}],"printings":["UNF"],"originalText":"{T}: Add one mana of any color.\n{3}, {T}: You get {Ticket} (a ticket counter).","originalType":"Artifact","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"81be2535-ab40-56f4-a0ca-682d845614b9"},{"name":"Ticketomaton","manaCost":"{3}","cmc":3.0,"type":"Artifact Creature — Robot","types":["Artifact","Creature"],"subtypes":["Robot"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"When Ticketomaton enters the battlefield, you get {TK}, then you may put a sticker on a nonland permanent you own.","flavor":"\"Please do not engage in debates on the nature of reality with the robot staff.\"\n—Astrotorium sign","artist":"Michael Phillippi","number":"195","power":"2","toughness":"2","layout":"normal","multiverseid":"580718","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580718&type=card","variations":["00f0c6fa-8a42-5d3e-a0e2-215e86d7af9a"],"printings":["UNF"],"originalText":"When Ticketomaton enters the battlefield, you get {Ticket}, then you may put a sticker on a nonland permanent you own.","originalType":"Artifact Creature — Robot","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Paupercommander","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"fd3d60f6-3795-5b50-8ded-19a088f7daeb"},{"name":"Wicker Picker","manaCost":"{3}","cmc":3.0,"type":"Artifact Creature — Scarecrow Guest","types":["Artifact","Creature"],"subtypes":["Scarecrow","Guest"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Creature spells you cast have sticker kicker {1}. (You may pay an additional {1} as you cast a creature spell. If you do, you get {TK}, then you may put a sticker on it.)","flavor":"\"Unless you're quicker, I wouldn't snicker.\"","artist":"Igor Grechanyi","number":"196","power":"2","toughness":"3","layout":"normal","multiverseid":"580719","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580719&type=card","variations":["5b5e05ad-833b-5967-abaf-02da41a9da67"],"rulings":[{"date":"2022-10-07","text":"Sticker kicker is an optional additional cost that you may pay as you cast a creature spell."},{"date":"2022-10-07","text":"If you sticker kick a creature spell, you get {TK} and may choose a sticker to put on the creature spell."},{"date":"2022-10-07","text":"If you cast a creature spell you don’t own, you may still choose to sticker kick it. If you do, you’ll get the ticket counter, even though you can’t put a sticker on a card you don’t own."},{"date":"2022-10-07","text":"You get the ticket counter and the sticker is put on the creature spell just before it’s considered cast. Any triggered abilities that trigger whenever you cast a spell with particular qualities will see the spell with the sticker applied."},{"date":"2022-10-07","text":"Conversely, you can’t use sticker kicker to change a spell’s name to get around effects that prohibit that spell from being cast (such as Meddling Mage)."},{"date":"2022-10-07","text":"Each Wicker Picker only lets you pay the sticker kicker cost once per spell. If you control multiple Wicker Pickers, then you can pay {1} for each of them, gaining {TK} and a sticker each time."},{"date":"2022-10-07","text":"If you put a creature onto the battlefield without casting it, you can’t sticker kick it."},{"date":"2022-10-07","text":"If a creature spell has kicker or multikicker and another ability that checks if it was kicked (such as Bog Badger or Phyrexian Missionary), that ability is linked to its own printed kicker or multikicker ability and will apply only if you paid its own kicker or multikicker cost. Sticker kicker won’t turn on those effects. However, sticker kicker will work with cards that care about other spells being kicked, such as Elfhame Druid or Verazol, the Split Current."}],"printings":["UNF"],"originalText":"Creature spells you cast have sticker kicker {1}. (You may pay an additional {1} as you cast a creature spell. If you do, you get {Ticket}, then you may put a sticker on it.)","originalType":"Artifact Creature — Scarecrow Guest","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"74563ac6-2a0c-56ee-9e07-6579f7c7e638"},{"name":"The Big Top","cmc":0.0,"type":"Land","types":["Land"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"{T}: Add one mana of any color that appears on your top. (A top is an outerwear garment worn on the upper body.)","flavor":"The glow of the big top can be seen for light years, but its excitement can be felt in the hearts of everyone who's ever been there.","artist":"Kirsten Zirngibl","number":"197","layout":"normal","variations":["a085d24d-fd9b-514f-86cf-41100da28870"],"rulings":[{"date":"2022-10-07","text":"If you’re wearing layers, you can count any garment that other players can see."},{"date":"2022-10-07","text":"There’s wide latitude for what counts as the five colors of mana. Any shade of red qualifies as red, and so on. Some dark shades of purple can likely pass for black mana, and some light shades of yellow can pass for white. We do those on cards sometimes."},{"date":"2022-10-07","text":"You can add any color of mana in Un- games, though, so if you really want turquoise mana, go for it."}],"printings":["UNF"],"id":"181276bc-57d5-52dc-bd15-172d53fe3bad"},{"name":"Nearby Planet","cmc":0.0,"colorIdentity":["B","G","R","U","W"],"type":"Land","types":["Land"],"rarity":"Common","set":"UNF","setName":"Unfinity","text":"Rangeling (This card is every land type, including Plains, Island, Swamp, Mountain, Forest, Desert, Gate, Lair, Locus, and all those Urza's ones.)\nNearby Planet enters the battlefield tapped.\nWhen Nearby Planet enters the battlefield, sacrifice it unless you pay {1}.","flavor":"\"Here's a nice place we haven't hit yet.\"\n—Captain Rex Nebula","artist":"Bruce Brenneise","number":"198","layout":"normal","multiverseid":"580824","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580824&type=card","variations":["db8ce153-3463-5b42-bf5c-56c7c04f40e9"],"rulings":[{"date":"2022-10-07","text":"The full list of land types (for now) is: Desert, Forest, Gate, Island, Lair, Locus, Mine, Mountain, Plains, Power-Plant, Swamp, Tower, and Urza’s."},{"date":"2022-10-07","text":"Because Nearby Planet is a Plains, it has “{T}: Add {W}.” The same is true for the other four basic land types and their corresponding colors of mana. None of the other land types it has gives it any mana abilities. Notably, Nearby Planet can’t be tapped for {C}."}],"printings":["UNF"],"originalText":"Rangeling (This card is every land type, including Plains, Island, Swamp, Mountain, Forest,  Desert, Gate, Lair, Locus, and all those Urza's ones.)\nNearby Planet enters the battlefield tapped.\nWhen Nearby Planet enters the battlefield, sacrifice it unless you pay {1}.","originalType":"Land","id":"a8312c09-290f-5e07-9219-04a1fbc2a108"},{"name":"Urza's Fun House","cmc":0.0,"type":"Land — Urza's","types":["Land"],"subtypes":["Urza's"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"{T}: Add {C}.\n{T}: Add {∞}. Activate only once and only if you control an Urza's Mine, an Urza's Power-Plant, and an Urza's Tower.\n{7}, {T}: Head to AskUrza.com and click Urza's Fun House.","artist":"Dmitry Burmak","number":"199","layout":"normal","variations":["36a529c8-6cc8-5a49-9bf9-ca27959dfc86"],"rulings":[{"date":"2022-10-07","text":"The middle ability can be activated only once. Not once per turn. Once. Okay, maybe more times. If Urza’s Fun House leaves the battlefield and returns, it’s a new object, so you can activate it again. You know, in case INFINITE MANA wasn’t enough the first time."},{"date":"2022-10-07","text":"The mana added by the middle ability is colorless mana."},{"date":"2022-10-07","text":"Once you have infinite colorless mana, it doesn’t matter how much mana you spend, you will still have infinite colorless mana. You will, however, lose infinite unspent mana as that step or phase ends."},{"date":"2022-10-07","text":"You can do a lot of cool stuff with infinite mana. And some situations may not be obvious. Rather than rehash everything ad infinitum, perhaps the Gatherer rulings on Infinity Elemental will help."},{"date":"2022-10-07","text":"The Urza’s Mine, Urza’s Power-Plant, and Urza’s Tower required to activate the middle ability needn’t be three separate permanents. If you happen to control a land that has those four land types (or perhaps one that has all land types . . . you know . . . glances up . . . it’s a different card in this . . . Nearby Planet!), you can activate the ability."},{"date":"2022-10-07","text":"AskUrza.com, the web site that powers Urza, Academy Headmaster, has expanded to support Urza’s Fun House. On that site you’ll find a button that says “ENTER THE FUN HOUSE.” As the last ability resolves, click it and find out what you paid seven mana for!"},{"date":"2022-10-07","text":"The last ability works a little differently with respect to targeting. Unlike other abilities, you may have to choose targets while that ability is resolving. If the effect that comes up requires a target and there are no legal targets available, click again until that’s not true."},{"date":"2022-10-07","text":"If an effect comes up that requires a target and there are legal targets available, you must use that effect even though you may not want to. However, the effects are all good for you or bad for your opponent. In some cases, you may not be able to take advantage. For example, if it ends up that creatures you control get +3/+3 until end of turn but you don’t control any creatures, you’re out of luck. But nothing bad will happen."},{"date":"2022-10-07","text":"Players can respond to the activation of the last ability, but not after players know what effect is going to happen."}],"printings":["UNF"],"id":"5d646a97-f63e-5573-b5ca-a7ce9b1d2f83"}]}