{"cards":[{"name":"Nocturno of Myra's Marvels","manaCost":"{2}{B}{B}","cmc":4.0,"colors":["B"],"colorIdentity":["B"],"type":"Legendary Creature — Vampire Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Vampire","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"As Nocturno of Myra's Marvels enters the battlefield, choose a word with five or more letters.\nWhenever you cast a spell with the chosen word in its rules text, you draw a card and you lose 2 life.\nPartner (You can have two commanders if both have partner.)","artist":"David Semple","number":"499","power":"2","toughness":"2","layout":"normal","variations":["dc2645f8-31f2-5396-a3ef-d720393c27e2","587973aa-8546-544a-9563-7b50029704e5","5ece4f7f-f77b-58c4-b385-b74bce7f11e5"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"Only an exact match with the chosen word would cause Nocturno’s triggered ability to trigger. For example, if you chose “attack,” casting a spell with “attacks,” “attacking,” or “attacked” in the rules text wouldn’t cause the ability to trigger."}],"printings":["UNF"],"id":"dd47a366-74ea-5f38-9e23-c7f4eb657802"},{"name":"Devil K. Nevil","manaCost":"{2}{R}","cmc":3.0,"colors":["R"],"colorIdentity":["R"],"type":"Legendary Creature — Devil Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Devil","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"Haste\nWhen Devil K. Nevil enters the battlefield, jump it over any number of creatures. If it clears those creatures, put that many +1/+1 counters on it. (You can see a jumping demonstration at DevilKNevil.com.)","artist":"David Semple","number":"500","power":"2","toughness":"1","layout":"normal","variations":["d1d1df68-eae4-5701-a2c2-9fdff7e21860","d28f6ced-770d-5114-bf3b-bbb4568fa9ef","3574c497-dc4d-5fd8-9aab-cfa75b1efb94"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"In case the video doesn’t clarify what jumping Devil K. Nevil over any number of creatures means, perhaps a lengthy text explanation will help. First, place Devil K. Nevil at the edge of the table such that about half the card vertically is sticking over the edge of the table. Then take any number of creatures on the battlefield and place them side-by-side on the table in front of Devil K. Nevil. Those creature cards should be horizontal to Devil K. Nevil’s vertical from your perspective (unless they’re not cards—see below). Ideally, the first creature card should be as close to Devil K. Nevil as it can be without touching it, but if you’d like to make the jump more difficult, we’re not going to stop you. To execute the jump, flick Devil K. Nevil from underneath to cause it to fly up into the air and forward, majestically flying over the line of creatures. You can’t just flick him horizontally. Devil craves hang time. If Devil comes to rest completely past the creatures without touching any of them, it has cleared those creatures and will earn those +1/+1 counters. If it touches any of the creatures during the jump, that’s okay, as long as Devil comes to rest past the creatures, not touching any of them. All of Devil K. Nevil must be past the farthest creature for the jump to be successful. If Devil veers off to the side and doesn’t get farther than the last creature, the jump is unsuccessful, even if it comes to rest not touching any of the creatures. An unsuccessful jump has no consequences other than shame. Shame and no +1/+1 counters."},{"date":"2022-10-07","text":"You may use any creatures on the battlefield except Devil K. Nevil itself for the jump, including your opponent’s creatures. You are limited to the number of other creatures on the battlefield for the jump attempt."},{"date":"2022-10-07","text":"For anything involved in the jump that’s a token, including Devil K. Nevil itself, use a Magic card-sized card as a substitute. Magic cards are the most Magic card-sized thing we can think of."},{"date":"2022-10-07","text":"For any card involved in the jump, the card sleeve it’s in is considered part of the card."},{"date":"2022-10-07","text":"You may choose to jump over no creatures—and thus not attempt a jump—if you want. If there are no other creatures on the battlefield as the enters-the-battlefield ability resolves, Devil K. Nevil is a stunt devil without a stunt and there won’t be a jump."},{"date":"2022-10-07","text":"The jump is considered attempted if your hand makes contact with Devil K. Nevil and it moves. You can’t use anything other than your hand to flick Devil K. Nevil. If you’re wearing gloves (which are basically card sleeves for hands), those count as part of your hand."},{"date":"2022-10-07","text":"If Devil K. Nevil is in a card sleeve, you may take it out of the sleeve if you’d like (assuming you own the card; ask permission if you don’t). However, no other modifications are allowed to the card. You can’t put anything into the sleeve to make it heavier, for example. You also can’t bend, fold, or do anything else to the card that would make it unplayable in your deck."}],"printings":["UNF"],"id":"e9694fbc-86c7-5ff6-8e70-717c69a53f41"},{"name":"Ignacio of Myra's Marvels","manaCost":"{2}{R}{R}","cmc":4.0,"colors":["R"],"colorIdentity":["R"],"type":"Legendary Creature — Lizard Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Lizard","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"As Ignacio of Myra's Marvels enters the battlefield, choose armor, blood, book, bottle, fang, fire, scroll, spear, sword, or water.\nWhenever you cast a spell with the chosen object in its art, create two Treasure tokens.\nPartner (You can have two commanders if both have partner.)","artist":"David Semple","number":"501","power":"4","toughness":"3","layout":"normal","variations":["1fe57a4e-0f93-5dea-83d0-c3c33558bf6b","b27e6eec-3628-5353-9e75-853485c957b7","e5f34607-41de-5e76-bd43-bcaef4a9915f"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"Armor is a covering worn on the body to protect against damage. It is typically metal or leather, although it can be made from anything. It can’t be a natural part of the creature."},{"date":"2022-10-07","text":"Blood is a liquid, usually red, that comes from within a creature’s circulatory system. If the blood isn’t with its previous owner—say it’s in a pool on the floor—the previous owner doesn’t need to be in the art. The blood does need to contextually be blood. Red liquid in a goblet might not be blood. Red liquid in a goblet held by a vampire? Blood. Red anything at a wedding for a pair of ancient vampires? Take a wild guess."},{"date":"2022-10-07","text":"A book is any bound pages of writing, usually with a spine of some sort. Scrolls are not books. They are scrolls. See: Scroll."},{"date":"2022-10-07","text":"A bottle is a device intended to hold liquid or small objects. It is usually made of glass. Bottles typically have necks and are designed to pour their contents. The bottle may be empty, but it should clearly be designed to hold something."},{"date":"2022-10-07","text":"A fang is a tooth, typically longer than a creature’s other teeth, and typically used to puncture enemies, often to drink their blood. The presence of non-fang teeth is important to establish that what you see are fangs and the creature just doesn’t have very long teeth."},{"date":"2022-10-07","text":"Fire is combustion or burning, whereby substances combine chemically with oxygen from the air and typically give out bright light, heat, and smoke. Fire is usually red, orange, or yellow, but it can be other colors. Note that being a hot thing doesn’t necessarily make something fire. Magma and lava, for example, are not inherently fire, although they may cause fire."},{"date":"2022-10-07","text":"A scroll is one or more pages or parchments, usually designed to be rolled up. Scrolls can be open or closed. Books are not scrolls. They are books. See: Book."},{"date":"2022-10-07","text":"A spear is the recommended serving size of pickle. It is also a pole with a pointed blade on one end. It is traditionally a weapon. For our purposes, the spear can be thrown (javelins are okay), as long the weapon’s general shape clearly implies spear. It can be sticking out of a body."},{"date":"2022-10-07","text":"A sword is a bladed weapon with a handle. If a creature is wearing a scabbard with a sword in it, and all you can see is the handle, that counts."},{"date":"2022-10-07","text":"Water is a liquid found in lakes, oceans, pools, wells, rivers, and glasses both half-empty and half-full. The liquid must contextually be water. Rain counts. Note that you must see the water. A well wouldn’t count if you couldn’t see the water inside, for example, even if the water is implied."},{"date":"2022-10-07","text":"If all players can’t agree on what’s in the art, you may consult an outside person for a final determination."}],"printings":["UNF"],"id":"e6f64c87-a612-54d3-b063-a96d45cd6ec5"},{"name":"Vorthos, Steward of Myth","manaCost":"{1}{R}","cmc":2.0,"colors":["R"],"colorIdentity":["B","G","R","U","W"],"type":"Legendary Creature — Human Gamer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Gamer"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"As Vorthos, Steward of Myth enters the battlefield, choose a named Magic character.\nEach spell you cast with the chosen character in its name, flavor text, or art costs {W}{U}{B}{R}{G} less to cast. This effect reduces only the amount of colored mana you pay.","artist":"Stephanie Buscema","number":"502","power":"1","toughness":"3","layout":"normal","variations":["8070623c-6079-5985-a951-000c9a7cb241","96aaebd2-451d-59c6-b4a0-334f89a511eb","d512fc07-9942-5b58-aa10-081421c95b37"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"You can choose any Magic character that has ever appeared in any official product or story, including characters that have appeared only in art. You can even choose characters who don’t have official names, as long as they’re clearly defined characters, like the Wanderer."},{"date":"2022-10-07","text":"Vorthos’s ability applies to any spell in which the chosen character’s name appears in any form, whether that’s possessive (e.g. Teferi and Teferi’s Protection), or a related word (e.g. Avacyn and Avacynian Priest), or a word that’s derived from their name (e.g. Niv-Mizzet and Izzet Charm)."},{"date":"2022-10-07","text":"If a character has gone by different names, you may count all versions of that character. For example, choosing Lim-Dûl will offer you a discount on (SPOILERS) The Raven Man. Choosing Urza will offer you a discount on (SPOILERS BUT VERY OLD ONES) Blind Seer."},{"date":"2022-10-07","text":"As with other acorn cards, Vorthos cares only about the actual printed card you’re casting to determine whether the chosen character appears. But would Vorthos want it any other way?"},{"date":"2022-10-07","text":"Vorthos’s ability cares whether the chosen character appears in the name, flavor text, or art of the card. It doesn’t care about rules text, watermark, set symbol, artist, and so on. No, choosing Maro as your character doesn’t let you get a discount on Look at Me, I’m the DCI."},{"date":"2022-10-07","text":"Unlike most abilities that reduce the costs of spells, Vorthos’s ability cannot be applied to generic mana costs. For example, a spell that costs {2}{B}{G} to cast would instead cost {2} to cast. One that costs {4}{U}{U} would instead cost {4}{U}."}],"printings":["UNF"],"id":"d953c865-24db-5735-8552-95906bcf613a"},{"name":"Hardy of Myra's Marvels","manaCost":"{2}{G}{G}","cmc":4.0,"colors":["G"],"colorIdentity":["G"],"type":"Legendary Creature — Elf Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Elf","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"As Hardy of Myra's Marvels enters the battlefield, choose a number.\nWhenever you cast a spell with the chosen number of lines of flavor text, put that many +1/+1 counters on target creature.\nPartner (You can have two commanders if both have partner.)","artist":"David Semple","number":"503","power":"4","toughness":"4","layout":"normal","variations":["ffc6c69e-cb16-5bda-b806-8399b5c19ffe","03c64bd2-e1f9-5451-bc06-aee5f1db8612","c439ca4c-2be3-5874-a9df-442026c2692b"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"Even in an Un- game, you must choose 0 or a positive integer. This is a change from previous Un- rules."},{"date":"2022-10-07","text":"If you choose 0 and cast a spell with no flavor text, Hardy’s triggered ability will trigger and you’ll put zero +1/+1 counters on target creature. Congrats. You did it."}],"printings":["UNF"],"id":"4f448fc0-e57d-5634-9b36-28b4040b9319"},{"name":"Jermane, Pride of the Circus","manaCost":"{G}{G}","cmc":2.0,"colors":["G"],"colorIdentity":["G"],"type":"Legendary Creature — Cat Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Cat","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"{G}, {T}: Put two +1/+1 counters on target creature with four or more legs.\n{1}{G}{G}, {T}: Until end of turn, all creatures able to block target creature with four or more legs do so.","artist":"Scooter","number":"504","power":"2","toughness":"3","layout":"normal","variations":["4c8d5dc8-0638-5d1a-8534-fe51bbc0d750","f162de1d-b0e1-5368-bb67-6ada96f67c0f","7b398373-b253-50d0-8ddc-dfeb08b7acb4"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"Generally, you look at the art of a creature card to determine whether it has four legs or not."},{"date":"2022-10-07","text":"If the creature is known to have more than four legs—say, it’s a spider—but not all its legs are visible, it still has four or more legs. It’s a legal target for either activated ability."},{"date":"2022-10-07","text":"Creature type alone isn’t always enough to tell you whether a creature has four legs or not. For example, leonin have only two legs, while tigers have four legs, but both are Cats."},{"date":"2022-10-07","text":"If there are multiple creatures in the art, only compare the one that represents the actual creature on the card. For example, Tarmogoyf (MMA) has the tarmogoyf itself and an elk in the art, and you need only consider the tarmogoyf."},{"date":"2022-10-07","text":"If there are multiple creatures in the art that each match what the card is representing, then that creature has four or more legs as long as any one of the matching creatures in the art has four or more legs. For example, Llanowar Elves (M19) has three figures in its art, all of whom are Llanowar elves. However, none of those figures has four or more legs, so Llanowar Elves is not a valid target for Jermane’s abilities. If even one of the figures had four or more legs, then the creature would be a valid target."},{"date":"2022-10-07","text":"If a creature the defending player controls can’t block the creature targeted by the last ability for any reason (such as being tapped), then it doesn’t block that creature. If there’s a cost associated with having a creature block the attacking creature, the defending player isn’t forced to pay that cost, so it doesn’t have to block in that case either."}],"printings":["UNF"],"id":"7e36537b-9309-5666-b547-5027d657ed2e"},{"name":"Ambassador Blorpityblorpboop","manaCost":"{3}{G}{U}","cmc":5.0,"colors":["G","U"],"colorIdentity":["G","U"],"type":"Legendary Creature — Alien Advisor Guest","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Alien","Advisor","Guest"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"When Ambassador Blorpityblorpboop enters the battlefield, you get {TK}{TK}{TK}, then you may put a sticker on a nonland permanent you own.\nAt the beginning of each combat, you may have Ambassador Blorpityblorpboop's base power become equal to the total power of all stickers on permanents you control and its base toughness become equal to those stickers' total toughness.","artist":"David Semple","number":"505","power":"3","toughness":"3","layout":"normal","variations":["3b5709b6-f83e-5108-a32c-5fce6cbfe591","e24f64c4-24ab-52d2-b540-76b29c6d954a","ed86e8ba-35b6-5b66-beb1-58d0775301d7"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"Ambassador Blorpityblorpboop has received a minor update to clarify its function. Specifically, its ability causes its base power to match the total power of stickers you control, and its base toughness to match the total toughness of stickers you control. The updated wording appears above."},{"date":"2022-10-07","text":"It doesn’t matter if the stickers are on creatures. Any power and toughness stickers on noncreature permanents you control will also count."},{"date":"2022-10-07","text":"Count only the powers and toughnesses of the stickers on permanents you control, not the actual powers and toughnesses of those permanents. For example, if a creature you control has a 4/4 sticker on it, but it also has three +1/+1 counters on it, it’s a 7/7 creature, but Ambassador Blorpityblorpboop’s base power and toughness would become 4/4."},{"date":"2022-10-07","text":"Ambassador Blorpityblorpboop counts all power and toughness stickers on all permanents you control, even if those power and toughness stickers don’t currently have any effect (possibly because you placed another power and toughness sticker on the same creature)."},{"date":"2022-10-07","text":"If Ambassador Blorpityblorpboop has a power and toughness sticker on it, that sticker is included when calculating for the last ability."},{"date":"2022-10-07","text":"Although Ambassador Blorpityblorpboop’s last ability considers the power and toughness stickers of permanents you control, the card itself is not considered to be stickered unless there’s actually a sticker on it."},{"date":"2022-10-07","text":"The base power and toughness change doesn’t end at end of turn; it lasts indefinitely, until Ambassador Blorpityblorpboop either leaves the battlefield or its base power and toughness changes again from another effect (for example, a power and toughness sticker being placed on it or its ability triggering again)."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"fd898be6-92fb-5537-b36b-fc68de26959c"},{"name":"Angelic Harold","manaCost":"{1}{W}{U}","cmc":3.0,"colors":["U","W"],"colorIdentity":["U","W"],"type":"Legendary Creature — Angel Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Angel","Performer"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Flying\nWhen Angelic Harold enters the battlefield, you may put a name sticker on a nonland permanent you own.\nEach creature you control with three or more words in its name gets +1/+1.","artist":"Stephanie Buscema","number":"506","power":"2","toughness":"2","layout":"normal","variations":["94e50d17-6109-50b6-9db2-9904891dd6f1","dc4642b8-a8e8-58aa-9e98-fb5c8173d93a","17984c5d-bc4c-5a44-baed-bb6b0103d76d"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"A creature token that was created with two or more creature types will (usually) qualify for the bonus bestowed by Harold’s last ability because its name is those types plus the word “Token.” It doesn’t matter what you’re using to represent the token."}],"printings":["UNF"],"id":"5197f4de-fd5f-5686-bed4-d768512b4c93"},{"name":"\"Brims\" Barone, Midway Mobster","manaCost":"{3}{W}{B}","cmc":5.0,"colors":["B","W"],"colorIdentity":["B","W"],"type":"Legendary Creature — Human Rogue","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Rogue"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"When \"Brims\" Barone, Midway Mobster enters the battlefield, put a +1/+1 counter on each other creature you control that has a hat.\n\"Brims\" Barone, Midway Mobster has menace as long as you're wearing a hat.","artist":"Stephanie Buscema","number":"507","power":"5","toughness":"4","layout":"normal","variations":["9551b2bb-e58f-5b0e-b052-63a64f4263aa","8466f5d3-b178-5ce7-98ec-4aad1ef1f689","a6321f1b-3988-58dd-b148-f02b05b4fc3a"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"Whether or not Brims has menace matters only as blockers are declared. After that point, a gust of wind removing your hat or blowing a new hat onto your head won’t change which blockers have already legally been declared."}],"printings":["UNF"],"id":"f064ff0b-40b8-5680-b9c7-c5ee43398d59"},{"name":"Captain Rex Nebula","manaCost":"{1}{R}{W}","cmc":3.0,"colors":["R","W"],"colorIdentity":["R","W"],"type":"Legendary Creature — Human Pilot Employee","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Pilot","Employee"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"At the beginning of combat on your turn, choose target nonland permanent you control. Until end of turn, it becomes a Vehicle artifact with base power and toughness each equal to its mana value, and it gains crew 2 and \"Crash Land — Whenever this Vehicle deals damage, roll a six-sided die. If the result is equal to this Vehicle's mana value, sacrifice this Vehicle, then it deals that much damage to any target.\"","artist":"Scooter","number":"508","power":"2","toughness":"2","layout":"normal","variations":["b524f7d4-6db3-5547-997d-1e3ac8bf413e","71e8d356-a9ac-5dd3-8053-fb67dfb1c5a9","37f3af28-3c8a-5609-8f51-697ad401b9f4"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"Captain Rex Nebula has received an update to its wording to clarify that the abilities it grants to the target nonland permanent last until end of turn. In addition, the Crash Land ability now causes the Vehicle to be sacrificed before it deals damage. The updated text appears above."},{"date":"2022-10-07","text":"The target of Rex Nebula’s ability will become a Vehicle artifact until end of turn. It will lose all of its previous card types and subtypes, but it will keep any supertypes (such as legendary) it previously had. If the target of Rex Nebula’s ability is a creature, it will lose all creature types (such as Zombie) it had until end of turn, and becoming crewed will not cause it to regain those subtypes."},{"date":"2022-10-07","text":"The Vehicle will retain any abilities it previously had, as well as gaining crew 2 and the ability to crash into stuff."},{"date":"2022-10-07","text":"The Crash Land ability will trigger whenever the Vehicle deals any damage, not only combat damage."},{"date":"2022-10-07","text":"The Crash Land ability will trigger once for each instance of damage, no matter how many players or permanents the Vehicle deals damage to. For example, if the Vehicle is blocked by two creatures and it deals damage to each of them at the same time, the Crash Land ability will trigger only once."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"267e0705-f5d9-5133-a25a-8c5eefe7f63b"},{"name":"Claire D'Loon, Joy Sculptor","manaCost":"{W}{U}","cmc":2.0,"colors":["U","W"],"colorIdentity":["U","W"],"type":"Legendary Creature — Human Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"When Claire D'Loon, Joy Sculptor enters the battlefield, for the rest of the game, tokens you own become cards that are still tokens. (They continue to exist after they leave the battlefield.)\n{1}{W}{U}, {T}: You may put a token from your graveyard or hand onto the battlefield.","artist":"Scooter","number":"509","power":"2","toughness":"3","layout":"normal","variations":["14e2b540-0a24-509f-8abc-8d3468de5920","3daaaf34-a86c-515f-a987-f58f23e26c3c","8871f80f-547b-50fc-873b-da676b39c38f"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"After Claire D’Loon’s enters-the-battlefield ability resolves, any token you own that leaves the battlefield will remain in existence in whatever zone it goes to. This means you must continue to represent that token with a physical object wherever it is. This applies to all tokens on the battlefield when the ability resolved, as well as all tokens you create for the rest of the game."},{"date":"2022-10-07","text":"Thanks to Claire, tokens can end up in your hand. Thanks, Claire. Most tokens don’t have a mana cost (though see below), so a token that ends up in your hand can’t be cast unless you find a way to cast it without paying its mana cost."},{"date":"2022-10-07","text":"A token that’s created as a copy of another object will remain a copy of that object after it leaves the battlefield. Assuming it copied something with a mana cost, the token will still have that mana cost, so it can be cast as normal from wherever it is if you have permission to do so. Note that this is different than a token that becomes a copy of another object and then leaves the battlefield. In that case, the copy effect wears off as the token leaves the battlefield."},{"date":"2022-10-07","text":"If a token under Claire’s influence ends up in your hand or library, the token needs to be indistinguishable from the other cards in that zone. If you’re using printed tokens, great! Make sure you’re matching the sleeves of the other cards in that zone, if any. If the token is represented by another object, such as a body part, a phone, a cat, some food, or a toy, use a Magic card (preferably a token) as a stand-in."}],"printings":["UNF"],"id":"62ce5141-7f33-558f-9b29-a8b2ebf40cb7"},{"name":"Dee Kay, Finder of the Lost","manaCost":"{1}{U}{B}","cmc":3.0,"colors":["B","U"],"colorIdentity":["B","U"],"type":"Legendary Creature — Zombie Employee","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Zombie","Employee"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"When Dee Kay, Finder of the Lost enters the battlefield, open an Attraction.\nWhenever you roll a 2, each opponent loses 1 life and you gain 1 life.\nWhenever you roll a 4, you may tap or untap target artifact or creature.\nWhenever you roll a 6, return target creature card from your graveyard to your hand.","artist":"Scooter","number":"510","power":"1","toughness":"4","layout":"normal","variations":["89dade5c-73c7-57ef-a54a-e9b027674256","4037d420-5653-523f-a6fb-94cb188cac02","1429a0bf-8f48-5c98-a434-2ee76868a7cc"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"It doesn’t matter why you rolled a die or how many sides that die has: if you roll a 2, a 4, or a 6, the corresponding ability will trigger."},{"date":"2022-10-07","text":"If you roll more than one die at a time, Dee Kay’s abilities will trigger for each corresponding result. For example, if I roll 2, 2, and 4 on three six-sided dice, her second ability will trigger twice and her third ability will trigger once."},{"date":"2022-10-07","text":"If you roll a 2, a 4, or a 6 while rolling to visit your attractions, and one or more visit abilities also trigger from that roll, you choose the order in which those abilities and Dee Kay’s ability go on the stack. You can have Dee Kay’s ability resolve before those visit abilities, after them, or in between any of them."},{"date":"2022-10-07","text":"If the spell or ability that caused you to roll a die includes any effects due to the result, resolve those effects before putting Dee Kay’s triggered abilities on the stack."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"6277d1f3-b8ea-57d7-9e0f-64cc1b36f57a"},{"name":"Grand Marshal Macie","manaCost":"{1}{W}{B}","cmc":3.0,"colors":["B","W"],"colorIdentity":["B","W"],"type":"Legendary Creature — Human Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Performer"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"You may choose not to untap Grand Marshal Macie during your untap step. If you do, put a pause counter on it, then you lose 1 life for each pause counter on it.\nWhenever Macie becomes untapped, remove all pause counters from it.\n{2}, {T}: Choose an \"until end of turn\" or \"this turn\" effect. As long as Macie remains tapped, that effect doesn't end.","artist":"Scooter","number":"511","power":"2","toughness":"2","layout":"normal","variations":["ed04d25b-43be-512d-920b-b807adba68fc","5a7329b2-2c3c-5d4b-a952-2e4a4971cf2a","e115851a-0a98-52bc-86c4-d25859ec5121"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"The chosen effect can be from any source, including one controlled by an opponent."},{"date":"2022-10-07","text":"You may choose to untap Macie during your untap step. If you do, the chosen effect will immediately end if its scheduled duration has already elapsed. This also happens if Macie becomes untapped some other way at some other time or if Macie leaves the battlefield."},{"date":"2022-10-07","text":"If Macie becomes untapped or leaves the battlefield and the chosen effect’s scheduled duration hasn’t already elapsed, the effect will continue until that time. You can use Macie’s last ability again to make sure it doesn’t end during the cleanup step."},{"date":"2022-10-07","text":"If Macie becomes untapped before her last ability resolves, you won’t choose any effect to not end."},{"date":"2022-10-07","text":"Removing pause counters from Macie won’t cause her to untap and won’t cause the chosen effect to end."}],"printings":["UNF"],"id":"ed8b5a6e-9908-5b9a-93a6-6b479be79804"},{"name":"It Came from Planet Glurg","manaCost":"{X}{X}{G}{U}","cmc":2.0,"colors":["G","U"],"colorIdentity":["G","U"],"type":"Legendary Creature — Alien Ooze","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Alien","Ooze"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"You may have It Came from Planet Glurg enter the battlefield as a copy of X different creatures on the battlefield. (It has their total power, total toughness, combined mana costs, all text boxes, names, art, and so on.)","artist":"Scooter","number":"512","power":"0","toughness":"0","layout":"normal","variations":["88689b73-0063-541a-8ef9-f18662796523","e3245608-7f9f-5912-a0ab-dfb7af759206","e0049a60-f8a1-5c4a-b869-12c58702953b"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"It Came from Planet Glurg copies exactly what was printed on the original creatures and nothing more (unless any of those creatures are copying something else or is a token; see below). It doesn't copy whether that creature is tapped or untapped, whether it has any counters or stickers on it, and Auras or Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, and so on."},{"date":"2022-10-07","text":"If an effect needs information about the creature's name, it looks at all its names to determine that information. For example, if It Came from Planet Glurg becomes a copy of both Blorbian Buddy and Rat in the Hat, it has six words in its name. The first letters of its name are B and R. A creature with alpha strike whose name came before Rat in the Hat alphabetically would have first strike while in combat with it."}],"printings":["UNF"],"id":"3d7c32fe-3c8f-5bbc-856c-25a8d3ce9af4"},{"name":"Lila, Hospitality Hostess","manaCost":"{2}{G}{W}","cmc":4.0,"colors":["G","W"],"colorIdentity":["G","W"],"type":"Legendary Creature — Elf Employee","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Elf","Employee"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"You may look at the top card of your library any time.\nYou may cast common spells from the top of your library.\nGuests you control get +1/+1.","artist":"Scooter","number":"513","power":"3","toughness":"3","layout":"normal","variations":["a043db54-4f32-5bfe-bfbd-8698d24c4ccd","539c7e15-0af6-5028-b96d-828487eeffb1","47caf335-9de6-5e03-ba13-5e79b9685ffb"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"Lila’s middle ability doesn’t change when you may cast those spells. You still pay all costs for those spells as well."},{"date":"2022-10-07","text":"Common cards have black expansion symbols. Cards from before Exodus™ don’t have expansion symbols; their rarities can be found on their Gatherer entries. (Cards with the land rarity, including basic lands, also have black expansion symbols, but Lila doesn’t let you play lands, so this hardly seems worth mentioning. Oh, sorry.)"}],"printings":["UNF"],"id":"71a199b1-adf7-5955-8ea8-d225c4463fc5"},{"name":"Magar of the Magic Strings","manaCost":"{1}{B}{R}","cmc":3.0,"colors":["B","R"],"colorIdentity":["B","R"],"type":"Legendary Creature — Minotaur Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Minotaur","Performer"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"{1}{B}{R}: Note the name of target instant or sorcery card in your graveyard and put it onto the battlefield face down. It's a 3/3 creature with \"Whenever this creature deals combat damage to a player, you may create a copy of the card with the noted name. You may cast the copy without paying its mana cost\" and \"If this creature would leave the battlefield, exile it instead of putting it anywhere else.\"","artist":"David Semple","number":"514","power":"3","toughness":"3","layout":"normal","variations":["8e9241da-e406-569c-9244-bc2554b8eb82","074edce7-8033-5c25-b4cb-774a3492721a","8fc1e197-2527-5579-8bb3-fd73ad6ee5db"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"The face-down creature has no characteristics other than the ones given to it by Magar’s ability. It has no name, no mana cost, no creature types, and no abilities other than the two Magar gives it. The creature is colorless and has a mana value of 0."},{"date":"2022-10-07","text":"You may look at face-down permanents you control at any time."},{"date":"2022-10-07","text":"If a face-down permanent you control leaves the battlefield, or if the game ends or you leave the game while you control it, you must reveal it to all players (even though in this case, everyone saw it before it entered)."},{"date":"2022-10-07","text":"If a creature enters the battlefield as a copy of a face-down creature (or if a token is created that’s a copy of one), that copy has the same characteristics as the face-down creature (in this case, it’s a 3/3 creature with the two abilities and no other characteristics), even though the copy is face up. Importantly, the noted name is not part of the face-down creature’s copiable values, so copies of the face-down creature won’t know the noted name. If one deals combat damage to a player, its controller won’t create a copy of any card."},{"date":"2022-10-07","text":"You must ensure that your face-down spells and permanents can easily be differentiated from each other. You’re not allowed to mix up the cards that represent them on the battlefield to confuse other players. The order they entered the battlefield should remain clear. Common methods for indicating this include using markers or dice, or simply placing them in order on the battlefield. You must also track how each became face down (Magar’s ability, cast face down using the morph ability, and so on)."},{"date":"2022-10-07","text":"There are no cards in this set that would turn a face-down instant or sorcery card on the battlefield face up, but some older cards can try to do this. If something tries to turn a face-down instant or sorcery card on the battlefield face up, reveal that card to show all players it’s an instant or sorcery card. The permanent remains on the battlefield face down. Abilities that trigger when a permanent turns face up won’t trigger, because even though you revealed the card, it never turned face up."},{"date":"2022-10-07","text":"If an effect tries to “blink” a face-down instant or sorcery card—that is, exile it and then return it to the battlefield—the card is exiled and remains in exile."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"6a07f6f5-972c-5b02-8129-267cf3345db3"},{"name":"Meet and Greet \"Sisay\"","manaCost":"{R}{G}","cmc":2.0,"colors":["G","R"],"colorIdentity":["G","R"],"type":"Legendary Creature — Elf Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Elf","Performer"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"Whenever you cast a spell, choose one —\n• Flavor — Meet and Greet \"Sisay\" gets +1/+1 until end of turn for each line of flavor text that spell has.\n• History — Create a Treasure token if that spell doesn't share an expansion symbol with a permanent you control or a card in your graveyard.","artist":"Scooter","number":"515","power":"1","toughness":"1","layout":"normal","variations":["bc04dea7-8cd0-53d5-ab2e-cfb577d00ffe","7edd2b9e-9a8b-552f-b7bf-415469878166","6121f9c0-a100-5814-bd96-8d68c84a6a70"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"Expansion symbols of different rarities (colors) are considered the same symbol. Essentially, the spell must be from a different expansion than every permanent you control and card in your graveyard to get the Treasure token."}],"printings":["UNF"],"id":"d0815555-07a2-511f-9349-5dae327a51de"},{"name":"Monoxa, Midway Manager","manaCost":"{2}{B}{R}","cmc":4.0,"colors":["B","R"],"colorIdentity":["B","R"],"type":"Legendary Creature — Vampire Employee","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Vampire","Employee"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Whenever you roll a 3 or higher, Monoxa, Midway Manager gains first strike until end of turn. If the roll was 4 or higher, it gains menace until end of turn. If the roll was 5 or higher, it gains lifelink until end of turn.\n{6}: Roll a six-sided die.","artist":"Scooter","number":"516","power":"3","toughness":"3","layout":"normal","variations":["35c8df48-7d48-5d77-8f59-ebcfb92aa9b1","1fb81dd4-14b2-5616-82fa-59e7fb14cc77","a6744f05-1770-57a5-ac5f-014230d4f866"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"The die roll caused by the activated ability has no inherent effect: you just roll a six-sided die, but any ability that triggers whenever you roll a die will trigger. Abilities that trigger whenever you roll a specific result, such as Monoxa’s first ability, may also trigger."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"f44e7474-d776-5c6b-bcda-4f8e4f889bbb"},{"name":"The Most Dangerous Gamer","manaCost":"{2}{B}{G}","cmc":4.0,"colors":["B","G"],"colorIdentity":["B","G"],"type":"Legendary Creature — Human Gamer Guest","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Gamer","Guest"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"Deathtouch\nWhenever The Most Dangerous Gamer enters the battlefield or attacks, open an Attraction.\nWhenever you open an Attraction, put a +1/+1 counter on The Most Dangerous Gamer.\nWhenever you claim the prize of an Attraction, destroy target permanent.","artist":"Scooter","number":"517","power":"2","toughness":"2","layout":"normal","variations":["83501f61-e0e6-5c6c-a0ce-8332dbb2810a","1c06c501-6c2d-5f07-bfba-5b8db5620111","f4f99e08-9069-5786-9a4b-fab50fa0e3a0"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"Only certain Attractions allow you to claim a prize. These will have the text “Prize —” on them."},{"date":"2022-10-07","text":"Though this card is eternal, there is currently only one eternal Attraction which allows you to claim the prize: Pick-a-Beeble. If you want to take advantage of the last ability, it’s best if you’re playing an Un- game, unless you want an appropriate level of challenge for someone calling themselves The Most Dangerous Gamer."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"3c686e35-bb9e-5bc8-80aa-a812fd911f6f"},{"name":"Myra the Magnificent","manaCost":"{2}{U}{R}","cmc":4.0,"colors":["R","U"],"colorIdentity":["R","U"],"type":"Legendary Creature — Human Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Performer"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"Whenever you cast an instant or sorcery spell from your hand, open an Attraction.\n{X}, {T}: Exile target instant or sorcery card with mana value X from your graveyard and choose an Attraction you control that doesn't have a midway counter on it. Put a midway counter on it. Whenever you visit that attraction, copy the exiled card. You may cast the copy without paying its mana cost.","artist":"Stephanie Buscema","number":"518","power":"2","toughness":"4","layout":"normal","variations":["3fbe2dee-27dd-5c53-8ec9-8903da5d9fe2","50bb65d4-f9f8-545d-a9f6-e0d6742ac709","6d68a633-e7bf-5bd6-925a-75cd68f8667d"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"Myra’s activated ability targets only the instant or sorcery card in your graveyard. It doesn’t target the Attraction. You choose the Attraction as the ability is resolving."},{"date":"2022-10-07","text":"Myra’s activated ability creates a delayed triggered ability that will trigger whenever you visit the chosen Attraction. This ability will continue to trigger as long as the Attraction is on the battlefield and the exiled card remains exiled, even if Myra leaves the battlefield, loses her abilities, or changes controllers. It will also continue to trigger if the Attraction somehow loses the midway counter."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"a4806bed-7118-548f-9939-a24474295710"},{"name":"Pietra, Crafter of Clowns","manaCost":"{1}{R}{W}","cmc":3.0,"colors":["R","W"],"colorIdentity":["R","W"],"type":"Legendary Creature — Human Clown Artificer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Clown","Artificer"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Haste\nRobots you control get +1/+1.\n{R}{W}, {T}, Tell a joke you haven't told this game to someone outside the game: Create a 1/1 white Clown Robot artifact creature token. If that person laughed, the token gains haste until end of turn.","artist":"Stephanie Buscema","number":"519","power":"3","toughness":"2","layout":"normal","variations":["59a3f406-c3f3-5000-8865-265dc583a922","977c0613-340b-5e96-ad96-d73d5a10c36c","e819aa75-7344-5683-a920-8ec5d2eafbbf"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"Robot is a creature type. There may be creatures that appear to be robotic in nature that don’t have the Robot creature type. They won’t get +1/+1 from Pietra’s second ability. That ability affects all Robots you control, not only the tokens created by the last ability."},{"date":"2022-10-07","text":"Each joke you tell should be appropriate for the audience, keeping in mind that not everyone in attendance may be aware of your personal comedic stylings."},{"date":"2022-10-07","text":"While you must use a new joke each time you activate Pietra’s ability, you may choose the same person as the audience, especially if they think you’re funny."},{"date":"2022-10-07","text":"You may read the joke from an outside source if you need to."},{"date":"2022-10-07","text":"Each Pietra you control knows what jokes you’ve told that game, even if that Pietra wasn’t under your control when you told that joke."},{"date":"2022-10-07","text":"Pietra keeps a list of jokes for every player. If another player gains control of Pietra, they can tell a joke you’ve already told, as long as they haven’t told that joke yet."},{"date":"2022-10-07","text":"Even the mildest laugh counts. A giggle, a guffaw, a chortle . . . they all give the Clown Robot haste."},{"date":"2022-10-07","text":"You may find yourself drawing quite the crowd as your joke-telling skills become legend. Make sure you identify one specific person outside the game before your joke. Only their laughter (or lack thereof) matters, even if others are rolling on the proverbial or literal floor."}],"printings":["UNF"],"id":"8e11627c-1803-533a-8ef5-4c41f1787790"},{"name":"Roxi, Publicist to the Stars","manaCost":"{2}{U}{R}","cmc":4.0,"colors":["R","U"],"colorIdentity":["R","U"],"type":"Legendary Creature — Human Employee","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Human","Employee"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Flying\nRoxi, Publicist to the Stars's power is equal to the number of permanents you control with an art sticker plus the number of cards in your graveyard with an art sticker.\nWhen Roxi enters the battlefield, distribute up to two art stickers among one or two nonland permanents you own.","artist":"Scooter","number":"520","power":"*","toughness":"4","layout":"normal","variations":["bcbbd0c1-dc44-520c-a977-51e40319a577","19666dfe-03fd-5438-b623-2ca1a41d0bac","972377f6-7647-5d50-b9a9-4984dfd71055"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"The ability that defines Roxi’s power functions in all zones, not just the battlefield. If Roxi is on the battlefield or in your graveyard and it has an art sticker, it counts toward the total."},{"date":"2022-10-07","text":"Roxi’s enters-the-battlefield ability allows you to put two art stickers on a single permanent you own or one art sticker on each of two permanents you own."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"71c436b3-8f11-50eb-9acb-1ffaa869e165"},{"name":"The Space Family Goblinson","manaCost":"{2}{R}{G}","cmc":4.0,"colors":["G","R"],"colorIdentity":["G","R"],"type":"Legendary Creature — Goblin Guest","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Goblin","Guest"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"The Space Family Goblinson has trample as long as you've rolled three or more dice this turn.\nWhenever you roll a die, put a +1/+1 counter on The Space Family Goblinson.","artist":"David Semple","number":"521","power":"1","toughness":"1","layout":"normal","variations":["923b092f-13a0-557b-a253-626921cde862","217c0d00-0fcf-52df-8aa3-e4b9f91bf9ed","f08c42fe-e742-5173-8180-5acbe4d6c892"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"Remember that if a die is rerolled, that counts only as a single roll. The original roll doesn’t count. Similarly, any die roll that’s ignored doesn’t count."},{"date":"2022-10-07","text":"If you roll more than one die at a time, however, that does count as multiple die rolls."}],"printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"8d528e2a-fbe7-54f5-a74b-6d022a8ab663"},{"name":"Spinnerette, Arachnobat","manaCost":"{3}{B}{G}","cmc":5.0,"colors":["B","G"],"colorIdentity":["B","G"],"type":"Legendary Creature — Spider Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Spider","Performer"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Reach\nWhen Spinnerette, Arachnobat enters the battlefield, open an Attraction.\nAs long as you control three or more Attractions, Spinnerette gets +2/+0 and has menace.","artist":"David Semple","number":"522","power":"2","toughness":"4","layout":"normal","variations":["a0002a16-a233-532a-a15d-5567b7db6fdb","a87d5fce-fb68-52b5-ab31-2ecbb9f81f47","7bb97baa-a027-5990-9e2e-ffed24ef8857"],"watermark":"set","printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"52e3c730-5df8-522b-89fe-a824bb6b164c"},{"name":"Truss, Chief Engineer","manaCost":"{U}{B}","cmc":2.0,"colors":["B","U"],"colorIdentity":["B","U"],"type":"Legendary Creature — Vedalken Rogue Employee","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Vedalken","Rogue","Employee"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"Whenever Truss, Chief Engineer enters the battlefield or another creature dies, put a hack counter on Truss.\n{2}, {T}, Remove X hack counters from Truss: Add or subtract X from a number or number word on target spell or permanent until end of turn. This effect can't reduce a number below 1 or a number word below one.","artist":"Scooter","number":"523","power":"1","toughness":"3","layout":"normal","variations":["46e0434c-0f6e-5857-bf4f-e51f8ccf4a8b","569ddd6d-a96d-5225-b1ed-4aa1550c799a","05f06df8-52d5-5f4a-8317-e0e3540c11ec"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"Truss’s last ability affects a single number or number word on the spell or permanent. It can be anything—power, toughness, something in rules text, the name of a card (Four Wishes, anyone?), collector number, and so on. Mark says you can even change the copyright date, but don’t tell the lawyers."},{"date":"2022-10-07","text":"Note that you’re changing numbers, not digits. For example, if you remove two hack counters from Truss, you could change 10 to 12 or 8. You couldn’t change it to 30."},{"date":"2022-10-07","text":"Indefinite articles such as “a” in “draw a card” aren’t number words and can’t be modified."},{"date":"2022-10-07","text":"You can’t change any instance of X."},{"date":"2022-10-07","text":"You can change the numeral inside of a mana symbol, but you can’t modify the cost of a spell in time to pay less for it. It must already be on the stack to be a valid target for Truss’s ability."},{"date":"2022-10-07","text":"You can change the number of dice rolled for an effect only if the original instruction included a number word to describe how many dice to roll. You can’t change the “a” in “roll a six-sided die,” but you could change the “two” in “roll two six-sided dice.”"},{"date":"2022-10-07","text":"You can change the number of sides on a die. If you don’t have any thirteen-sided dice handy, you can use other dice to simulate the rolls."},{"date":"2022-10-07","text":"You can’t use Truss’s last ability to change the 1 in Truss’s last ability to a 0. Nice try though."}],"printings":["UNF"],"id":"8e04ca20-5f25-5dab-81e3-0ec2eb9b2ff3"},{"name":"Tusk and Whiskers","manaCost":"{3}{G}{W}","cmc":5.0,"colors":["G","W"],"colorIdentity":["G","W"],"type":"Legendary Creature — Elephant Mouse Performer","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Elephant","Mouse","Performer"],"rarity":"Uncommon","set":"UNF","setName":"Unfinity","text":"Whenever you put an ability sticker on a creature, put a +1/+1 counter on that creature.\n{2}{G}{W}, {T}: You get {TK}. You may put a sticker on a nonland permanent you own.","artist":"David Semple","number":"524","power":"4","toughness":"4","layout":"normal","variations":["4d3a781a-4dbf-5ac1-a6df-a0fde2317923","2ab3682e-d325-56ee-b64f-7ea5c3b4b3a2","b8e767e2-70bb-5ab6-97f6-ffc709878076"],"watermark":"set","printings":["UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Paupercommander","legality":"Restricted"},{"format":"Vintage","legality":"Legal"}],"id":"23342a95-59cb-5dcb-9f0d-609c541936b5"},{"name":"D00-DL, Caricaturist","manaCost":"{6}","cmc":6.0,"type":"Legendary Artifact Creature — Robot","supertypes":["Legendary"],"types":["Artifact","Creature"],"subtypes":["Robot"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"When D00-DL, Caricaturist enters the battlefield, create a 4/4 colorless Sketch creature token, which you have fifteen seconds to draw. The token has flying if it has wings in its art. The same is true for first strike and a sword, vigilance and a shield, menace and mean eyes, trample and horns, deathtouch and claws, lifelink and fangs, and haste and footwear.","artist":"Scooter","number":"525","power":"1","toughness":"1","layout":"normal","variations":["865b60bf-be0a-5547-967b-a756bb2345b4","b2133b14-fb18-53d7-8a50-d4852e4b9119","a3f969df-dabf-54cf-b484-3e5c84bbb6b0"],"watermark":"set","rulings":[{"date":"2022-10-07","text":"The fifteen seconds starts as the ability starts resolving and you start drawing. Someone should be ready to time you before you create the token."},{"date":"2022-10-07","text":"Whatever you use to represent the token doesn’t necessarily have to be blank, but only what you draw within the fifteen seconds will count toward determining what its abilities are."},{"date":"2022-10-07","text":"I can’t explain to you what mean eyes are exactly, but you’ll know them when you see them. Oh, you’ll know."},{"date":"2022-10-07","text":"If you go a little Picasso and all players can’t agree on what some parts of your drawing are, you may consult an outside person for a final determination."}],"printings":["UNF"],"id":"a00211bf-2903-580d-b5d1-b27393056899"},{"name":"Comet, Stellar Pup","manaCost":"{2}{R}{W}","cmc":4.0,"colors":["R","W"],"colorIdentity":["R","W"],"type":"Legendary Planeswalker — Comet","supertypes":["Legendary"],"types":["Planeswalker"],"subtypes":["Comet"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"[0]: Roll a six-sided die.\n1 or 2 — [+2], then create two 1/1 green Squirrel creature tokens. They gain haste until end of turn.\n3 — [−1], then return a card with mana value 2 or less from your graveyard to your hand.\n4 or 5 — Comet, Stellar Pup deals damage equal to the number of loyalty counters on him to a creature or player, then [−2].\n6 — [+1], and you may activate Comet, Stellar Pup's loyalty ability two more times this turn.","artist":"David Semple","number":"526","layout":"normal","multiverseid":"580575","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580575&type=card","loyalty":"5","variations":["61ec1a4c-6b0f-51fc-b01d-557eac0d69b4","157260cb-ba4d-5c5f-940a-7c495e4ec834","866a6a1c-dd1f-5c75-99bd-c66ce302a8de"],"rulings":[{"date":"2022-10-07","text":"Each + loyalty symbol in Comet’s abilities means to put the indicated number of loyalty counters on him. Each – loyalty symbol in Comet’s abilities means to remove the indicated number of loyalty counters from him. The only difference is Comet uses these symbols in the effects of his abilities rather than the costs. Good boy, Comet."},{"date":"2022-10-07","text":"None of Comet’s abilities require a target. All choices for cards, creatures, or players are made as the abilities resolve."},{"date":"2022-10-07","text":"If you roll a 3 but there aren’t any cards with mana value 2 or less in your graveyard, you’ll just remove one loyalty counter from Comet. Sorry, boy."},{"date":"2022-10-07","text":"If you roll a 4 or 5 while Comet has one loyalty counter on him, Comet will deal 1 damage to a creature or player and then that loyalty counter will be removed. Comet will then go live on a farm, where he’ll be very happy but will miss you terribly."},{"date":"2022-10-07","text":"In some unusual cases, Comet may gain loyalty abilities other than the one he normally has. In those cases, the effect of rolling a 6 applies only to his normal ability."}],"printings":["UNF"],"originalText":"0: Roll a six-sided die.\n1 or 2 — +2, then create two 1/1 green Squirrel creature tokens. They gain haste until end of turn.\n3 — −1, then return a card with mana value 2 or less from your graveyard to your hand.\n4 or 5 — Comet, Stellar Pup deals damage equal to the number of loyalty counters on him to a creature or player, then −2.\n6 — +1, and you may activate Comet, Stellar Pup's loyalty ability two more times this turn.","originalType":"Legendary Planeswalker — Comet","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Banned"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"8721bab6-6dab-5d37-a6aa-4fdcfc642f62"},{"name":"Space Beleren","manaCost":"{2}{W}{U}","cmc":4.0,"colors":["U","W"],"colorIdentity":["U","W"],"type":"Legendary Planeswalker — Jace","supertypes":["Legendary"],"types":["Planeswalker"],"subtypes":["Jace"],"rarity":"Mythic","set":"UNF","setName":"Unfinity","text":"Space sculptor (Space Beleren divides the battlefield into alpha, beta, and gamma sectors. If a creature isn't assigned to a sector, its controller assigns it to one. Opponents assign first.)\n[+1]: Creatures in each sector can be blocked this turn only by creatures in the same sector.\n[−1]: Put a +1/+1 counter on each creature in the sector of your choice.\n[−5]: Destroy all creatures in the sector of your choice.","artist":"Scooter","number":"527","layout":"normal","multiverseid":"580576","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=580576&type=card","loyalty":"3","variations":["c739441d-479d-554f-a215-ae5c52f91285","e652bab7-775e-5ec0-9707-2641e9d4217d","533e84f0-05f5-50c9-856d-f9db6dfd787c"],"rulings":[{"date":"2022-10-07","text":"Any time Space Beleren is on the battlefield, the battlefield is divided into three sectors: alpha, beta, and gamma. All creatures will be assigned to one of the three sectors."},{"date":"2022-10-07","text":"The sectors are essentially designations that change how Space Beleren’s other abilities will affect creatures on the battlefield. The sectors have no other effect on gameplay. Specifically, unless Space Beleren’s first loyalty ability has been activated, sector assignments have no effect on combat. A creature in one sector can block an attacking creature in another sector."},{"date":"2022-10-07","text":"A creature can never be in more than one sector. If Space Beleren is on the battlefield, another Space Beleren coming under a player’s control won’t affect any creature’s sector assignment."},{"date":"2022-10-07","text":"While Space Beleren is on the battlefield, any time there are creatures on the battlefield that aren’t assigned to a sector, those creatures are assigned to a sector by their controllers as a state-based action. First, all players who don’t control a Space Beleren (or another permanent with space sculptor, but come on) in turn order assign their creatures. Then all players who do control a Space Beleren in turn order assign their creatures."},{"date":"2022-10-07","text":"As soon as there are no permanents with space sculptor on the battlefield, all sector assignments are lost. Notably, this means that if Space Beleren’s +1 ability has been activated earlier in the turn, creatures are no longer restricted from blocking, so watch out! If another (or the same) Space Beleren returns to the battlefield, creatures on the battlefield at that time will once again be assigned to sectors, but their new sector assignments are not influenced by any previous sector assignments they may have had."},{"date":"2022-10-07","text":"A creature that changes controllers maintains its sector assignment: its new controller can’t give it a new one."},{"date":"2022-10-07","text":"Sector assignment isn’t copiable. If a creature enters the battlefield as a copy of a creature in alpha sector, for example, its controller may assign it to any sector."},{"date":"2022-10-07","text":"For the last two abilities, you choose the sector as the ability resolves."}],"printings":["UNF"],"originalText":"Space sculptor (Space Beleren divides the battlefield into alpha, beta, and gamma sectors. If a creature isn't assigned to a sector, its controller assigns it to one. Opponents assign first.)\n+1: Creatures in each sector can be blocked this turn only by creatures in the same sector.\n−1: Put a +1/+1 counter on each creature in the sector of your choice.\n−5: Destroy all creatures in the sector of your choice.","originalType":"Legendary Planeswalker — Jace","legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"c44d9054-ebce-5661-8fbb-372ff5965315"},{"name":"Hallowed Fountain","cmc":0.0,"colorIdentity":["U","W"],"type":"Land — Plains Island","types":["Land"],"subtypes":["Plains","Island"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"({T}: Add {W} or {U}.)\nAs Hallowed Fountain enters the battlefield, you may pay 2 life. If you don't, it enters the battlefield tapped.","artist":"Piotr Dura","number":"528","layout":"normal","variations":["cbfdc1b0-39c9-516f-8f03-70affcbe8506"],"rulings":[{"date":"2018-10-05","text":"Unlike most dual lands, this land has two basic land types. It's not basic, so cards such as District Guide can't find it, but it does have the appropriate land types for effects such as that of Drowned Catacomb (from the Ixalan set)."},{"date":"2018-10-05","text":"If an effect puts this land onto the battlefield tapped, you may pay 2 life, but it still enters tapped."}],"printings":["DIS","EXP","PRM","PRNA","RNA","RTR","SLD","UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Explorer","legality":"Legal"},{"format":"Gladiator","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Historicbrawl","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Predh","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"3373ff29-c605-5f94-8dcf-93f8acad1794"},{"name":"Watery Grave","cmc":0.0,"colorIdentity":["B","U"],"type":"Land — Island Swamp","types":["Land"],"subtypes":["Island","Swamp"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"({T}: Add {U} or {B}.)\nAs Watery Grave enters the battlefield, you may pay 2 life. If you don't, it enters the battlefield tapped.","artist":"Chris Ostrowski","number":"529","layout":"normal","variations":["4f83f35e-ff54-55d1-a006-6e004d98e3d7"],"rulings":[{"date":"2018-10-05","text":"Unlike most dual lands, this land has two basic land types. It's not basic, so cards such as District Guide can't find it, but it does have the appropriate land types for effects such as that of Drowned Catacomb (from the Ixalan set)."},{"date":"2018-10-05","text":"If an effect puts this land onto the battlefield tapped, you may pay 2 life, but it still enters tapped."}],"printings":["EXP","GRN","GTC","PGRN","PRM","RAV","SLD","UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Explorer","legality":"Legal"},{"format":"Gladiator","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Historicbrawl","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Predh","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"0608ab2f-66a6-55c0-9117-bd831ebf6f48"},{"name":"Blood Crypt","cmc":0.0,"colorIdentity":["B","R"],"type":"Land — Swamp Mountain","types":["Land"],"subtypes":["Swamp","Mountain"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"({T}: Add {B} or {R}.)\nAs Blood Crypt enters the battlefield, you may pay 2 life. If you don't, it enters the battlefield tapped.","artist":"Chris Ostrowski","number":"530","layout":"normal","variations":["de0be7e3-b0c1-5d35-8784-957f80616ac9"],"rulings":[{"date":"2018-10-05","text":"Unlike most dual lands, this land has two basic land types. It's not basic, so cards such as District Guide can't find it, but it does have the appropriate land types for effects such as that of Drowned Catacomb (from the Ixalan set)."},{"date":"2018-10-05","text":"If an effect puts this land onto the battlefield tapped, you may pay 2 life, but it still enters tapped."}],"printings":["DIS","EXP","PLIST","PRM","PRNA","RNA","RTR","SLD","UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Explorer","legality":"Legal"},{"format":"Gladiator","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Historicbrawl","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Predh","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"214279fa-3cdc-5742-add8-8ba08358a6ad"},{"name":"Stomping Ground","cmc":0.0,"colorIdentity":["G","R"],"type":"Land — Mountain Forest","types":["Land"],"subtypes":["Mountain","Forest"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"({T}: Add {R} or {G}.)\nAs Stomping Ground enters the battlefield, you may pay 2 life. If you don't, it enters the battlefield tapped.","artist":"Bruce Brenneise","number":"531","layout":"normal","variations":["d79eaece-b4b3-5252-b236-fc5d833b10c1"],"rulings":[{"date":"2018-10-05","text":"Unlike most dual lands, this land has two basic land types. It's not basic, so cards such as District Guide can't find it, but it does have the appropriate land types for effects such as that of Drowned Catacomb (from the Ixalan set)."},{"date":"2018-10-05","text":"If an effect puts this land onto the battlefield tapped, you may pay 2 life, but it still enters tapped."}],"printings":["EXP","GPT","GTC","PRM","PRNA","RNA","SLD","UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Explorer","legality":"Legal"},{"format":"Gladiator","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Historicbrawl","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Predh","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"c16ba014-104d-5541-8a0c-2c9877b7e1f4"},{"name":"Temple Garden","cmc":0.0,"colorIdentity":["G","W"],"type":"Land — Forest Plains","types":["Land"],"subtypes":["Forest","Plains"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"({T}: Add {G} or {W}.)\nAs Temple Garden enters the battlefield, you may pay 2 life. If you don't, it enters the battlefield tapped.","artist":"Piotr Dura","number":"532","layout":"normal","variations":["22d7ef95-42b3-5cdf-8882-c070a4982dc3"],"rulings":[{"date":"2018-10-05","text":"Unlike most dual lands, this land has two basic land types. It's not basic, so cards such as District Guide can't find it, but it does have the appropriate land types for effects such as that of Drowned Catacomb (from the Ixalan set)."},{"date":"2018-10-05","text":"If an effect puts this land onto the battlefield tapped, you may pay 2 life, but it still enters tapped."}],"printings":["EXP","GRN","PGRN","PRM","RAV","RTR","SLD","UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Explorer","legality":"Legal"},{"format":"Gladiator","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Historicbrawl","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Predh","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"522bb6e5-f23f-556b-8e8f-d8b59b66ff27"},{"name":"Godless Shrine","cmc":0.0,"colorIdentity":["B","W"],"type":"Land — Plains Swamp","types":["Land"],"subtypes":["Plains","Swamp"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"({T}: Add {W} or {B}.)\nAs Godless Shrine enters the battlefield, you may pay 2 life. If you don't, it enters the battlefield tapped.","artist":"Bruce Brenneise","number":"533","layout":"normal","variations":["4e6acd3c-9f6e-566a-9261-e11cff0e2837"],"rulings":[{"date":"2018-10-05","text":"Unlike most dual lands, this land has two basic land types. It's not basic, so cards such as District Guide can't find it, but it does have the appropriate land types for effects such as that of Drowned Catacomb (from the Ixalan set)."},{"date":"2018-10-05","text":"If an effect puts this land onto the battlefield tapped, you may pay 2 life, but it still enters tapped."}],"printings":["EXP","GPT","GTC","PRM","PRNA","RNA","SLD","UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Explorer","legality":"Legal"},{"format":"Gladiator","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Historicbrawl","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Predh","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"7f8d9790-246a-5a1b-9dcd-fad03fd564ea"},{"name":"Steam Vents","cmc":0.0,"colorIdentity":["R","U"],"type":"Land — Island Mountain","types":["Land"],"subtypes":["Island","Mountain"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"({T}: Add {U} or {R}.)\nAs Steam Vents enters the battlefield, you may pay 2 life. If you don't, it enters the battlefield tapped.","artist":"Piotr Dura","number":"534","layout":"normal","variations":["73751bd4-20f9-595d-8078-2d1da506605b"],"rulings":[{"date":"2018-10-05","text":"Unlike most dual lands, this land has two basic land types. It's not basic, so cards such as District Guide can't find it, but it does have the appropriate land types for effects such as that of Drowned Catacomb (from the Ixalan set)."},{"date":"2018-10-05","text":"If an effect puts this land onto the battlefield tapped, you may pay 2 life, but it still enters tapped."}],"printings":["EXP","GPT","GRN","PGRN","PRM","RTR","SLD","UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Explorer","legality":"Legal"},{"format":"Gladiator","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Historicbrawl","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Predh","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"0d6d1e13-6ac4-5751-a5af-d7e5c489e262"},{"name":"Overgrown Tomb","cmc":0.0,"colorIdentity":["B","G"],"type":"Land — Swamp Forest","types":["Land"],"subtypes":["Swamp","Forest"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"({T}: Add {B} or {G}.)\nAs Overgrown Tomb enters the battlefield, you may pay 2 life. If you don't, it enters the battlefield tapped.","artist":"Cliff Childs","number":"535","layout":"normal","variations":["f16c3aad-8391-5384-8b67-1f657753e122"],"rulings":[{"date":"2018-10-05","text":"Unlike most dual lands, this land has two basic land types. It's not basic, so cards such as District Guide can't find it, but it does have the appropriate land types for effects such as that of Drowned Catacomb (from the Ixalan set)."},{"date":"2018-10-05","text":"If an effect puts this land onto the battlefield tapped, you may pay 2 life, but it still enters tapped."}],"printings":["EXP","GRN","PGRN","PRM","RAV","RTR","SLD","UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Explorer","legality":"Legal"},{"format":"Gladiator","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Historicbrawl","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Predh","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"48a2455b-b2bd-5622-911b-ae521a2dd03b"},{"name":"Sacred Foundry","cmc":0.0,"colorIdentity":["R","W"],"type":"Land — Mountain Plains","types":["Land"],"subtypes":["Mountain","Plains"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"({T}: Add {R} or {W}.)\nAs Sacred Foundry enters the battlefield, you may pay 2 life. If you don't, it enters the battlefield tapped.","artist":"Cliff Childs","number":"536","layout":"normal","variations":["a43a8e7e-2cb9-5ddb-b76f-0caad2177b47"],"rulings":[{"date":"2018-10-05","text":"Unlike most dual lands, this land has two basic land types. It's not basic, so cards such as District Guide can't find it, but it does have the appropriate land types for effects such as that of Drowned Catacomb (from the Ixalan set)."},{"date":"2018-10-05","text":"If an effect puts this land onto the battlefield tapped, you may pay 2 life, but it still enters tapped."}],"printings":["EXP","GRN","GTC","PGRN","PRM","RAV","SLD","UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Explorer","legality":"Legal"},{"format":"Gladiator","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Historicbrawl","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Predh","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"53db2c0b-64a5-579e-9ec4-a25e22ab5f2d"},{"name":"Breeding Pool","cmc":0.0,"colorIdentity":["G","U"],"type":"Land — Forest Island","types":["Land"],"subtypes":["Forest","Island"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"({T}: Add {G} or {U}.)\nAs Breeding Pool enters the battlefield, you may pay 2 life. If you don't, it enters the battlefield tapped.","artist":"Bruce Brenneise","number":"537","layout":"normal","variations":["186fb101-5401-5627-9404-12aae0432571"],"rulings":[{"date":"2018-10-05","text":"Unlike most dual lands, this land has two basic land types. It's not basic, so cards such as District Guide can't find it, but it does have the appropriate land types for effects such as that of Drowned Catacomb (from the Ixalan set)."},{"date":"2018-10-05","text":"If an effect puts this land onto the battlefield tapped, you may pay 2 life, but it still enters tapped."}],"printings":["DIS","EXP","GTC","PRM","PRNA","RNA","SLD","UNF"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Explorer","legality":"Legal"},{"format":"Gladiator","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Historicbrawl","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Oathbreaker","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Predh","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"2c6ebc86-ae39-56b8-9ac8-491a731a5e7a"},{"name":"Water Gun Balloon Game","manaCost":"{2}","cmc":2.0,"type":"Artifact","types":["Artifact"],"rarity":"Rare","set":"UNF","setName":"Unfinity","text":"As Water Gun Balloon Game enters the battlefield, each player puts a pop! counter on \"0.\"\nWhenever a player casts a spell, move that player's pop! counter up one.\nWhenever a player's pop! counter hits \"5,\" that player creates a 5/5 pink Giant Teddy Bear creature token and resets all pop! counters to \"0.\"","artist":"Ralph Horsley","number":"538","layout":"normal","rulings":[{"date":"2020-02-29","text":"In a game with more than two players, players can use paper and pencil to track where their pop! counter is. That is, the tracker located in Water Gun Balloon Game’s art is fun, but not required to work."},{"date":"2020-02-29","text":"Pink joins gold and every eye color imaginable in the set of colors in silver-bordered Magic games."},{"date":"2020-02-29","text":"The pop! counters are considered to be on the inherent tracker in Water Gun Balloon Game’s art, not on the permanent itself. Those counters can’t be removed or moved to another permanent. Similarly, if you proliferate, you can’t add more pop! counters to Water Gun Balloon Game."}],"printings":["UND","UNF","UNH"],"id":"cd0e3312-700b-5b29-b240-c40eb58fbe5d"}]}